{
  "metadata": {
    "search_query": "China",
    "timestamp": "2025-04-24_22-31-07",
    "total_tweets": 160,
    "language_stats": [
      {
        "language": "English",
        "code": "en",
        "count": 148,
        "percentage": 92.5
      }
    ]
  },
  "tweets": [
    {
      "id": "1915386487878582397",
      "text": "Wow. China just called out the Trump administration for blatantly lying about the existence of any ongoing negotiations between the U.S. and China. https://t.co/zSGt0lyr7c",
      "cleaned_text": "wow china just called out the trump administration for blatantly lying about the existence of any ongoing negotiations between the u s and china ",
      "favorite_count": 7356,
      "retweet_count": 2370,
      "reply_count": 293,
      "sentiment": "negative",
      "sentiment_score": -0.8495160937309265,
      "original_lang": "en"
    },
    {
      "id": "1915449706680902051",
      "text": "Trump just confirmed that meetings with China have taken place as recently as this morning! \n\nEveryone, and I mean everyone, wants to make a deal with Trump.\n\nAmerica is the quintessential economy and they know it! https://t.co/Oir8uCpPJP",
      "cleaned_text": "trump just confirmed that meetings with china have taken place as recently as this morning everyone and i mean everyone wants to make a deal with trump america is the quintessential economy and they know it ",
      "favorite_count": 81,
      "retweet_count": 14,
      "reply_count": 18,
      "sentiment": "positive",
      "sentiment_score": 0.3036094009876251,
      "original_lang": "en"
    },
    {
      "id": "1915418468385431664",
      "text": "Rashida Tlaib proposed designating Israel as an enemy of the U.S., alongside China, North Korea, and Iran.\n\nIt overwhelmingly failed 3-410.\n\nRashida, you're a piece of shit.\n\n https://t.co/GWazvotmyt",
      "cleaned_text": "rashida tlaib proposed designating israel as an enemy of the u s alongside china north korea and iran it overwhelmingly failed 3 410 rashida you re a piece of shit ",
      "favorite_count": 3448,
      "retweet_count": 822,
      "reply_count": 254,
      "sentiment": "negative",
      "sentiment_score": -0.9050353765487671,
      "original_lang": "en"
    },
    {
      "id": "1914949975038955613",
      "text": "China just destroyed the $400B global BIG luxury Brands market in a week.\n\nSales are plummeting for  LV, Gucci, Hermès, Chanel\n\nChinese creators are exposing the truth...\n\nThread🧵 https://t.co/Ctt4Hl7prn",
      "cleaned_text": "china just destroyed the 400b global big luxury brands market in a week sales are plummeting for lv gucci hermès chanel chinese creators are exposing the truth thread ",
      "favorite_count": 102638,
      "retweet_count": 17990,
      "reply_count": 4285,
      "sentiment": "negative",
      "sentiment_score": -0.5300652384757996,
      "original_lang": "en"
    },
    {
      "id": "1914894930935255465",
      "text": "BREAKING: After nuking the markets, choking global supply chains, and gutting consumer confidence, Trump now says he’s done playing hardball with China and tariffs are coming down.\n\nAll that economic carnage… just to fold like a cheap tie. https://t.co/s2eLlJXZXH",
      "cleaned_text": "breaking after nuking the markets choking global supply chains and gutting consumer confidence trump now says he s done playing hardball with china and tariffs are coming down all that economic carnage just to fold like a cheap tie ",
      "favorite_count": 26161,
      "retweet_count": 5572,
      "reply_count": 2088,
      "sentiment": "negative",
      "sentiment_score": -0.9071288704872131,
      "original_lang": "en"
    },
    {
      "id": "1915440965944504689",
      "text": "China love memes",
      "cleaned_text": "china love memes",
      "favorite_count": 142,
      "retweet_count": 31,
      "reply_count": 41,
      "sentiment": "positive",
      "sentiment_score": 0.3653565049171448,
      "original_lang": NaN
    },
    {
      "id": "1914794361310806482",
      "text": "BREAKING: In a stunning moment, Donald Trump appears to have changed his tune drastically about China. He went from bombastic on his trade war to admitting he's not going to play hardball. \"We're going to be very nice.\" He sounds desperate.\nhttps://t.co/YsZEFp2edt",
      "cleaned_text": "breaking in a stunning moment donald trump appears to have changed his tune drastically about china he went from bombastic on his trade war to admitting he s not going to play hardball we re going to be very nice he sounds desperate ",
      "favorite_count": 17633,
      "retweet_count": 3868,
      "reply_count": 2989,
      "sentiment": "positive",
      "sentiment_score": 0.3061816990375519,
      "original_lang": "en"
    },
    {
      "id": "1913733871155257356",
      "text": "“China wins a trade war with the U.S.” — Jeffrey Sachs\n\nChina produces, while the U.S. consumes on credit. \n\nTrump doesn’t get it because \"he never made it to the second day of econ class.\"\n\n\"Our political system is in a state of collapse.\" https://t.co/XwAGcINHaw",
      "cleaned_text": " china wins a trade war with the u s jeffrey sachs china produces while the u s consumes on credit trump doesn t get it because he never made it to the second day of econ class our political system is in a state of collapse ",
      "favorite_count": 46672,
      "retweet_count": 11472,
      "reply_count": 1690,
      "sentiment": "negative",
      "sentiment_score": -0.7439669966697693,
      "original_lang": "en"
    },
    {
      "id": "1915378032103109030",
      "text": "🚨BREAKING: Would you want China to forfeit its 349,442 acres of U.S. farmland and be banned from purchasing more?\n\nYES or NO? https://t.co/K8YSDzbXJW",
      "cleaned_text": " breaking would you want china to forfeit its 349 442 acres of u s farmland and be banned from purchasing more yes or no ",
      "favorite_count": 911,
      "retweet_count": 130,
      "reply_count": 512,
      "sentiment": "negative",
      "sentiment_score": -0.8270683884620667,
      "original_lang": "en"
    },
    {
      "id": "1915443891916210558",
      "text": "REPORTER: Can you clarify with whom the U.S. is speaking with China? They're saying it's fake news that trade talks are happening.\n\n@POTUS: \"Well, they had a meeting this morning... we may reveal it later, but they had meetings this morning, and we've been meeting with China.\" https://t.co/99HGQIsCHf",
      "cleaned_text": "reporter can you clarify with whom the u s is speaking with china they re saying it s fake news that trade talks are happening well they had a meeting this morning we may reveal it later but they had meetings this morning and we ve been meeting with china ",
      "favorite_count": 1505,
      "retweet_count": 314,
      "reply_count": 85,
      "sentiment": "negative",
      "sentiment_score": -0.33652281761169434,
      "original_lang": "en"
    },
    {
      "id": "1914065778862698824",
      "text": "President Trump just posted this showing photos of the trash that China has dumped into the Pacific Ocean.\n\nThis needs to be fixed. https://t.co/nDHjTUF87h",
      "cleaned_text": "president trump just posted this showing photos of the trash that china has dumped into the pacific ocean this needs to be fixed ",
      "favorite_count": 3736,
      "retweet_count": 1586,
      "reply_count": 353,
      "sentiment": "negative",
      "sentiment_score": -0.8426977396011353,
      "original_lang": "en"
    },
    {
      "id": "1915374191068799354",
      "text": "China has just sent three astronauts to its space station in which another three Chinese astronauts are waiting for their arrival. \n\nIt won’t be long until we send astronauts to the Moon. https://t.co/7U3caM1cY1",
      "cleaned_text": "china has just sent three astronauts to its space station in which another three chinese astronauts are waiting for their arrival it won t be long until we send astronauts to the moon ",
      "favorite_count": 200,
      "retweet_count": 20,
      "reply_count": 15,
      "sentiment": "positive",
      "sentiment_score": 0.1533253937959671,
      "original_lang": "en"
    },
    {
      "id": "1915072925478350885",
      "text": "China needs to change. The country knows it needs to change. Everyone knows it needs to change.\n\nAnd we want to help it change—because we need rebalancing too. https://t.co/XiQPANCeGz",
      "cleaned_text": "china needs to change the country knows it needs to change everyone knows it needs to change and we want to help it change because we need rebalancing too ",
      "favorite_count": 15239,
      "retweet_count": 2437,
      "reply_count": 2625,
      "sentiment": "neutral",
      "sentiment_score": 0.019009515643119812,
      "original_lang": "en"
    },
    {
      "id": "1915446043052855467",
      "text": "🚨 JUST IN: President Trump has CONFIRMED the U.S. has been having meetings with China on trade negotiations\n\n“We may reveal it later… but we’ve been meeting with China.”\n\nChina’s days of royally screwing Americans are coming to an end. https://t.co/PR3t0sxmhU",
      "cleaned_text": " just in president trump has confirmed the u s has been having meetings with china on trade negotiations we may reveal it later but we ve been meeting with china china s days of royally screwing americans are coming to an end ",
      "favorite_count": 439,
      "retweet_count": 72,
      "reply_count": 34,
      "sentiment": "negative",
      "sentiment_score": -0.3601401150226593,
      "original_lang": "en"
    },
    {
      "id": "1915446986230079750",
      "text": "Reporter: “[China is] saying it's fake news that trade talks are happening.”\n\nTrump: “Well, they had a meeting this morning.”\n\nReporter: “Who's they?”\n\nTrump: “I can't tell you. It doesn't matter who they is.” https://t.co/lwXsm06gUl",
      "cleaned_text": "reporter china is saying it s fake news that trade talks are happening trump well they had a meeting this morning reporter who s they trump i can t tell you it doesn t matter who they is ",
      "favorite_count": 67,
      "retweet_count": 24,
      "reply_count": 18,
      "sentiment": "negative",
      "sentiment_score": -0.5274155139923096,
      "original_lang": "en"
    },
    {
      "id": "1913617382171464084",
      "text": "EZpass purchased by China 1.9 billion dollars. https://t.co/59qZz7adQp",
      "cleaned_text": "ezpass purchased by china 1 9 billion dollars ",
      "favorite_count": 3592,
      "retweet_count": 2378,
      "reply_count": 254,
      "sentiment": "positive",
      "sentiment_score": 0.08424343168735504,
      "original_lang": "en"
    },
    {
      "id": "1915113808621920479",
      "text": "Holy shit… 👀\n\nTrump confirms his tariff plan is going to “substantially lower income taxes once this is finished”.\n\nTrump also confirms he is in “active talks” with China, and essentially the entire world.\n\nI have no idea if it will work, but it’s certainly worth a shot. https://t.co/tnyyJDZ6Ze",
      "cleaned_text": "holy shit trump confirms his tariff plan is going to substantially lower income taxes once this is finished trump also confirms he is in active talks with china and essentially the entire world i have no idea if it will work but it s certainly worth a shot ",
      "favorite_count": 10757,
      "retweet_count": 1645,
      "reply_count": 663,
      "sentiment": "positive",
      "sentiment_score": 0.2983642816543579,
      "original_lang": "en"
    },
    {
      "id": "1915447961095491626",
      "text": "Q: “China says it’s fake news that trade talks are happening.”\n\nTRUMP: “Well, they had a meeting this morning.”\n\nQ: “Who is ‘they’?”\n\nTRUMP: “Doesn’t matter… We may reveal it later… As usual, you’re reporting wrong.” \n\n*ENDS PRESSER* 🤷🏼‍♂️ https://t.co/SUZolzFxmp",
      "cleaned_text": "q china says it s fake news that trade talks are happening trump well they had a meeting this morning q who is they trump doesn t matter we may reveal it later as usual you re reporting wrong ends presser ",
      "favorite_count": 119,
      "retweet_count": 36,
      "reply_count": 17,
      "sentiment": "negative",
      "sentiment_score": -0.7219655513763428,
      "original_lang": "en"
    },
    {
      "id": "1914783587850969398",
      "text": "I’m still reviewing Secretary Rubio’s reorganization of the State Department, but I already know one thing: he needs to come to Congress and testify about how this plan would help us compete with China, and make America safer and stronger. https://t.co/w9YRSwyWgD",
      "cleaned_text": "i m still reviewing secretary rubio s reorganization of the state department but i already know one thing he needs to come to congress and testify about how this plan would help us compete with china and make america safer and stronger ",
      "favorite_count": 3080,
      "retweet_count": 927,
      "reply_count": 514,
      "sentiment": "positive",
      "sentiment_score": 0.20032906532287598,
      "original_lang": "en"
    },
    {
      "id": "1915393431750267001",
      "text": "A summary of China visit. https://t.co/wfZxdLNO0f",
      "cleaned_text": "a summary of china visit ",
      "favorite_count": 2509,
      "retweet_count": 599,
      "reply_count": 54,
      "sentiment": "neutral",
      "sentiment_score": -0.0053179264068603516,
      "original_lang": "en"
    },
    {
      "id": "1913976086293082410",
      "text": "In China, for affordable prices, people can rent an entire mall after closing hours for soft gel wars. https://t.co/Md4mDty3CF",
      "cleaned_text": "in china for affordable prices people can rent an entire mall after closing hours for soft gel wars ",
      "favorite_count": 73852,
      "retweet_count": 5470,
      "reply_count": 847,
      "sentiment": "neutral",
      "sentiment_score": -0.002719774842262268,
      "original_lang": "en"
    },
    {
      "id": "1915446890964935003",
      "text": "I believe this election is no longer about the Liberals vs Conservatives\n\nIt’s Mainstream Media/China/Liberals vs the Conservatives\n\nDon’t believe me? Just look at the Toronto Star search results for Pierre Poilievre. It’s disgusting. It perfectly summarizes my disdain for MSM https://t.co/oF09dYKOsF",
      "cleaned_text": "i believe this election is no longer about the liberals vs conservatives it s mainstream media china liberals vs the conservatives don t believe me just look at the toronto star search results for pierre poilievre it s disgusting it perfectly summarizes my disdain for msm ",
      "favorite_count": 229,
      "retweet_count": 78,
      "reply_count": 12,
      "sentiment": "negative",
      "sentiment_score": -0.8841047286987305,
      "original_lang": "en"
    },
    {
      "id": "1915444750364352617",
      "text": "Reporter: China is saying that it’s fake news that trade talks are happening \n\nTrump: They had a meeting this morning. We’ve been meeting with China. I think you have your reporting wrong https://t.co/r8Yr4Wgay8",
      "cleaned_text": "reporter china is saying that it s fake news that trade talks are happening trump they had a meeting this morning we ve been meeting with china i think you have your reporting wrong ",
      "favorite_count": 201,
      "retweet_count": 63,
      "reply_count": 85,
      "sentiment": "negative",
      "sentiment_score": -0.7726722955703735,
      "original_lang": "en"
    },
    {
      "id": "1915423523587174550",
      "text": "I care about every business I invest in America. You're weak when you say we can't deal with this now. Be strong and get ready for the fight of your life to settle this issue with China. Cheating, stealing, ripping off American IP, enough is enough. It's time to deal with it now. Have some backbone and show some strength. That is the American brand. That is the American entrepreneur.",
      "cleaned_text": "i care about every business i invest in america you re weak when you say we can t deal with this now be strong and get ready for the fight of your life to settle this issue with china cheating stealing ripping off american ip enough is enough it s time to deal with it now have some backbone and show some strength that is the american brand that is the american entrepreneur ",
      "favorite_count": 1017,
      "retweet_count": 218,
      "reply_count": 66,
      "sentiment": "negative",
      "sentiment_score": -0.2720702886581421,
      "original_lang": "en"
    },
    {
      "id": "1913632297770770734",
      "text": "The sincere GOP belief seems to be, \"China released COVID — a cold, a mild flu at worst — to destroy the West\"",
      "cleaned_text": "the sincere gop belief seems to be china released covid a cold a mild flu at worst to destroy the west ",
      "favorite_count": 40689,
      "retweet_count": 2327,
      "reply_count": 226,
      "sentiment": "negative",
      "sentiment_score": -0.8792344331741333,
      "original_lang": "en"
    },
    {
      "id": "1915385148616433734",
      "text": "“China and the U.S. have not consulted or negotiated on the issue of tariffs, let alone reach an agreement.” - PRC Spokesman\n\nXi not calling anytime soon. \n\n https://t.co/7hd2y1scXQ",
      "cleaned_text": " china and the u s have not consulted or negotiated on the issue of tariffs let alone reach an agreement prc spokesman xi not calling anytime soon ",
      "favorite_count": 4315,
      "retweet_count": 1015,
      "reply_count": 257,
      "sentiment": "negative",
      "sentiment_score": -0.4657733738422394,
      "original_lang": "en"
    },
    {
      "id": "1915419064387985523",
      "text": "BREAKING 🚨 Donald Trump EXPOSES China for being UNFAIR to a U.S. company\n\nWE WILL NOT BACK DOWN https://t.co/q4WlWd2Ud5",
      "cleaned_text": "breaking donald trump exposes china for being unfair to a u s company we will not back down ",
      "favorite_count": 723,
      "retweet_count": 229,
      "reply_count": 42,
      "sentiment": "negative",
      "sentiment_score": -0.8753184080123901,
      "original_lang": "en"
    },
    {
      "id": "1915416856329941252",
      "text": "Trump shit talking China again. https://t.co/jUzGi9oEjc",
      "cleaned_text": "trump shit talking china again ",
      "favorite_count": 397,
      "retweet_count": 42,
      "reply_count": 99,
      "sentiment": "negative",
      "sentiment_score": -0.8042247891426086,
      "original_lang": NaN
    },
    {
      "id": "1915118850103976091",
      "text": "HUH? Trump says there will be a reduction in tariffs on China, but Karoline Leavitt just said on Fox that there won’t be. Which one is it??? The Trump administration is a mess!!! https://t.co/Gmlu3ltbNH",
      "cleaned_text": "huh trump says there will be a reduction in tariffs on china but karoline leavitt just said on fox that there won t be which one is it the trump administration is a mess ",
      "favorite_count": 4893,
      "retweet_count": 872,
      "reply_count": 415,
      "sentiment": "negative",
      "sentiment_score": -0.8706231117248535,
      "original_lang": "en"
    },
    {
      "id": "1914066855616025076",
      "text": "Parabenizamos @hugocalderano pela histórica vitória na Copa do Mundo de Tênis de Mesa em Macau! Um belo exemplo do poder do esporte em unir culturas. Que a amizade sino-brasileira continue se fortalecendo nas arenas esportivas!🏓 https://t.co/alOMZACRZj",
      "cleaned_text": "parabenizamos pela histórica vitória na copa do mundo de tênis de mesa em macau um belo exemplo do poder do esporte em unir culturas que a amizade sino brasileira continue se fortalecendo nas arenas esportivas ",
      "favorite_count": 17608,
      "retweet_count": 1033,
      "reply_count": 125,
      "sentiment": "positive",
      "sentiment_score": 0.8783583641052246,
      "original_lang": NaN
    },
    {
      "id": "1914485906935046253",
      "text": "🚨BREAKING: Do you support China being forced to give up its 385,000 acres of United State's farmland and being banned from purchasing more?\n\nYES or NO? https://t.co/1lxB58lszc",
      "cleaned_text": " breaking do you support china being forced to give up its 385 000 acres of united state s farmland and being banned from purchasing more yes or no ",
      "favorite_count": 14594,
      "retweet_count": 1003,
      "reply_count": 3520,
      "sentiment": "negative",
      "sentiment_score": -0.8340858221054077,
      "original_lang": "en"
    },
    {
      "id": "1915448352285634958",
      "text": "🚨CHINA FOREIGN MINISTRY SPOKESPERSON: \"CHINA AND THE U.S. ARE NOT HAVING ANY CONSULTATION OR NEGOTIATION ON TARIFFS.\" https://t.co/kBdOQU9cvG",
      "cleaned_text": " china foreign ministry spokesperson china and the u s are not having any consultation or negotiation on tariffs ",
      "favorite_count": 25,
      "retweet_count": 6,
      "reply_count": 23,
      "sentiment": "negative",
      "sentiment_score": -0.5373273491859436,
      "original_lang": "en"
    },
    {
      "id": "1915061351656919543",
      "text": "China https://t.co/ssyJCbA2Gp",
      "cleaned_text": "china ",
      "favorite_count": 1942,
      "retweet_count": 394,
      "reply_count": 105,
      "sentiment": "negative",
      "sentiment_score": -0.07574279606342316,
      "original_lang": NaN
    },
    {
      "id": "1915399451100766407",
      "text": "Trump yesterday: We are talking to China \"every day.\"\n\nChina today: China and the US have not held any trade discussions, all such reports are false.\n\nChina has just effectively denied any claims of a trade deal in the making. https://t.co/F9LjSE1f1X",
      "cleaned_text": "trump yesterday we are talking to china every day china today china and the us have not held any trade discussions all such reports are false china has just effectively denied any claims of a trade deal in the making ",
      "favorite_count": 2294,
      "retweet_count": 387,
      "reply_count": 284,
      "sentiment": "negative",
      "sentiment_score": -0.7285640835762024,
      "original_lang": "en"
    },
    {
      "id": "1915447309799674244",
      "text": "BREAKING: When asked about China reporting that the US and China have not had discussions regarding Tariffs, Trump says \n\n\"The had a meeting this morning. Doesn't mattery who 'They' is. I think you have your reporting wrong.\"\n\nIs it dementia or is he just a really bad liar? https://t.co/n0lQGCtaD5",
      "cleaned_text": "breaking when asked about china reporting that the us and china have not had discussions regarding tariffs trump says the had a meeting this morning doesn t mattery who they is i think you have your reporting wrong is it dementia or is he just a really bad liar ",
      "favorite_count": 102,
      "retweet_count": 24,
      "reply_count": 54,
      "sentiment": "negative",
      "sentiment_score": -0.8970507383346558,
      "original_lang": "en"
    },
    {
      "id": "1914853286202761436",
      "text": "1. Trump placed tariffs on China.\n2. China went and made trade deals with other countries.\n3. Trump is now saying he will reduce tariffs on China.\n\nWhat chapter is this in \"The Art of the Deal\"?",
      "cleaned_text": "1 trump placed tariffs on china 2 china went and made trade deals with other countries 3 trump is now saying he will reduce tariffs on china what chapter is this in the art of the deal ",
      "favorite_count": 32696,
      "retweet_count": 4418,
      "reply_count": 1465,
      "sentiment": "negative",
      "sentiment_score": -0.16351716220378876,
      "original_lang": "en"
    },
    {
      "id": "1915377130222875107",
      "text": "JUST IN: 🇨🇳🇺🇸 China says it has not had any trade negotiations with the United States, contradicting President Trump's claims. https://t.co/wu2QCepSNg",
      "cleaned_text": "just in china says it has not had any trade negotiations with the united states contradicting president trump s claims ",
      "favorite_count": 6985,
      "retweet_count": 1126,
      "reply_count": 876,
      "sentiment": "negative",
      "sentiment_score": -0.5009686350822449,
      "original_lang": "en"
    },
    {
      "id": "1915158177621946400",
      "text": "BREAKING: Trump is asked how soon will he lower the tariffs in China.\n\nHis answer?\n\n“That’s up to them.”\n\nIn other words, he doesn’t plan on doing it. It was just something he said to boost the stock market. https://t.co/0XJrh9VftU",
      "cleaned_text": "breaking trump is asked how soon will he lower the tariffs in china his answer that s up to them in other words he doesn t plan on doing it it was just something he said to boost the stock market ",
      "favorite_count": 3238,
      "retweet_count": 722,
      "reply_count": 484,
      "sentiment": "negative",
      "sentiment_score": -0.23236319422721863,
      "original_lang": "en"
    },
    {
      "id": "1914824952999534621",
      "text": "Trump is folding to China. Art of the deal. https://t.co/1QKn640itF",
      "cleaned_text": "trump is folding to china art of the deal ",
      "favorite_count": 3073,
      "retweet_count": 532,
      "reply_count": 201,
      "sentiment": "negative",
      "sentiment_score": -0.2622533142566681,
      "original_lang": "en"
    },
    {
      "id": "1914738395747586259",
      "text": "The tariffs are working!\n\nThe Trump admin are close to a deal with China and are negotiating new trade deals with 34 countries.\n\nTrump exercised his leverage, started negotiations from a strong position, and created a sense of urgency.\n\nArt of the Deal.\n\n https://t.co/LlnSkNEhjt",
      "cleaned_text": "the tariffs are working the trump admin are close to a deal with china and are negotiating new trade deals with 34 countries trump exercised his leverage started negotiations from a strong position and created a sense of urgency art of the deal ",
      "favorite_count": 6572,
      "retweet_count": 1178,
      "reply_count": 1120,
      "sentiment": "positive",
      "sentiment_score": 0.34252551198005676,
      "original_lang": "en"
    },
    {
      "id": "1915429301069000756",
      "text": "🚨MAJOR BREAKING TRADE DEVASTATION FOR TRUMP\n\nChina spokesman Guo Jiakun says that Trump’s “blackmail” negotiation tactics will NEVER work with China.\n\n“A deal while exerting extreme pressure is not the right way to deal with China and simply will not work.”\n\nIt gets worse:\n\nJiakun also called media reports and claims by Trump that he has spoken with China and are close to a deal is what he called, “FAKE NEWS.”\n\n“We have made it very clear that China does not look for a war, but neither are we afraid of it. We will fight, if fight we must.”\n\nArt of the deal. \n\n🤡",
      "cleaned_text": " major breaking trade devastation for trump china spokesman guo jiakun says that trump s blackmail negotiation tactics will never work with china a deal while exerting extreme pressure is not the right way to deal with china and simply will not work it gets worse jiakun also called media reports and claims by trump that he has spoken with china and are close to a deal is what he called fake news we have made it very clear that china does not look for a war but neither are we afraid of it we will fight if fight we must art of the deal ",
      "favorite_count": 2689,
      "retweet_count": 799,
      "reply_count": 100,
      "sentiment": "negative",
      "sentiment_score": -0.8457202911376953,
      "original_lang": "en"
    },
    {
      "id": "1915432293428056447",
      "text": "The White House clearly wants Ukraine to surrender to Russia, in response to two unprovoked instances of aggression in the last decade. If the U.S. gives into Russia, we are signing a permission slip for rogue states around the world, like China, to do the same thing. https://t.co/XoQ6qfFpOb",
      "cleaned_text": "the white house clearly wants ukraine to surrender to russia in response to two unprovoked instances of aggression in the last decade if the u s gives into russia we are signing a permission slip for rogue states around the world like china to do the same thing ",
      "favorite_count": 957,
      "retweet_count": 268,
      "reply_count": 73,
      "sentiment": "negative",
      "sentiment_score": -0.8019199371337891,
      "original_lang": "en"
    },
    {
      "id": "1915171372810072147",
      "text": "China says it wants to partner with Canada to push back against American ’bullying’ https://t.co/67KrPs9OBu https://t.co/eCDpF3hcNy",
      "cleaned_text": "china says it wants to partner with canada to push back against american bullying ",
      "favorite_count": 2881,
      "retweet_count": 611,
      "reply_count": 1389,
      "sentiment": "neutral",
      "sentiment_score": 0.0467248260974884,
      "original_lang": "en"
    },
    {
      "id": "1914656327567397248",
      "text": "Want to win the trade war with China? Hear me out👇 https://t.co/wZNjxcEqRu",
      "cleaned_text": "want to win the trade war with china hear me out ",
      "favorite_count": 6417,
      "retweet_count": 754,
      "reply_count": 114,
      "sentiment": "negative",
      "sentiment_score": -0.05448000133037567,
      "original_lang": "en"
    },
    {
      "id": "1915388666861539687",
      "text": "China just called out Trump for lying about ongoing trade negotiations. \n\n“There are currently no economic and trade negotiations between China and US” https://t.co/ubIckwhi8V",
      "cleaned_text": "china just called out trump for lying about ongoing trade negotiations there are currently no economic and trade negotiations between china and us ",
      "favorite_count": 229,
      "retweet_count": 94,
      "reply_count": 17,
      "sentiment": "negative",
      "sentiment_score": -0.8208421468734741,
      "original_lang": "en"
    },
    {
      "id": "1915308625645707545",
      "text": "Reporter: Has there been any direct contact between the U.S. and China on trade at all?\n\n🇺🇸Trump: Yeah, of course — every day.\n\n🇨🇳Chinese Foreign Ministry: ALL Fake News, China and U.S. haven’t conducted any consultation nor negotiation on #tariffs.\n\nhttps://t.co/FrIsP9XRqf",
      "cleaned_text": "reporter has there been any direct contact between the u s and china on trade at all trump yeah of course every day chinese foreign ministry all fake news china and u s haven t conducted any consultation nor negotiation on ",
      "favorite_count": 2714,
      "retweet_count": 894,
      "reply_count": 210,
      "sentiment": "negative",
      "sentiment_score": -0.5695028901100159,
      "original_lang": "en"
    },
    {
      "id": "1915355252137611275",
      "text": "BREAKING:  China calls Trump’s claims that the two nations have been talking about a trade deal, “fake news”. \n\nChina says there are NO ongoing talks with the U.S. and they have just called for the U.S. to cancel unilateral tariffs.",
      "cleaned_text": "breaking china calls trump s claims that the two nations have been talking about a trade deal fake news china says there are no ongoing talks with the u s and they have just called for the u s to cancel unilateral tariffs ",
      "favorite_count": 28526,
      "retweet_count": 4151,
      "reply_count": 1122,
      "sentiment": "negative",
      "sentiment_score": -0.7119739651679993,
      "original_lang": "en"
    },
    {
      "id": "1915371463978476031",
      "text": "Trump: U.S. doing very well on trade deal with China.\n\nChina: That's a lie, we never even spoke to you.",
      "cleaned_text": "trump u s doing very well on trade deal with china china that s a lie we never even spoke to you ",
      "favorite_count": 8288,
      "retweet_count": 1534,
      "reply_count": 206,
      "sentiment": "negative",
      "sentiment_score": -0.656302273273468,
      "original_lang": "en"
    },
    {
      "id": "1914650129883111490",
      "text": "🚨Update: India strikes China in Trade War!! India has placed 12% tariff on all steel to stop cheap imports from China!! India has sided with the US in the Trade War!! https://t.co/TGMke5rfML",
      "cleaned_text": " update india strikes china in trade war india has placed 12 tariff on all steel to stop cheap imports from china india has sided with the us in the trade war ",
      "favorite_count": 3361,
      "retweet_count": 511,
      "reply_count": 110,
      "sentiment": "negative",
      "sentiment_score": -0.5948026180267334,
      "original_lang": "en"
    },
    {
      "id": "1914629070333112331",
      "text": "Donald Trump is bringing China to the table. Point blank, period. \n\n@IngrahamAngle https://t.co/fuHNf08GWY",
      "cleaned_text": "donald trump is bringing china to the table point blank period ",
      "favorite_count": 2849,
      "retweet_count": 526,
      "reply_count": 304,
      "sentiment": "negative",
      "sentiment_score": -0.7422829866409302,
      "original_lang": "en"
    },
    {
      "id": "1915384501665964102",
      "text": "🔴 Rashida Tlaib proposed to designate Israel as an enemy of the U.S., alongside China, North Korea, and Iran. It failed 3-410 https://t.co/kJiw6YkPwj",
      "cleaned_text": " rashida tlaib proposed to designate israel as an enemy of the u s alongside china north korea and iran it failed 3 410 ",
      "favorite_count": 4907,
      "retweet_count": 699,
      "reply_count": 424,
      "sentiment": "negative",
      "sentiment_score": -0.8386229276657104,
      "original_lang": "en"
    },
    {
      "id": "1915336871712112899",
      "text": "A slap in the face for the U.S.?\n\nIs there any direct contact between the two on tariffs?\n\n🇺🇸U.S. President: \"Yeah, of course — every day.\"\n\n🇨🇳China: \"False info. China and the US have not consulted or negotiated on the issue of tariffs, let alone reached an agreement.\"",
      "cleaned_text": "a slap in the face for the u s is there any direct contact between the two on tariffs u s president yeah of course every day china false info china and the us have not consulted or negotiated on the issue of tariffs let alone reached an agreement ",
      "favorite_count": 3183,
      "retweet_count": 961,
      "reply_count": 187,
      "sentiment": "negative",
      "sentiment_score": -0.6580747365951538,
      "original_lang": "en"
    },
    {
      "id": "1914401239036768353",
      "text": "A high school student in China jumps out of building to express his true love https://t.co/m96l96VcbG",
      "cleaned_text": "a high school student in china jumps out of building to express his true love ",
      "favorite_count": 60617,
      "retweet_count": 3180,
      "reply_count": 1545,
      "sentiment": "negative",
      "sentiment_score": -0.0982280969619751,
      "original_lang": "en"
    },
    {
      "id": "1915434963031220644",
      "text": "Which is the true enemy of America?\n\nA. The Media\nB. China \nC. Democrats in DC\nD. Other (comment)",
      "cleaned_text": "which is the true enemy of america a the media b china c democrats in dc d other comment ",
      "favorite_count": 66,
      "retweet_count": 12,
      "reply_count": 143,
      "sentiment": "negative",
      "sentiment_score": -0.8087645173072815,
      "original_lang": "en"
    },
    {
      "id": "1915433095165100266",
      "text": "Only 3 lawmakers voted to classify Israel as an adversary of the U.S. - alongside North Korea, China, and Iran.\n\nWho were they?\n- Rashida Tlaib (D-MI)\n- Ilhan Omar (D-MN)\n- Ayanna Pressley (D-MA)\n\nShameful. The amendment failed 3-410 in one of the most overwhelming rejections in congressional history.",
      "cleaned_text": "only 3 lawmakers voted to classify israel as an adversary of the u s alongside north korea china and iran who were they rashida tlaib d mi ilhan omar d mn ayanna pressley d ma shameful the amendment failed 3 410 in one of the most overwhelming rejections in congressional history ",
      "favorite_count": 927,
      "retweet_count": 202,
      "reply_count": 83,
      "sentiment": "negative",
      "sentiment_score": -0.7400714755058289,
      "original_lang": "en"
    },
    {
      "id": "1915405511757029733",
      "text": "Am I the I only person not upset about trying to get off the China tit and working with India instead?",
      "cleaned_text": "am i the i only person not upset about trying to get off the china tit and working with india instead ",
      "favorite_count": 201,
      "retweet_count": 6,
      "reply_count": 77,
      "sentiment": "negative",
      "sentiment_score": -0.7999182343482971,
      "original_lang": "en"
    },
    {
      "id": "1915121048732762556",
      "text": "China says it wants to partner with Canada to push back against American ‘bullying’ https://t.co/lKJ2cTtdcG",
      "cleaned_text": "china says it wants to partner with canada to push back against american bullying ",
      "favorite_count": 4013,
      "retweet_count": 701,
      "reply_count": 2471,
      "sentiment": "neutral",
      "sentiment_score": 0.0467248260974884,
      "original_lang": "en"
    },
    {
      "id": "1914165274346999922",
      "text": "Well thanks to Trump China has given Brazil all of its Soybean trade and this will cost American Farmers dearly!   😡😡😡 https://t.co/xZbhC6soPO",
      "cleaned_text": "well thanks to trump china has given brazil all of its soybean trade and this will cost american farmers dearly ",
      "favorite_count": 7059,
      "retweet_count": 2191,
      "reply_count": 425,
      "sentiment": "negative",
      "sentiment_score": -0.5378183722496033,
      "original_lang": "en"
    },
    {
      "id": "1913958637724201180",
      "text": "🤡:”What will the world do without cheap manufactured goods from China?”\n\nThe “goods from China”: https://t.co/eA5cGCKQG4",
      "cleaned_text": " what will the world do without cheap manufactured goods from china the goods from china ",
      "favorite_count": 25984,
      "retweet_count": 3745,
      "reply_count": 508,
      "sentiment": "negative",
      "sentiment_score": -0.19677701592445374,
      "original_lang": "en"
    },
    {
      "id": "1915423245865517178",
      "text": "🇨🇳🇨🇦🇺🇸 The Chinese Communist Party Wants to \"Partner\" With Canada Against Trump Tariff \"Bullying\" \n\nMeanwhile, China:\n💊 Floods our streets with fentanyl\n🦹‍♂️ Has blackmail on our politicians\n🦠 Stole bioterrorism viruses from our lab\n📞 Decimated our telecoms sector https://t.co/2Wk3ss7X5D",
      "cleaned_text": " the chinese communist party wants to partner with canada against trump tariff bullying meanwhile china floods our streets with fentanyl has blackmail on our politicians stole bioterrorism viruses from our lab decimated our telecoms sector ",
      "favorite_count": 253,
      "retweet_count": 149,
      "reply_count": 13,
      "sentiment": "negative",
      "sentiment_score": -0.8596290946006775,
      "original_lang": "en"
    },
    {
      "id": "1913747006670930167",
      "text": "40,000 Chinese students had their U.S. visas revoked and were sent back to China. A major shift in academic and diplomatic relations what’s next for cross-border education? https://t.co/9unJba5lKp",
      "cleaned_text": "40 000 chinese students had their u s visas revoked and were sent back to china a major shift in academic and diplomatic relations what s next for cross border education ",
      "favorite_count": 17863,
      "retweet_count": 4222,
      "reply_count": 586,
      "sentiment": "negative",
      "sentiment_score": -0.1394650936126709,
      "original_lang": "en"
    },
    {
      "id": "1915030156869067056",
      "text": "Mark Zuckerberg EXPOSED as actively working with the communist government of China TO CENSOR US on their behalf\n\n“For a murderous regime in China — Mark Zuckerberg, is here with his team of engineers, actively working to make Facebook censor on their behalf” https://t.co/TrXpaCPyIU",
      "cleaned_text": "mark zuckerberg exposed as actively working with the communist government of china to censor us on their behalf for a murderous regime in china mark zuckerberg is here with his team of engineers actively working to make facebook censor on their behalf ",
      "favorite_count": 3529,
      "retweet_count": 1652,
      "reply_count": 176,
      "sentiment": "negative",
      "sentiment_score": -0.6976340413093567,
      "original_lang": "en"
    },
    {
      "id": "1914774434184839664",
      "text": "American goes to see a doctor in China:\n\n- No appointment needed, just walk in\n- You don’t need to see a primary care doctor before seeing the specialist\n- Appointments and test results are same day\n - Cost was $4\n\nSomething is very wrong in America.\n https://t.co/vttvDo4bOE",
      "cleaned_text": "american goes to see a doctor in china no appointment needed just walk in you don t need to see a primary care doctor before seeing the specialist appointments and test results are same day cost was 4 something is very wrong in america ",
      "favorite_count": 10046,
      "retweet_count": 3213,
      "reply_count": 615,
      "sentiment": "negative",
      "sentiment_score": -0.7394354939460754,
      "original_lang": "en"
    },
    {
      "id": "1915065331497804060",
      "text": "Donald Trump babbles about all of his trade deals, “a lot of money” he (wrongly) thinks they’re going to be bringing in, and insults China again.\n\nHE is the “laughingstock.”\n\nWhere are the public details of all of these so-called trade deals? https://t.co/Lpv4CZvCKf",
      "cleaned_text": "donald trump babbles about all of his trade deals a lot of money he wrongly thinks they re going to be bringing in and insults china again he is the laughingstock where are the public details of all of these so called trade deals ",
      "favorite_count": 3424,
      "retweet_count": 736,
      "reply_count": 160,
      "sentiment": "negative",
      "sentiment_score": -0.8806049227714539,
      "original_lang": "en"
    },
    {
      "id": "1915242171487092873",
      "text": "WHAT THE HELL HAPPENED after TRUMP was SHOT?!?!?!  Once they FINALLY get Trump off the stage and into the SUV, they DONT MOVE. And when they finally Do, it’s the SLOW BOAT TO CHINA!  Why in the World didn’t they just HIT THE GAS!!! https://t.co/wJpIwVSwI0",
      "cleaned_text": "what the hell happened after trump was shot once they finally get trump off the stage and into the suv they dont move and when they finally do it s the slow boat to china why in the world didn t they just hit the gas ",
      "favorite_count": 2281,
      "retweet_count": 776,
      "reply_count": 175,
      "sentiment": "negative",
      "sentiment_score": -0.8361027240753174,
      "original_lang": "en"
    },
    {
      "id": "1914334712169992290",
      "text": "The dumbest part of all of this is that most of the trade deals that Trump is currently tearing apart are the trade deals that he himself wrote and signed.\n\nJapan. Canada. Mexico. China. \n\nYou name it. https://t.co/j0wN0Vlq49",
      "cleaned_text": "the dumbest part of all of this is that most of the trade deals that trump is currently tearing apart are the trade deals that he himself wrote and signed japan canada mexico china you name it ",
      "favorite_count": 6590,
      "retweet_count": 1781,
      "reply_count": 186,
      "sentiment": "negative",
      "sentiment_score": -0.8693343997001648,
      "original_lang": "en"
    },
    {
      "id": "1915416254388621772",
      "text": "Trump said yesterday the U.S. is talking to China “EVERY DAY”\n\nChina just said this morning NO TRADE TALKS are happening at all 🤦‍♂️ https://t.co/f21IUNKPSb",
      "cleaned_text": "trump said yesterday the u s is talking to china every day china just said this morning no trade talks are happening at all ",
      "favorite_count": 174,
      "retweet_count": 21,
      "reply_count": 34,
      "sentiment": "negative",
      "sentiment_score": -0.3875364661216736,
      "original_lang": "en"
    },
    {
      "id": "1915201373408551197",
      "text": "NEW: California is now the FOURTH largest economy in the world.\n\nLast year, the Golden State's GDP topped $4.1T — surpassing Japan ($4.02T) and behind only Germany ($4.65T), China ($18.74T), and the entire U.S. ($29.18T). https://t.co/6k1rR9GttL",
      "cleaned_text": "new california is now the fourth largest economy in the world last year the golden state s gdp topped 4 1t surpassing japan 4 02t and behind only germany 4 65t china 18 74t and the entire u s 29 18t ",
      "favorite_count": 4772,
      "retweet_count": 854,
      "reply_count": 1038,
      "sentiment": "positive",
      "sentiment_score": 0.1473465859889984,
      "original_lang": "en"
    },
    {
      "id": "1915350185166754033",
      "text": "🚨I want from you to be Honest for this Question:\n\nCan you name one thing that China has invented?\n\nJust one single thing!! https://t.co/blV2p7DSbS",
      "cleaned_text": " i want from you to be honest for this question can you name one thing that china has invented just one single thing ",
      "favorite_count": 265,
      "retweet_count": 63,
      "reply_count": 606,
      "sentiment": "neutral",
      "sentiment_score": 0.02756352722644806,
      "original_lang": "en"
    },
    {
      "id": "1915325740028985486",
      "text": "JUST IN: 🇨🇳🇺🇸 China says there have been no economic or trade negotiations with the United States. https://t.co/QBcHO0VuA6",
      "cleaned_text": "just in china says there have been no economic or trade negotiations with the united states ",
      "favorite_count": 18387,
      "retweet_count": 3015,
      "reply_count": 1028,
      "sentiment": "negative",
      "sentiment_score": -0.38825684785842896,
      "original_lang": "en"
    },
    {
      "id": "1914010146583552338",
      "text": "Daily Reminder \n\nChina 🇨🇳 emits more CO2 than the rest of the developed world combined \n\nAgenda 2030 does not apply to China https://t.co/QO4EOD54Fl",
      "cleaned_text": "daily reminder china emits more co2 than the rest of the developed world combined agenda 2030 does not apply to china ",
      "favorite_count": 1834,
      "retweet_count": 872,
      "reply_count": 161,
      "sentiment": "negative",
      "sentiment_score": -0.2856736481189728,
      "original_lang": "en"
    },
    {
      "id": "1914812499578286455",
      "text": "LMAO Trump surrenders to China on his stupid tariff war….China called his bluff and won…..no wonder that Art of the Deal was a best seller 🤣 https://t.co/c9NxAHYwIr",
      "cleaned_text": "lmao trump surrenders to china on his stupid tariff war china called his bluff and won no wonder that art of the deal was a best seller ",
      "favorite_count": 6813,
      "retweet_count": 991,
      "reply_count": 344,
      "sentiment": "negative",
      "sentiment_score": -0.05129873752593994,
      "original_lang": "en"
    },
    {
      "id": "1915423616876892577",
      "text": "We could be on top and give China a run for their money if the democrats would stop f*cking us over and start putting Americans First. Bring manufacturing jobs back to America. https://t.co/HI9p8q91gv",
      "cleaned_text": "we could be on top and give china a run for their money if the democrats would stop f cking us over and start putting americans first bring manufacturing jobs back to america ",
      "favorite_count": 118,
      "retweet_count": 45,
      "reply_count": 19,
      "sentiment": "negative",
      "sentiment_score": -0.5289404988288879,
      "original_lang": "en"
    },
    {
      "id": "1914381950351032573",
      "text": "Can you name one thing that China has invented?\n\nJust one single thing!! https://t.co/4FGhJzS0Wy",
      "cleaned_text": "can you name one thing that china has invented just one single thing ",
      "favorite_count": 1179,
      "retweet_count": 178,
      "reply_count": 4632,
      "sentiment": "positive",
      "sentiment_score": 0.2478664070367813,
      "original_lang": "en"
    },
    {
      "id": "1915314598913433876",
      "text": "JUST IN: 🇨🇳🇺🇸 China says all unilateral tariffs must be removed by the U.S. for talks to move forward. https://t.co/17p9UnnTz6",
      "cleaned_text": "just in china says all unilateral tariffs must be removed by the u s for talks to move forward ",
      "favorite_count": 5094,
      "retweet_count": 860,
      "reply_count": 493,
      "sentiment": "negative",
      "sentiment_score": -0.23579682409763336,
      "original_lang": "en"
    },
    {
      "id": "1914506505438814315",
      "text": "Dan Andrews was one of the worst Covid tyrants the world has ever seen.\n\nIt was China level tyranny.\n\nShooting people with rubber bullets.\n\nLocking people in their appartments.\n\nArresting pregnant women for Facebook posts.\n\nForcing people to get \"The jab.\"\n\nThe lockdowns.\n\nThe amount of deaths and vaccine injuries that could be attributed to his time in office is beyond counting.\n\nAustralia needs justice.\n\nThe world needs justice.",
      "cleaned_text": "dan andrews was one of the worst covid tyrants the world has ever seen it was china level tyranny shooting people with rubber bullets locking people in their appartments arresting pregnant women for facebook posts forcing people to get the jab the lockdowns the amount of deaths and vaccine injuries that could be attributed to his time in office is beyond counting australia needs justice the world needs justice ",
      "favorite_count": 5024,
      "retweet_count": 1246,
      "reply_count": 331,
      "sentiment": "negative",
      "sentiment_score": -0.9335357546806335,
      "original_lang": "en"
    },
    {
      "id": "1914107067914469404",
      "text": "🚨BREAKING: Would you want China to forfeit its 349,442 acres of U.S. farmland and be banned from purchasing more?\n\nYES or NO? https://t.co/8EfQ9mmq9s",
      "cleaned_text": " breaking would you want china to forfeit its 349 442 acres of u s farmland and be banned from purchasing more yes or no ",
      "favorite_count": 7720,
      "retweet_count": 827,
      "reply_count": 5599,
      "sentiment": "negative",
      "sentiment_score": -0.8270683884620667,
      "original_lang": "en"
    },
    {
      "id": "1913721944014233889",
      "text": "The beautiful city of Chengdu in China https://t.co/uGKRoxA9Fo",
      "cleaned_text": "the beautiful city of chengdu in china ",
      "favorite_count": 2128,
      "retweet_count": 247,
      "reply_count": 101,
      "sentiment": "positive",
      "sentiment_score": 0.3423195481300354,
      "original_lang": "en"
    },
    {
      "id": "1914379429641441475",
      "text": "🚨Update: India declared it has sided with the US against China in the Trade War!! https://t.co/QIK2OOHFoy",
      "cleaned_text": " update india declared it has sided with the us against china in the trade war ",
      "favorite_count": 67737,
      "retweet_count": 8499,
      "reply_count": 2189,
      "sentiment": "negative",
      "sentiment_score": -0.33692434430122375,
      "original_lang": "en"
    },
    {
      "id": "1915400185426964959",
      "text": "Can you name one thing that China has invented? https://t.co/jUQS9cgRBZ",
      "cleaned_text": "can you name one thing that china has invented ",
      "favorite_count": 424,
      "retweet_count": 76,
      "reply_count": 601,
      "sentiment": "positive",
      "sentiment_score": 0.2925817370414734,
      "original_lang": "en"
    },
    {
      "id": "1914212740333441229",
      "text": "Alasan China bisa produksi barang begitu murah. https://t.co/62UUJfCMw9",
      "cleaned_text": "alasan china bisa produksi barang begitu murah ",
      "favorite_count": 4776,
      "retweet_count": 833,
      "reply_count": 250,
      "sentiment": "positive",
      "sentiment_score": 0.4565369188785553,
      "original_lang": NaN
    },
    {
      "id": "1914074224110784852",
      "text": "🚨President Trump shows all of the pollution China has left in the Pacific Ocean: https://t.co/rsH9wrE2M8",
      "cleaned_text": " president trump shows all of the pollution china has left in the pacific ocean ",
      "favorite_count": 54849,
      "retweet_count": 15257,
      "reply_count": 3824,
      "sentiment": "negative",
      "sentiment_score": -0.7213025093078613,
      "original_lang": "en"
    },
    {
      "id": "1915113245498851369",
      "text": "🚨 The largest collection of Elite Private Schools in America have been purchased by a private equity group\n\nDeceptively named, Primavera Private Equity, is owned by the Chinese Communist Party\n\nChina owns the schools US politicians send their kids to\nhttps://t.co/jziz3jOmF1",
      "cleaned_text": " the largest collection of elite private schools in america have been purchased by a private equity group deceptively named primavera private equity is owned by the chinese communist party china owns the schools us politicians send their kids to ",
      "favorite_count": 19959,
      "retweet_count": 11433,
      "reply_count": 888,
      "sentiment": "negative",
      "sentiment_score": -0.596521258354187,
      "original_lang": "en"
    },
    {
      "id": "1915371506982420737",
      "text": "Memecoins make rich.",
      "cleaned_text": "memecoins make rich ",
      "favorite_count": 217,
      "retweet_count": 40,
      "reply_count": 82,
      "sentiment": "positive",
      "sentiment_score": 0.22500503063201904,
      "original_lang": "en"
    },
    {
      "id": "1915383486510194900",
      "text": "JUST IN🚨\n\nChina denies having any trade negotiations with the US, contradicting President Trump's claims.🇺🇸🇨🇳 https://t.co/IBWC91SkkK",
      "cleaned_text": "just in china denies having any trade negotiations with the us contradicting president trump s claims ",
      "favorite_count": 154,
      "retweet_count": 15,
      "reply_count": 18,
      "sentiment": "negative",
      "sentiment_score": -0.8087574243545532,
      "original_lang": "en"
    },
    {
      "id": "1913730069480280235",
      "text": "BREAKING NEWS:\n\nMexico and China have united to form a powerful trade alliance. \n\nBrilliant move by the Madame president.\n\n https://t.co/d9a7mA3J62",
      "cleaned_text": "breaking news mexico and china have united to form a powerful trade alliance brilliant move by the madame president ",
      "favorite_count": 14746,
      "retweet_count": 3736,
      "reply_count": 1451,
      "sentiment": "positive",
      "sentiment_score": 0.7673236131668091,
      "original_lang": "en"
    },
    {
      "id": "1914066391314960792",
      "text": "HOLY SHT! Trump just called out China for polluting the Pacific Ocean.\n\nRemember - Democrats view China as exempt from any environmental responsibilities. https://t.co/lxwzM5wC1A",
      "cleaned_text": "holy sht trump just called out china for polluting the pacific ocean remember democrats view china as exempt from any environmental responsibilities ",
      "favorite_count": 33657,
      "retweet_count": 8715,
      "reply_count": 1067,
      "sentiment": "negative",
      "sentiment_score": -0.9181147217750549,
      "original_lang": "en"
    },
    {
      "id": "1914561477970718891",
      "text": "China has decided to show the world who the real superpower is! https://t.co/yorwrhZNxC",
      "cleaned_text": "china has decided to show the world who the real superpower is ",
      "favorite_count": 9923,
      "retweet_count": 2266,
      "reply_count": 335,
      "sentiment": "positive",
      "sentiment_score": 0.387481153011322,
      "original_lang": "en"
    },
    {
      "id": "1914208401938071750",
      "text": "La tienen difícil los greengos para igualar a China. https://t.co/QIt4NiFW4c",
      "cleaned_text": "la tienen difícil los greengos para igualar a china ",
      "favorite_count": 8256,
      "retweet_count": 1863,
      "reply_count": 209,
      "sentiment": "negative",
      "sentiment_score": -0.9172695279121399,
      "original_lang": NaN
    },
    {
      "id": "1914002814931513385",
      "text": "Even in ancient China, Christ was present.\n\nChrist is Lord ‼️☦️✝️ https://t.co/XL6hzpiETo",
      "cleaned_text": "even in ancient china christ was present christ is lord ",
      "favorite_count": 4727,
      "retweet_count": 595,
      "reply_count": 65,
      "sentiment": "neutral",
      "sentiment_score": -0.0077534019947052,
      "original_lang": "en"
    },
    {
      "id": "1913685278033952992",
      "text": "Kevin O’Leary goes nuclear on an MSNBC hack and perfectly explains why tariffs on China are mandatory. https://t.co/24LwRkqNVB",
      "cleaned_text": "kevin o leary goes nuclear on an msnbc hack and perfectly explains why tariffs on china are mandatory ",
      "favorite_count": 7957,
      "retweet_count": 2112,
      "reply_count": 75,
      "sentiment": "negative",
      "sentiment_score": -0.25196439027786255,
      "original_lang": "en"
    },
    {
      "id": "1914303407461978278",
      "text": "DOGE: Why are we paying for China to conduct live war games in Egypt? We send almost $2 billion a year to Egypt's military and they're using it to ensure tactical coordination with China? China will be spending a month learning how to defeat our air defense systems that we've sent to Egypt including Patriots and AN/TPS-78.",
      "cleaned_text": "doge why are we paying for china to conduct live war games in egypt we send almost 2 billion a year to egypt s military and they re using it to ensure tactical coordination with china china will be spending a month learning how to defeat our air defense systems that we ve sent to egypt including patriots and an tps 78 ",
      "favorite_count": 18143,
      "retweet_count": 8221,
      "reply_count": 964,
      "sentiment": "negative",
      "sentiment_score": -0.4165251851081848,
      "original_lang": "en"
    },
    {
      "id": "1914682031138648550",
      "text": "🇨🇳 China at the UN: \"While the U.S. defied world opinion by imposing tariffs on all trade partners, it also extended its so-called baseline tariff to Haiti, one of the world's  least developed countries... This is not only cruel and absurd, but also profoundly heartbreaking.\" https://t.co/HGJ7E8BNnF",
      "cleaned_text": " china at the un while the u s defied world opinion by imposing tariffs on all trade partners it also extended its so called baseline tariff to haiti one of the world s least developed countries this is not only cruel and absurd but also profoundly heartbreaking ",
      "favorite_count": 9438,
      "retweet_count": 2530,
      "reply_count": 184,
      "sentiment": "negative",
      "sentiment_score": -0.9199206829071045,
      "original_lang": "en"
    },
    {
      "id": "1914061423279534195",
      "text": "In China, smart transfer beds are used to transport patients painlessly and safely….\n\n https://t.co/VwFD7c8cRT",
      "cleaned_text": "in china smart transfer beds are used to transport patients painlessly and safely ",
      "favorite_count": 14640,
      "retweet_count": 1933,
      "reply_count": 254,
      "sentiment": "positive",
      "sentiment_score": 0.1879904866218567,
      "original_lang": "en"
    },
    {
      "id": "1915384035108442505",
      "text": "China has a much higher pain tolerance and can be a lot more patient than the U.S. can. \n\nAnd ultimately, that is why Trump will cave first. https://t.co/jDVtTWujKq",
      "cleaned_text": "china has a much higher pain tolerance and can be a lot more patient than the u s can and ultimately that is why trump will cave first ",
      "favorite_count": 795,
      "retweet_count": 111,
      "reply_count": 84,
      "sentiment": "negative",
      "sentiment_score": -0.8245092630386353,
      "original_lang": "en"
    },
    {
      "id": "1915360816775483478",
      "text": "So Trump lied when he said he's in talks with China?",
      "cleaned_text": "so trump lied when he said he s in talks with china ",
      "favorite_count": 2161,
      "retweet_count": 451,
      "reply_count": 141,
      "sentiment": "negative",
      "sentiment_score": -0.6450234651565552,
      "original_lang": "en"
    },
    {
      "id": "1915421465429618823",
      "text": "More Indians live in Ireland than China despite having a population 264 times smaller. China shares a 3488km land border with India while Ireland and India are 7290km apart.\n\nThere are also more Chinese living in Ireland than India. https://t.co/QRwpMuiTX7",
      "cleaned_text": "more indians live in ireland than china despite having a population 264 times smaller china shares a 3488km land border with india while ireland and india are 7290km apart there are also more chinese living in ireland than india ",
      "favorite_count": 938,
      "retweet_count": 219,
      "reply_count": 48,
      "sentiment": "negative",
      "sentiment_score": -0.15377925336360931,
      "original_lang": "en"
    },
    {
      "id": "1915420985030778929",
      "text": "China says the US should stop with the threats and coercion and instead come to the table on equal footing and they are not https://t.co/cHbP6UhUhm",
      "cleaned_text": "china says the us should stop with the threats and coercion and instead come to the table on equal footing and they are not ",
      "favorite_count": 94,
      "retweet_count": 39,
      "reply_count": 11,
      "sentiment": "negative",
      "sentiment_score": -0.7813718318939209,
      "original_lang": "en"
    },
    {
      "id": "1915435421565370684",
      "text": "Dear China:\n\nGo to hell.\n\nSincerely,\nQDMcD",
      "cleaned_text": "dear china go to hell sincerely qdmcd",
      "favorite_count": 327,
      "retweet_count": 56,
      "reply_count": 7,
      "sentiment": "negative",
      "sentiment_score": -0.9035330414772034,
      "original_lang": "en"
    },
    {
      "id": "1914070059917648315",
      "text": "HOLY SH*T 🚨 Donald Trump just called China out for polluting our beautiful country enoughs enough https://t.co/zOeQBRhWfW",
      "cleaned_text": "holy sh t donald trump just called china out for polluting our beautiful country enoughs enough ",
      "favorite_count": 1865,
      "retweet_count": 499,
      "reply_count": 115,
      "sentiment": "negative",
      "sentiment_score": -0.8318411111831665,
      "original_lang": "en"
    },
    {
      "id": "1915427446058332370",
      "text": "While we isolate ourselves and piss off allies, China is increasingly trying to repair its broken relationships with the west. \n\nWhat a historic opportunity we’ve afforded China for no reason at all.\n\nAnd China will capitalize on it. They don’t wait around. They move fast. https://t.co/16tWq56rtF",
      "cleaned_text": "while we isolate ourselves and piss off allies china is increasingly trying to repair its broken relationships with the west what a historic opportunity we ve afforded china for no reason at all and china will capitalize on it they don t wait around they move fast ",
      "favorite_count": 535,
      "retweet_count": 125,
      "reply_count": 61,
      "sentiment": "negative",
      "sentiment_score": -0.5845752358436584,
      "original_lang": "en"
    },
    {
      "id": "1915412927475069257",
      "text": "\"Good Day 2025\" by GDRAGON, Hwang Jung-min, Defconn, and a bunch of other artists debut at #1 on QQ music daily best selling singles chart with over 33K digital copies sold. 🇨🇳 https://t.co/vVMpDxdfEL",
      "cleaned_text": " good day 2025 by gdragon hwang jung min defconn and a bunch of other artists debut at on qq music daily best selling singles chart with over 33k digital copies sold ",
      "favorite_count": 521,
      "retweet_count": 178,
      "reply_count": 9,
      "sentiment": "positive",
      "sentiment_score": 0.47024354338645935,
      "original_lang": "en"
    },
    {
      "id": "1914870117261041794",
      "text": "China is winning by not doing anything and simply waiting. Trump master tariff war is exploding in his face. This is the art of the deal 👇 https://t.co/XhzbmxwFDR",
      "cleaned_text": "china is winning by not doing anything and simply waiting trump master tariff war is exploding in his face this is the art of the deal ",
      "favorite_count": 2917,
      "retweet_count": 610,
      "reply_count": 397,
      "sentiment": "neutral",
      "sentiment_score": 0.01687440276145935,
      "original_lang": "en"
    },
    {
      "id": "1915415111675629917",
      "text": "The White House says negotiations with China are/aren't happening, that they do/don't expect to cut/raise tariffs soon/in a bit/never, and they intend to play hardball/softball with China. Trump and Xi have/haven't spoken, and they do/don't expect a breakthrough sooner/later. https://t.co/XRH5hB8KQi",
      "cleaned_text": "the white house says negotiations with china are aren t happening that they do don t expect to cut raise tariffs soon in a bit never and they intend to play hardball softball with china trump and xi have haven t spoken and they do don t expect a breakthrough sooner later ",
      "favorite_count": 484,
      "retweet_count": 149,
      "reply_count": 32,
      "sentiment": "negative",
      "sentiment_score": -0.456596314907074,
      "original_lang": "en"
    },
    {
      "id": "1915423823089873010",
      "text": "China tu mother!\n\n@eleconomista \n#xijinping\n#TrumpTariffs https://t.co/hpeEMkpefk",
      "cleaned_text": "china tu mother ",
      "favorite_count": 277,
      "retweet_count": 99,
      "reply_count": 4,
      "sentiment": "negative",
      "sentiment_score": -0.11785636842250824,
      "original_lang": "en"
    },
    {
      "id": "1915362967912398968",
      "text": "Sometimes you have to let the toddler tire himself out with his tantrum.\n\nThat’s exactly what China did.",
      "cleaned_text": "sometimes you have to let the toddler tire himself out with his tantrum that s exactly what china did ",
      "favorite_count": 6069,
      "retweet_count": 734,
      "reply_count": 88,
      "sentiment": "negative",
      "sentiment_score": -0.8009985089302063,
      "original_lang": "en"
    },
    {
      "id": "1915020628865720412",
      "text": "China now knows Trump is weak since he caved to them before any talks even started. How can you threaten someone and then back down? He looks pathetic even more now. Xi didn’t even have to lift a finger.",
      "cleaned_text": "china now knows trump is weak since he caved to them before any talks even started how can you threaten someone and then back down he looks pathetic even more now xi didn t even have to lift a finger ",
      "favorite_count": 3959,
      "retweet_count": 711,
      "reply_count": 203,
      "sentiment": "negative",
      "sentiment_score": -0.9395933747291565,
      "original_lang": "en"
    },
    {
      "id": "1915396020483105238",
      "text": "Xi and China are calling out Trump for lying to the American people. There have been ZERO trade talks. Meanwhile, in China, Trump is being brutally trolled as being incompetent businessman. 😂🤣 👇 https://t.co/92Yv7iCP5T",
      "cleaned_text": "xi and china are calling out trump for lying to the american people there have been zero trade talks meanwhile in china trump is being brutally trolled as being incompetent businessman ",
      "favorite_count": 324,
      "retweet_count": 167,
      "reply_count": 5,
      "sentiment": "negative",
      "sentiment_score": -0.9121267795562744,
      "original_lang": "en"
    },
    {
      "id": "1915047102025183677",
      "text": "Gee, I wonder why trump has suddenly softened his stance on China tariffs and firing Powell? He's getting CLOBBERED in polls.\n\nArt of the Squeal. https://t.co/CAnJKgpCfB",
      "cleaned_text": "gee i wonder why trump has suddenly softened his stance on china tariffs and firing powell he s getting clobbered in polls art of the squeal ",
      "favorite_count": 6906,
      "retweet_count": 1842,
      "reply_count": 299,
      "sentiment": "negative",
      "sentiment_score": -0.8538565635681152,
      "original_lang": "en"
    },
    {
      "id": "1915164839141351751",
      "text": "REPORTER: Has there been any direct contact between the U.S. and China on trade at all?\n\n@POTUS: \"Yeah, of course — every day.\" https://t.co/5VEW0zyymf",
      "cleaned_text": "reporter has there been any direct contact between the u s and china on trade at all yeah of course every day ",
      "favorite_count": 2531,
      "retweet_count": 473,
      "reply_count": 524,
      "sentiment": "neutral",
      "sentiment_score": -0.040270574390888214,
      "original_lang": "en"
    },
    {
      "id": "1915403841685672025",
      "text": "To all those who say “China will intervene” really ?? https://t.co/tEjfvP8Rm8",
      "cleaned_text": "to all those who say china will intervene really ",
      "favorite_count": 4543,
      "retweet_count": 337,
      "reply_count": 83,
      "sentiment": "negative",
      "sentiment_score": -0.45395979285240173,
      "original_lang": "en"
    },
    {
      "id": "1913592769970651606",
      "text": "Pork in America is being fed drugs so toxic they’re even illegal in China\n\n“There's this drug Ractopamine that's banned or restricted in 160 countries, but guess where it's legal? The good old USA”\n\nOver 80% of pigs eat this drug in America\n\n“Big food companies found out that if they feed it to pigs, they grow bigger, fatter, faster. Now, they put it in the feed and over 80% of the pigs in America eat this drug. \n\nThe problem is there's been over a quarter of a million adverse effects reported in the pigs that eat this drug. \n\nIn over half the cases, the pigs were sickened or killed. And many of these pigs develop a side effect called downers where they become so fat that they're unable to stand up and walk. \n\nSo in China, feeding ractopamine to pigs is banned, in Russia it's banned, and in the European Union it's banned. But here in America, it's breakfast, lunch, and dinner.”\n\n‘Ractopamine is banned in China for use in pork production. China prohibits its use in livestock due to concerns about health risks and has strict regulations against ractopamine residues in imported pork. This has led to trade restrictions on U.S. pork, as some American producers use the additive.’",
      "cleaned_text": "pork in america is being fed drugs so toxic they re even illegal in china there s this drug ractopamine that s banned or restricted in 160 countries but guess where it s legal the good old usa over 80 of pigs eat this drug in america big food companies found out that if they feed it to pigs they grow bigger fatter faster now they put it in the feed and over 80 of the pigs in america eat this drug the problem is there s been over a quarter of a million adverse effects reported in the pigs that eat this drug in over half the cases the pigs were sickened or killed and many of these pigs develop a side effect called downers where they become so fat that they re unable to stand up and walk so in china feeding ractopamine to pigs is banned in russia it s banned and in the european union it s banned but here in america it s breakfast lunch and dinner ractopamine is banned in china for use in pork production china prohibits its use in livestock due to concerns about health risks and has strict regulations against ractopamine residues in imported pork this has led to trade restrictions on u s pork as some american producers use the additive ",
      "favorite_count": 14962,
      "retweet_count": 9421,
      "reply_count": 972,
      "sentiment": "negative",
      "sentiment_score": -0.5211614370346069,
      "original_lang": "en"
    },
    {
      "id": "1915351108081635330",
      "text": "🚨🇨🇳🇺🇸China says there are no ongoing trade talks with the U.S., calls for canceling 'unilateral' tariffs.\n\nWho will blink first? https://t.co/ChOVaikxT6",
      "cleaned_text": " china says there are no ongoing trade talks with the u s calls for canceling unilateral tariffs who will blink first ",
      "favorite_count": 1211,
      "retweet_count": 207,
      "reply_count": 202,
      "sentiment": "negative",
      "sentiment_score": -0.45856428146362305,
      "original_lang": "en"
    },
    {
      "id": "1915417993686782372",
      "text": "HE'S PLAYING HARDBALL: Donald Trump just called on Boeing to DEFAULT CHINA after China said they aren't taking in planes they agreed to purchase.\n\nFor context: China ordered planes from Boeing. Boeing made them. Now they're sending them back, NOT paying.\n\nDespicable. https://t.co/Hj38HK3FqO",
      "cleaned_text": "he s playing hardball donald trump just called on boeing to default china after china said they aren t taking in planes they agreed to purchase for context china ordered planes from boeing boeing made them now they re sending them back not paying despicable ",
      "favorite_count": 380,
      "retweet_count": 99,
      "reply_count": 43,
      "sentiment": "negative",
      "sentiment_score": -0.8098304867744446,
      "original_lang": "en"
    },
    {
      "id": "1915039447453991178",
      "text": "How long before we find out there’s no deal with China and this stock market rally was just another way for them to manipulate the markets?",
      "cleaned_text": "how long before we find out there s no deal with china and this stock market rally was just another way for them to manipulate the markets ",
      "favorite_count": 6754,
      "retweet_count": 1216,
      "reply_count": 444,
      "sentiment": "negative",
      "sentiment_score": -0.6965265870094299,
      "original_lang": "en"
    },
    {
      "id": "1915165063700242668",
      "text": "\"We're going to have great deals… If we don't have a deal... we're going to set the tariff... I think so… Over the next two or three weeks... could be for China, too. Could be for China. We're dealing with almost all of them—too many to fully deal with.\"\n\nWTF is he saying? https://t.co/hxXcAXU3wu",
      "cleaned_text": " we re going to have great deals if we don t have a deal we re going to set the tariff i think so over the next two or three weeks could be for china too could be for china we re dealing with almost all of them too many to fully deal with wtf is he saying ",
      "favorite_count": 4389,
      "retweet_count": 956,
      "reply_count": 1347,
      "sentiment": "negative",
      "sentiment_score": -0.07115054130554199,
      "original_lang": "en"
    },
    {
      "id": "1913800249262350723",
      "text": "SHOCKING:\n\nWent to the grocery store today. \n\nEmpty shelves everywhere.\n\nOh, and eggs $9 for a dozen.\n\nEconomic war on China 🇨🇳 is bringing US prosperity back! https://t.co/5xvAE6G5LK",
      "cleaned_text": "shocking went to the grocery store today empty shelves everywhere oh and eggs 9 for a dozen economic war on china is bringing us prosperity back ",
      "favorite_count": 6473,
      "retweet_count": 1412,
      "reply_count": 863,
      "sentiment": "negative",
      "sentiment_score": -0.7790190577507019,
      "original_lang": "en"
    },
    {
      "id": "1915320905779294524",
      "text": "Chinese actor #WangYibo hit the track today at the #Shanghai Circuit, gearing up for the #China GT 2025 this weekend! #王一博 https://t.co/ijsTvjxI7e",
      "cleaned_text": "chinese actor hit the track today at the circuit gearing up for the gt 2025 this weekend ",
      "favorite_count": 568,
      "retweet_count": 405,
      "reply_count": 7,
      "sentiment": "positive",
      "sentiment_score": 0.37840914726257324,
      "original_lang": "en"
    },
    {
      "id": "1915197699420278949",
      "text": "China’s ambassador says Beijing is proposing a partnership with Canada to stand up to American “bullying,” saying the two nations could work together to rally others against Washington’s efforts to undermine global rules. 🇨🇦🇨🇳 https://t.co/PLlBKA48kz",
      "cleaned_text": "china s ambassador says beijing is proposing a partnership with canada to stand up to american bullying saying the two nations could work together to rally others against washington s efforts to undermine global rules ",
      "favorite_count": 788,
      "retweet_count": 176,
      "reply_count": 559,
      "sentiment": "negative",
      "sentiment_score": -0.12035557627677917,
      "original_lang": "en"
    },
    {
      "id": "1914666010344612351",
      "text": "IMF Growth Projections: 2025 \n🇺🇸US: 1.8%\n🇩🇪 Germany: 0.0%\n🇫🇷France: 0.6%\n🇮🇹Italy: 0.4%\n🇪🇸Spain: 2.5%\n🇬🇧UK: 1.1%\n🇯🇵Japan: 0.6%\n🇨🇦Canada: 1.4%\n🇨🇳China: 4.0%\n🇮🇳India: 6.2% \n🇷🇺Russia: 1.5%\n🇲🇽Mexico: -0.3%\n🇸🇦KSA: 3.0%\n🇳🇬 Nigeria: 3.0%\n🇿🇦RSA: 1.0% https://t.co/LzX730aUw6",
      "cleaned_text": "imf growth projections 2025 us 1 8 germany 0 0 france 0 6 italy 0 4 spain 2 5 uk 1 1 japan 0 6 canada 1 4 china 4 0 india 6 2 russia 1 5 mexico 0 3 ksa 3 0 nigeria 3 0 rsa 1 0 ",
      "favorite_count": 2629,
      "retweet_count": 1352,
      "reply_count": 134,
      "sentiment": "negative",
      "sentiment_score": -0.1858808994293213,
      "original_lang": "en"
    },
    {
      "id": "1915034480466890913",
      "text": "Di China koruptor Rp 1,9 T dihukum mati. Selain dihukum mati, harta pribadi &amp; uang hasil korupsi disita negara...\n\nParah nih China apa keluarga koruptor harus merasakan penderitaan??? 😌 https://t.co/GIr70giz12",
      "cleaned_text": "di china koruptor rp 1 9 t dihukum mati selain dihukum mati harta pribadi amp uang hasil korupsi disita negara parah nih china apa keluarga koruptor harus merasakan penderitaan ",
      "favorite_count": 5150,
      "retweet_count": 1999,
      "reply_count": 320,
      "sentiment": "negative",
      "sentiment_score": -0.9171374440193176,
      "original_lang": NaN
    },
    {
      "id": "1913623625929838779",
      "text": "In China, for affordable prices, people can rent an entire mall, after closing hours, for softgel wars.\n\n#China https://t.co/sisMHK2j1X",
      "cleaned_text": "in china for affordable prices people can rent an entire mall after closing hours for softgel wars ",
      "favorite_count": 31800,
      "retweet_count": 3931,
      "reply_count": 532,
      "sentiment": "negative",
      "sentiment_score": -0.05768103897571564,
      "original_lang": "en"
    },
    {
      "id": "1915128917834551632",
      "text": "Jack Ma spills the truth: US corporate greed sold out the Midwest, shipped jobs to China, and blew trillions on wars and Wall Street crashes. Tariffs won’t fix this—you need a damn revolution!\n\nhttps://t.co/QePFk5Zr7L https://t.co/DD1klIBOSA",
      "cleaned_text": "jack ma spills the truth us corporate greed sold out the midwest shipped jobs to china and blew trillions on wars and wall street crashes tariffs won t fix this you need a damn revolution ",
      "favorite_count": 1862,
      "retweet_count": 521,
      "reply_count": 69,
      "sentiment": "negative",
      "sentiment_score": -0.8564437031745911,
      "original_lang": "en"
    },
    {
      "id": "1915381590353490382",
      "text": "Rashida Tlaib had proposed officially designating Israel as an adversary of the U.S., alongside China, North Korea and Iran\n\nIt failed 3-410\n\nhttps://t.co/fzAbGIalAg",
      "cleaned_text": "rashida tlaib had proposed officially designating israel as an adversary of the u s alongside china north korea and iran it failed 3 410 ",
      "favorite_count": 1261,
      "retweet_count": 243,
      "reply_count": 116,
      "sentiment": "negative",
      "sentiment_score": -0.7025545239448547,
      "original_lang": "en"
    },
    {
      "id": "1915063887025656308",
      "text": ".@POTUS: \"We're going to have a fair deal with China. It's going to be fair... we're going to have a country that you can be proud of, not a laughingstock all over the world...\" https://t.co/3mTt73UIms",
      "cleaned_text": " we re going to have a fair deal with china it s going to be fair we re going to have a country that you can be proud of not a laughingstock all over the world ",
      "favorite_count": 13808,
      "retweet_count": 2598,
      "reply_count": 1766,
      "sentiment": "positive",
      "sentiment_score": 0.5182579159736633,
      "original_lang": "en"
    },
    {
      "id": "1913617191079125187",
      "text": "We’re short on baseload power &amp; struggling to build new power plants. Yet strangely, we’re also shuttering coal plants &amp; shifting that same coal utilization to China, all in the name of staving off “global climate change.” It’s utter insanity. https://t.co/WTlIzLVaf4",
      "cleaned_text": "we re short on baseload power amp struggling to build new power plants yet strangely we re also shuttering coal plants amp shifting that same coal utilization to china all in the name of staving off global climate change it s utter insanity ",
      "favorite_count": 12266,
      "retweet_count": 1988,
      "reply_count": 349,
      "sentiment": "negative",
      "sentiment_score": -0.8922313451766968,
      "original_lang": "en"
    },
    {
      "id": "1915247117636886557",
      "text": "China is learning #italianrot 🈵 https://t.co/PJ5G5u2t3Q",
      "cleaned_text": "china is learning ",
      "favorite_count": 5111,
      "retweet_count": 660,
      "reply_count": 57,
      "sentiment": "positive",
      "sentiment_score": 0.25363337993621826,
      "original_lang": NaN
    },
    {
      "id": "1913664706667069610",
      "text": "Derrick Rose played a 1v1 game in China to 100!!!! \n\nStar Street Battle: Rose 101 - ZeWen 64\nhttps://t.co/7LWB10q4Kz",
      "cleaned_text": "derrick rose played a 1v1 game in china to 100 star street battle rose 101 zewen 64 ",
      "favorite_count": 23714,
      "retweet_count": 1558,
      "reply_count": 107,
      "sentiment": "positive",
      "sentiment_score": 0.053705815225839615,
      "original_lang": "en"
    },
    {
      "id": "1915344439620358311",
      "text": "𝗣𝗢𝗩: 𝗚𝗔𝗝𝗜 𝟯𝟬𝗝𝗧, 𝗚𝗔𝗬𝗔 𝗛𝗜𝗗𝗨𝗣 𝟯𝗝𝗧\n\nPasutri Frugal Living, hidup sederhana sesuai kemampuan.\n\nKak donnarosmery membagikan video saat dia restok isi kulkas 👍\n\nWah boleh nih dicoba ikut restok seperti ini 🤗\n\n📹: donnarosmery https://t.co/IXVrqgr7IY",
      "cleaned_text": "𝗣𝗢𝗩 𝗚𝗔𝗝𝗜 𝟯𝟬𝗝𝗧 𝗚𝗔𝗬𝗔 𝗛𝗜𝗗𝗨𝗣 𝟯𝗝𝗧 pasutri frugal living hidup sederhana sesuai kemampuan kak donnarosmery membagikan video saat dia restok isi kulkas wah boleh nih dicoba ikut restok seperti ini donnarosmery ",
      "favorite_count": 1005,
      "retweet_count": 143,
      "reply_count": 340,
      "sentiment": "positive",
      "sentiment_score": 0.40722447633743286,
      "original_lang": NaN
    },
    {
      "id": "1915108031815352347",
      "text": "Remember when the economy was booming, stocks were soaring, we weren’t in a trade war with China, we didn’t have a day drunk for a Sec Def, a couch fucking Cabbage Patch doll for a VP, or an evil, incurious idiot for a president and we still funded cancer research?\n\nYeah, that was like three months ago.",
      "cleaned_text": "remember when the economy was booming stocks were soaring we weren t in a trade war with china we didn t have a day drunk for a sec def a couch fucking cabbage patch doll for a vp or an evil incurious idiot for a president and we still funded cancer research yeah that was like three months ago ",
      "favorite_count": 10756,
      "retweet_count": 2566,
      "reply_count": 1069,
      "sentiment": "negative",
      "sentiment_score": -0.8568066358566284,
      "original_lang": "en"
    },
    {
      "id": "1915027883921473707",
      "text": "High school in China looks like prison https://t.co/20JFQCk19H",
      "cleaned_text": "high school in china looks like prison ",
      "favorite_count": 1113,
      "retweet_count": 173,
      "reply_count": 806,
      "sentiment": "negative",
      "sentiment_score": -0.7733720541000366,
      "original_lang": "en"
    },
    {
      "id": "1914880911176310958",
      "text": "BREAKING\n\nEmperor TrumpXia officially ascends the throne and lays claim to the mandate of heaven.\n\n\"I think they'll (China) want to be a part of the United States\" https://t.co/iUrWogaqSR",
      "cleaned_text": "breaking emperor trumpxia officially ascends the throne and lays claim to the mandate of heaven i think they ll china want to be a part of the united states ",
      "favorite_count": 2246,
      "retweet_count": 539,
      "reply_count": 969,
      "sentiment": "positive",
      "sentiment_score": 0.30684617161750793,
      "original_lang": "en"
    },
    {
      "id": "1913980980370583694",
      "text": "80 ships from China to the USA were sent empty. https://t.co/aT8oo7Tzd8",
      "cleaned_text": "80 ships from china to the usa were sent empty ",
      "favorite_count": 6871,
      "retweet_count": 2986,
      "reply_count": 809,
      "sentiment": "negative",
      "sentiment_score": -0.6907260417938232,
      "original_lang": "en"
    },
    {
      "id": "1913573949058777137",
      "text": "no bc why did she move that boy to china😭",
      "cleaned_text": "no bc why did she move that boy to china ",
      "favorite_count": 210496,
      "retweet_count": 9655,
      "reply_count": 346,
      "sentiment": "negative",
      "sentiment_score": -0.7404809594154358,
      "original_lang": "en"
    },
    {
      "id": "1913647002946003138",
      "text": "La UE pidiendo que no derrochemos energía y exigiendo a los comercios que a las 22:00 apaguen todas las luces de los escaparates que no sean imprescindibles.\n\nMientras tanto en  Guangzhou, China... https://t.co/qcY4zWc8b8",
      "cleaned_text": "la ue pidiendo que no derrochemos energía y exigiendo a los comercios que a las 22 00 apaguen todas las luces de los escaparates que no sean imprescindibles mientras tanto en guangzhou china ",
      "favorite_count": 13150,
      "retweet_count": 4074,
      "reply_count": 326,
      "sentiment": "negative",
      "sentiment_score": -0.5233920812606812,
      "original_lang": NaN
    },
    {
      "id": "1914707213496578168",
      "text": "China is in horrible shape.\n\nThey can’t afford a trade war. https://t.co/BjnMy7dOM4",
      "cleaned_text": "china is in horrible shape they can t afford a trade war ",
      "favorite_count": 6806,
      "retweet_count": 1208,
      "reply_count": 866,
      "sentiment": "negative",
      "sentiment_score": -0.9418972730636597,
      "original_lang": "en"
    },
    {
      "id": "1914402918033137875",
      "text": "Do you support a 300% tariff on China?\n\nYes or No? https://t.co/Nm4eOgQf6T",
      "cleaned_text": "do you support a 300 tariff on china yes or no ",
      "favorite_count": 10347,
      "retweet_count": 780,
      "reply_count": 5074,
      "sentiment": "negative",
      "sentiment_score": -0.2654632329940796,
      "original_lang": "en"
    },
    {
      "id": "1915197531086012925",
      "text": "\"Trump chickened out!\"\n\nThe people of China slamming President Trump for softening his tone amid his trade war as he awaits a deal with the country. Erin Burnett looks at Trump's change in tone in tonight's #A3. https://t.co/uNeoX8aG6j",
      "cleaned_text": " trump chickened out the people of china slamming president trump for softening his tone amid his trade war as he awaits a deal with the country erin burnett looks at trump s change in tone in tonight s ",
      "favorite_count": 1343,
      "retweet_count": 469,
      "reply_count": 108,
      "sentiment": "negative",
      "sentiment_score": -0.6885550022125244,
      "original_lang": "en"
    },
    {
      "id": "1914715951263834350",
      "text": "BREAKING: India Ditches China, Boosts U.S. Imports in Major Trade Win for Trump\n\nIn another victory for President Trump’s America First agenda, India has announced it will ramp up imports from the United States, sidelining communist China in a bold move to strengthen ties with the world’s greatest economy. \n\nThis shift, comes as India recognizes the unmatched quality and innovation of American goods, from energy to machinery, over China’s cheap knockoffs. \n\nTrump’s tariff strategy, slapping a 27% levy on Indian imports, clf early forced New Delhi’s hand, proving his deal making genius is reshaping global trade to put America back on top. \n\nIndian officials, eager to avoid economic fallout, are now prioritizing U.S. partnerships, a clear sign that Trump’s policies are draining the swamp of globalist trade imbalances. \n\nThis move not only boosts American workers and manufacturers but also weakens China’s stranglehold on world markets, fulfilling MAGA promises to bring jobs home.",
      "cleaned_text": "breaking india ditches china boosts u s imports in major trade win for trump in another victory for president trump s america first agenda india has announced it will ramp up imports from the united states sidelining communist china in a bold move to strengthen ties with the world s greatest economy this shift comes as india recognizes the unmatched quality and innovation of american goods from energy to machinery over china s cheap knockoffs trump s tariff strategy slapping a 27 levy on indian imports clf early forced new delhi s hand proving his deal making genius is reshaping global trade to put america back on top indian officials eager to avoid economic fallout are now prioritizing u s partnerships a clear sign that trump s policies are draining the swamp of globalist trade imbalances this move not only boosts american workers and manufacturers but also weakens china s stranglehold on world markets fulfilling maga promises to bring jobs home ",
      "favorite_count": 6779,
      "retweet_count": 1416,
      "reply_count": 514,
      "sentiment": "positive",
      "sentiment_score": 0.28794318437576294,
      "original_lang": "en"
    },
    {
      "id": "1914802394212221280",
      "text": "BREAKING:  Trump sees how terrible the economic outlook is so he's now seemingly backtracking by saying that the tariffs on China are going to \"come down substantially.\"\n\nWhy in the world did he put them so high in the first place if he plans to lower them. Did China simply call his bluff?\n\nCertainly seems like it.",
      "cleaned_text": "breaking trump sees how terrible the economic outlook is so he s now seemingly backtracking by saying that the tariffs on china are going to come down substantially why in the world did he put them so high in the first place if he plans to lower them did china simply call his bluff certainly seems like it ",
      "favorite_count": 11970,
      "retweet_count": 2436,
      "reply_count": 1443,
      "sentiment": "negative",
      "sentiment_score": -0.8812181353569031,
      "original_lang": "en"
    },
    {
      "id": "1915368008874443065",
      "text": "Senator Francis Tolentino alleged that the Chinese Embassy had contracted a Makati-based company to have its \"keyboard warriors\" create bogus social media accounts to spread disinformation, criticize the government, and convey China's policies. \n\nRead: https://t.co/6tDNKUVBfG https://t.co/fH2x00WW5y",
      "cleaned_text": "senator francis tolentino alleged that the chinese embassy had contracted a makati based company to have its keyboard warriors create bogus social media accounts to spread disinformation criticize the government and convey china s policies read ",
      "favorite_count": 208,
      "retweet_count": 44,
      "reply_count": 50,
      "sentiment": "negative",
      "sentiment_score": -0.773625910282135,
      "original_lang": "en"
    },
    {
      "id": "1915443216494546992",
      "text": "🚨 TRUMP: THERE WAS A MEETING THIS MORNING WITH CHINA\n\nWho is lying here?\n\nTrump or Xi?",
      "cleaned_text": " trump there was a meeting this morning with china who is lying here trump or xi ",
      "favorite_count": 529,
      "retweet_count": 44,
      "reply_count": 160,
      "sentiment": "negative",
      "sentiment_score": -0.6839570999145508,
      "original_lang": "en"
    },
    {
      "id": "1915396353389375638",
      "text": "China and the US are not having any consultation or negotiation on tariffs, still less reaching a deal.\n\nThis tariff war is launched by the US. China’s position is consistent and clear: We will fight, if fight we must. Our doors are open, if the US wants to talk. Dialogue and negotiation must be based on equality, respect and mutual benefit.",
      "cleaned_text": "china and the us are not having any consultation or negotiation on tariffs still less reaching a deal this tariff war is launched by the us china s position is consistent and clear we will fight if fight we must our doors are open if the us wants to talk dialogue and negotiation must be based on equality respect and mutual benefit ",
      "favorite_count": 738,
      "retweet_count": 198,
      "reply_count": 82,
      "sentiment": "positive",
      "sentiment_score": 0.05943708121776581,
      "original_lang": "en"
    },
    {
      "id": "1915128919499383177",
      "text": "China real as fuck. Through all this shit, not one time did they ever bring up that money that America owes them.",
      "cleaned_text": "china real as fuck through all this shit not one time did they ever bring up that money that america owes them ",
      "favorite_count": 24468,
      "retweet_count": 3293,
      "reply_count": 155,
      "sentiment": "negative",
      "sentiment_score": -0.6973649263381958,
      "original_lang": "en"
    },
    {
      "id": "1914893538472378493",
      "text": "India is one of the unluckiest countries when it comes to geographical neighbors, bordering Pakistan, Bangladesh, and China, none of whom genuinely wish to see it prosper and thrive.",
      "cleaned_text": "india is one of the unluckiest countries when it comes to geographical neighbors bordering pakistan bangladesh and china none of whom genuinely wish to see it prosper and thrive ",
      "favorite_count": 18996,
      "retweet_count": 1866,
      "reply_count": 761,
      "sentiment": "negative",
      "sentiment_score": -0.9312120676040649,
      "original_lang": "en"
    },
    {
      "id": "1915201870299340916",
      "text": "NEW: According to the IMF's 2024 World Economic Outlook data released yesterday and BEA data, California’s nominal GDP reached $4.1 trillion, surpassing Japan’s $4.02 trillion, and placing California as the 4th largest economy — behind only the United States, China, and Germany.\n\nNot only did it grow to be the 4th largest, California’s economy grew at a faster rate than the world’s top three economies in 2024: California's growth rate of 6% outpaced the U.S. (5.3%), China (2.6%) and Germany (2.9%).\n\nHowever, that success is now being threatened by the reckless tariff policies of the current federal administration.\n\nThat's why @CAGovernor Newsom filed a lawsuit that seeks to end President Trump’s tariff chaos, which has wreaked havoc on the economy, destabilized the stock and bond markets, caused hundreds of billions of dollars in losses, and inflicted higher costs for consumers and businesses. \n\nThese harms will only continue to grow, as President Trump’s tariffs are projected to shrink the U.S. economy by $100 billion annually.",
      "cleaned_text": "new according to the imf s 2024 world economic outlook data released yesterday and bea data california s nominal gdp reached 4 1 trillion surpassing japan s 4 02 trillion and placing california as the 4th largest economy behind only the united states china and germany not only did it grow to be the 4th largest california s economy grew at a faster rate than the world s top three economies in 2024 california s growth rate of 6 outpaced the u s 5 3 china 2 6 and germany 2 9 however that success is now being threatened by the reckless tariff policies of the current federal administration that s why newsom filed a lawsuit that seeks to end president trump s tariff chaos which has wreaked havoc on the economy destabilized the stock and bond markets caused hundreds of billions of dollars in losses and inflicted higher costs for consumers and businesses these harms will only continue to grow as president trump s tariffs are projected to shrink the u s economy by 100 billion annually ",
      "favorite_count": 494,
      "retweet_count": 156,
      "reply_count": 167,
      "sentiment": "neutral",
      "sentiment_score": -0.02817414700984955,
      "original_lang": "en"
    },
    {
      "id": "1915344981377606128",
      "text": "China se prepara para el golpe final a EEUU https://t.co/yDtsvqb72t",
      "cleaned_text": "china se prepara para el golpe final a eeuu ",
      "favorite_count": 1081,
      "retweet_count": 557,
      "reply_count": 31,
      "sentiment": "positive",
      "sentiment_score": 0.18841633200645447,
      "original_lang": NaN
    },
    {
      "id": "1915395496262123618",
      "text": "China says there have been no economic or trade talks with the United States. https://t.co/uFTJrYaray",
      "cleaned_text": "china says there have been no economic or trade talks with the united states ",
      "favorite_count": 3432,
      "retweet_count": 370,
      "reply_count": 121,
      "sentiment": "negative",
      "sentiment_score": -0.4346870183944702,
      "original_lang": "en"
    },
    {
      "id": "1915049096005525737",
      "text": "BREAKING: President Trump hints at cutting China tariffs ‘substantially’ in trade deal https://t.co/1sc4QAUaE7",
      "cleaned_text": "breaking president trump hints at cutting china tariffs substantially in trade deal ",
      "favorite_count": 1209,
      "retweet_count": 330,
      "reply_count": 757,
      "sentiment": "positive",
      "sentiment_score": 0.06551024317741394,
      "original_lang": "en"
    },
    {
      "id": "1915255881085722850",
      "text": "China 🇨🇳 is making Intelligence drones for military disguised as birds \n\nIndia 🇮🇳 is busy with Waqf, Aurangzeb, Holi, Jummah and Namaz ban. https://t.co/lzgYqeDuJ6",
      "cleaned_text": "china is making intelligence drones for military disguised as birds india is busy with waqf aurangzeb holi jummah and namaz ban ",
      "favorite_count": 6342,
      "retweet_count": 917,
      "reply_count": 449,
      "sentiment": "neutral",
      "sentiment_score": -0.049778103828430176,
      "original_lang": "en"
    },
    {
      "id": "1915372538177470622",
      "text": "$Pepe\n$BRETT\n$REDO\n$BOBO\n\nBest memes.",
      "cleaned_text": " pepe brett redo bobo best memes ",
      "favorite_count": 222,
      "retweet_count": 42,
      "reply_count": 53,
      "sentiment": "positive",
      "sentiment_score": 0.4058864712715149,
      "original_lang": NaN
    },
    {
      "id": "1915207625438056702",
      "text": "No country has ever built public infrastructure the way China has. Any lessons here? https://t.co/001jZqfzkR",
      "cleaned_text": "no country has ever built public infrastructure the way china has any lessons here ",
      "favorite_count": 2462,
      "retweet_count": 497,
      "reply_count": 380,
      "sentiment": "negative",
      "sentiment_score": -0.22061531245708466,
      "original_lang": "en"
    },
    {
      "id": "1914373839125143915",
      "text": "BREAKING:\n\nIndia says it will increase imports from the U.S rather than China. https://t.co/XwpPzETLZE",
      "cleaned_text": "breaking india says it will increase imports from the u s rather than china ",
      "favorite_count": 58349,
      "retweet_count": 5727,
      "reply_count": 2397,
      "sentiment": "neutral",
      "sentiment_score": 0.03646695613861084,
      "original_lang": "en"
    },
    {
      "id": "1915443515234165019",
      "text": "\"YOU HAVE YOUR REPORTING WRONG\" ON CHINA\nNo fake news here, @POTUS confirms China had meetings this morning and \"we've been meeting with China\", as he shuts down a reporter. https://t.co/iIvcBiYGRS",
      "cleaned_text": " you have your reporting wrong on china no fake news here confirms china had meetings this morning and we ve been meeting with china as he shuts down a reporter ",
      "favorite_count": 55,
      "retweet_count": 24,
      "reply_count": 5,
      "sentiment": "negative",
      "sentiment_score": -0.7307072281837463,
      "original_lang": "en"
    },
    {
      "id": "1915375593450860567",
      "text": "Free $CHINA airdrop 🎁 for first 2000\n\nRT pinned post\nDrop $SOL address now ⬇️",
      "cleaned_text": "free china airdrop for first 2000 rt pinned post drop sol address now ",
      "favorite_count": 263,
      "retweet_count": 213,
      "reply_count": 329,
      "sentiment": "neutral",
      "sentiment_score": 0.03311255946755409,
      "original_lang": "en"
    },
    {
      "id": "1915100105377567047",
      "text": "JUST IN: 🇨🇳🇺🇸 China says it's open to resuming trade talks with the United States. https://t.co/PGrA7VocUo",
      "cleaned_text": "just in china says it s open to resuming trade talks with the united states ",
      "favorite_count": 14112,
      "retweet_count": 1918,
      "reply_count": 872,
      "sentiment": "positive",
      "sentiment_score": 0.26300275325775146,
      "original_lang": "en"
    },
    {
      "id": "1913773689574719514",
      "text": "In a shocking video, while Iowa farmers beg the Trump administration to stop the trade war, Republican Senator Joni Ernst says 104% tariffs on China are “very appropriate.” Every voter in Iowa needs to send her packing. https://t.co/OqhppwoRdf",
      "cleaned_text": "in a shocking video while iowa farmers beg the trump administration to stop the trade war republican senator joni ernst says 104 tariffs on china are very appropriate every voter in iowa needs to send her packing ",
      "favorite_count": 10161,
      "retweet_count": 3098,
      "reply_count": 241,
      "sentiment": "negative",
      "sentiment_score": -0.6112775206565857,
      "original_lang": "en"
    },
    {
      "id": "1914840729341353995",
      "text": "BREAKING: Trump caved, again.\n\nDonald Trump said during a White House news conference that high tariffs on goods from China will “come down substantially,” adding: “I’m not going to say: ‘Oh, I’m going to play hardball with China,’… We’re going to be very nice.”\n\nWhat happened to the trillions of dollars we were supposed to get from the tariffs to pay down the national debt? To replace income tax in America? What happened to the claim that “China doesn’t have the cards”? \n\nThe “Art of the Deal”, my a$$",
      "cleaned_text": "breaking trump caved again donald trump said during a white house news conference that high tariffs on goods from china will come down substantially adding i m not going to say oh i m going to play hardball with china we re going to be very nice what happened to the trillions of dollars we were supposed to get from the tariffs to pay down the national debt to replace income tax in america what happened to the claim that china doesn t have the cards the art of the deal my a ",
      "favorite_count": 15169,
      "retweet_count": 3033,
      "reply_count": 1144,
      "sentiment": "negative",
      "sentiment_score": -0.4066762924194336,
      "original_lang": "en"
    },
    {
      "id": "1561747611303829505",
      "text": "“I want to challenge the stereotypes of China and I want to celebrate just how intricate my culture is.”\n\n@mochihanfu’s modern takes on traditional Chinese looks are beyond beautiful ❤️\n\nhttps://t.co/Xm5C2CDViz https://t.co/wUjj4APD93",
      "cleaned_text": " i want to challenge the stereotypes of china and i want to celebrate just how intricate my culture is s modern takes on traditional chinese looks are beyond beautiful ",
      "favorite_count": 746,
      "retweet_count": 88,
      "reply_count": 107,
      "sentiment": "positive",
      "sentiment_score": 0.5971410274505615,
      "original_lang": "en"
    },
    {
      "id": "1915448580397048137",
      "text": "China: We haven’t had talks with the USA on tariffs.\n\nTrump: I had a meeting with China this morning.\n\nWtf is going on?",
      "cleaned_text": "china we haven t had talks with the usa on tariffs trump i had a meeting with china this morning wtf is going on ",
      "favorite_count": 129,
      "retweet_count": 10,
      "reply_count": 45,
      "sentiment": "negative",
      "sentiment_score": -0.6734606027603149,
      "original_lang": "en"
    }
  ]
}