{
  "metadata": {
    "search_query": "Pahalgam attack",
    "timestamp": "2025-04-25_10-53-37",
    "total_tweets": 160,
    "language_stats": [
      {
        "language": "English",
        "code": "en",
        "count": 151,
        "percentage": 94.4
      },
      {
        "language": "Hindi",
        "code": "hi",
        "count": 5,
        "percentage": 3.1
      }
    ]
  },
  "tweets": [
    {
      "id": "1914940497711218693",
      "text": "Just read about the horrific and shocking terrorist attack in Pahalgam.\nTo target and kill innocent civilians in the name of religion is pure evil...\nNo cause, no belief, no ideology can ever justify such a monstrous act.Yeh kaisi ladai hai... https://t.co/nP5LKpT94E",
      "cleaned_text": "just read about the horrific and shocking terrorist attack in pahalgam to target and kill innocent civilians in the name of religion is pure evil no cause no belief no ideology can ever justify such a monstrous act yeh kaisi ladai hai ",
      "favorite_count": 66530,
      "retweet_count": 6103,
      "reply_count": 590,
      "sentiment": "negative",
      "sentiment_score": -0.8868038058280945,
      "original_lang": "en"
    },
    {
      "id": "1914932458816000398",
      "text": "With a heavy heart, paid last respects to the deceased of the Pahalgam terror attack. Bharat will not bend to terror. The culprits of this dastardly terror attack will not be spared. https://t.co/bFxb2nDT4H",
      "cleaned_text": "with a heavy heart paid last respects to the deceased of the pahalgam terror attack bharat will not bend to terror the culprits of this dastardly terror attack will not be spared ",
      "favorite_count": 40983,
      "retweet_count": 8998,
      "reply_count": 2680,
      "sentiment": "negative",
      "sentiment_score": -0.6134511828422546,
      "original_lang": "en"
    },
    {
      "id": "1915500793954013538",
      "text": "A viral post claims a girl from West Bengal is getting rape threats for speaking about terrorism &amp; Hindu killings in Pahalgam terror attack. \n\nShe's being harassed with calls &amp; messages. Allegedly involved 2 Muslim TMC workers. https://t.co/FYHnk6voii",
      "cleaned_text": "a viral post claims a girl from west bengal is getting rape threats for speaking about terrorism amp hindu killings in pahalgam terror attack she s being harassed with calls amp messages allegedly involved 2 muslim tmc workers ",
      "favorite_count": 7534,
      "retweet_count": 4605,
      "reply_count": 188,
      "sentiment": "negative",
      "sentiment_score": -0.8521467447280884,
      "original_lang": "en"
    },
    {
      "id": "1915355002018635798",
      "text": "This child lost his father in the #Pahalgam attack. \n\nIn just 35 seconds he asked more questions to the government than the entire media did in the last 48 hours. \n\nWhat a powerful video, what a kid, hope god gives him the strength to be strong. https://t.co/cmdLePXOPD",
      "cleaned_text": "this child lost his father in the attack in just 35 seconds he asked more questions to the government than the entire media did in the last 48 hours what a powerful video what a kid hope god gives him the strength to be strong ",
      "favorite_count": 28020,
      "retweet_count": 7082,
      "reply_count": 428,
      "sentiment": "positive",
      "sentiment_score": 0.09806680679321289,
      "original_lang": "en"
    },
    {
      "id": "1915432393655173306",
      "text": "This deshbhakt has been missing since the Pahalgam terrorist attack. Not a single post yet. https://t.co/cjVIUQBBWl",
      "cleaned_text": "this deshbhakt has been missing since the pahalgam terrorist attack not a single post yet ",
      "favorite_count": 10743,
      "retweet_count": 1154,
      "reply_count": 516,
      "sentiment": "negative",
      "sentiment_score": -0.6996849179267883,
      "original_lang": "en"
    },
    {
      "id": "1914957644860735706",
      "text": "I am deeply saddened to address the tragic terrorist attack in Pahalgam. This heinous act has resulted in significant loss of innocent lives and has left families shattered. Such violence not only targets individuals but also undermines the fabric of our society. In these testing times, we must stand united in our condemnation of terrorism and extend our heartfelt condolences to the victims' families. It is imperative that we remain steadfast in our commitment to peace and resilience. Our thoughts are with all those affected by this tragedy, and we pray for justice and healing in our community. #PahalgamTerroristAttack",
      "cleaned_text": "i am deeply saddened to address the tragic terrorist attack in pahalgam this heinous act has resulted in significant loss of innocent lives and has left families shattered such violence not only targets individuals but also undermines the fabric of our society in these testing times we must stand united in our condemnation of terrorism and extend our heartfelt condolences to the victims families it is imperative that we remain steadfast in our commitment to peace and resilience our thoughts are with all those affected by this tragedy and we pray for justice and healing in our community ",
      "favorite_count": 46985,
      "retweet_count": 4464,
      "reply_count": 231,
      "sentiment": "negative",
      "sentiment_score": -0.8595015406608582,
      "original_lang": "en"
    },
    {
      "id": "1914921419265421567",
      "text": "Amit Shah is walking on a \"Red Carpet\" to pay tributes to the Pahalgam attack victims.\n\nThis is the height of shamelessness!\nhttps://t.co/stgah7mThQ",
      "cleaned_text": "amit shah is walking on a red carpet to pay tributes to the pahalgam attack victims this is the height of shamelessness ",
      "favorite_count": 13962,
      "retweet_count": 3106,
      "reply_count": 476,
      "sentiment": "negative",
      "sentiment_score": -0.12683331966400146,
      "original_lang": "en"
    },
    {
      "id": "1915336072739107196",
      "text": "Two days after Pahalgam attack, Modi &amp; Nitish at an election rally for Bihar! https://t.co/ZcRUHhzJbM",
      "cleaned_text": "two days after pahalgam attack modi amp nitish at an election rally for bihar ",
      "favorite_count": 8160,
      "retweet_count": 2888,
      "reply_count": 448,
      "sentiment": "negative",
      "sentiment_score": -0.2642674446105957,
      "original_lang": "en"
    },
    {
      "id": "1915033339884425290",
      "text": "BREAKING NEWS 🚨 VIRAL VIDEO \n\nMost viral video in Jammu and Kashmir \n\nA Kashmiri Youth helped the Tourist injured in the #Pahalgam attack\n\nIf you see the tweet Like and Retweet\n \n#PahalgamTerroristAttack https://t.co/haOPbXIDod",
      "cleaned_text": "breaking news viral video most viral video in jammu and kashmir a kashmiri youth helped the tourist injured in the attack if you see the tweet like and retweet ",
      "favorite_count": 3824,
      "retweet_count": 1203,
      "reply_count": 58,
      "sentiment": "negative",
      "sentiment_score": -0.11375211179256439,
      "original_lang": "en"
    },
    {
      "id": "1915615835210867094",
      "text": "As a Hindu born in Pakistan, this is my response to the “Terroristan” 🇵🇰 after the Kashmir Attack 🇮🇳\n\n* USE HEADPHONE *\n\n#PahalgamTerroristAttack #Kashmir #India #Pakistan #Pahalgam https://t.co/lG1xKxEz7g",
      "cleaned_text": "as a hindu born in pakistan this is my response to the terroristan after the kashmir attack use headphone ",
      "favorite_count": 2093,
      "retweet_count": 473,
      "reply_count": 60,
      "sentiment": "negative",
      "sentiment_score": -0.2846493124961853,
      "original_lang": "en"
    },
    {
      "id": "1915347192153595965",
      "text": "Sadhguru's Message on Pahalgam Terror Attack\n#Pahalgam https://t.co/kq1sw6yW1i",
      "cleaned_text": "sadhguru s message on pahalgam terror attack ",
      "favorite_count": 10402,
      "retweet_count": 3384,
      "reply_count": 210,
      "sentiment": "negative",
      "sentiment_score": -0.22934304177761078,
      "original_lang": NaN
    },
    {
      "id": "1915610266059841619",
      "text": "Propagandists are now circulating a list of fake names, falsely attributing them to victims of Pahalgam attack to distort the fact that the terror attack was based on religious identity.\n\nHere are the real names of the civilians who were killed in terror attack in Pahalgam, J&amp;K. https://t.co/FVuFNHd2tD",
      "cleaned_text": "propagandists are now circulating a list of fake names falsely attributing them to victims of pahalgam attack to distort the fact that the terror attack was based on religious identity here are the real names of the civilians who were killed in terror attack in pahalgam j amp k ",
      "favorite_count": 1504,
      "retweet_count": 701,
      "reply_count": 18,
      "sentiment": "negative",
      "sentiment_score": -0.7827898859977722,
      "original_lang": "en"
    },
    {
      "id": "1915013731215364184",
      "text": "Saudi Arabia 🇸🇦 condemns the terrorist attack in Pahalgam 🇮🇳, Jammu and Kashmir that resulted in many deaths and injuries. https://t.co/5mBBY9r93K",
      "cleaned_text": "saudi arabia condemns the terrorist attack in pahalgam jammu and kashmir that resulted in many deaths and injuries ",
      "favorite_count": 6304,
      "retweet_count": 760,
      "reply_count": 71,
      "sentiment": "negative",
      "sentiment_score": -0.8755117654800415,
      "original_lang": "en"
    },
    {
      "id": "1915483026198274210",
      "text": "Bengali Hindu girl faces rape threats from two Muslim workers of TMC for posting about Pahalgam terror attack. https://t.co/uholnYKDac",
      "cleaned_text": "bengali hindu girl faces rape threats from two muslim workers of tmc for posting about pahalgam terror attack ",
      "favorite_count": 10587,
      "retweet_count": 5011,
      "reply_count": 388,
      "sentiment": "negative",
      "sentiment_score": -0.8183462619781494,
      "original_lang": "en"
    },
    {
      "id": "1915061522788651055",
      "text": "In the wake of the terrorist attack in Pahalgam, chaired a meeting of the CCS at 7, Lok Kalyan Marg. https://t.co/bZj5gggp5l",
      "cleaned_text": "in the wake of the terrorist attack in pahalgam chaired a meeting of the ccs at 7 lok kalyan marg ",
      "favorite_count": 171977,
      "retweet_count": 24217,
      "reply_count": 11878,
      "sentiment": "negative",
      "sentiment_score": -0.1607302576303482,
      "original_lang": "en"
    },
    {
      "id": "1915285758833025404",
      "text": "Israel offered unconditional support to India if any war happens between India and Pakistan post Pahalgam terrorist attack\n\nIsrael Foreign Minister Oren Marmorshtein said message to India -\n\"Israel will stand with you. This is what friends do. We stand with India\" https://t.co/Flwqv93dfD",
      "cleaned_text": "israel offered unconditional support to india if any war happens between india and pakistan post pahalgam terrorist attack israel foreign minister oren marmorshtein said message to india israel will stand with you this is what friends do we stand with india ",
      "favorite_count": 12287,
      "retweet_count": 2134,
      "reply_count": 88,
      "sentiment": "positive",
      "sentiment_score": 0.13209417462348938,
      "original_lang": "en"
    },
    {
      "id": "1915397959442633099",
      "text": "Today I condemned the terrorist attack on Hindu pilgrims in Pahalgam which tragically claimed the lives of 26 people. \n\nMy heartfelt condolences go out to victims' families.\n\nI called on the Govt to fully support India in apprehending these terrorists and bringing them to justice https://t.co/qAnr4JU2Tb",
      "cleaned_text": "today i condemned the terrorist attack on hindu pilgrims in pahalgam which tragically claimed the lives of 26 people my heartfelt condolences go out to victims families i called on the govt to fully support india in apprehending these terrorists and bringing them to justice ",
      "favorite_count": 18358,
      "retweet_count": 3437,
      "reply_count": 375,
      "sentiment": "negative",
      "sentiment_score": -0.2117367386817932,
      "original_lang": "en"
    },
    {
      "id": "1915355631957201073",
      "text": "Pahalgam attack - Part 2 https://t.co/3sWwbwQx4e",
      "cleaned_text": "pahalgam attack part 2 ",
      "favorite_count": 9551,
      "retweet_count": 2477,
      "reply_count": 605,
      "sentiment": "negative",
      "sentiment_score": -0.21498259902000427,
      "original_lang": NaN
    },
    {
      "id": "1914982653666955476",
      "text": "All air warriors of the #IndianAirForce mourn the loss of Cpl Tage Hailyang in the terror attack at Pahalgam and convey heartfelt condolences to his family in this moment of immense grief.\n\nThe IAF stands in solidarity with the families of all those who lost their lives and prays for the swift recovery of the injured.\n\n@DefenceMinIndia\n@SpokespersonMoD\n@HQ_IDS_India\n@adgpi\n@IndiannavyMedia",
      "cleaned_text": "all air warriors of the mourn the loss of cpl tage hailyang in the terror attack at pahalgam and convey heartfelt condolences to his family in this moment of immense grief the iaf stands in solidarity with the families of all those who lost their lives and prays for the swift recovery of the injured ",
      "favorite_count": 11288,
      "retweet_count": 2294,
      "reply_count": 392,
      "sentiment": "negative",
      "sentiment_score": -0.6161826252937317,
      "original_lang": "en"
    },
    {
      "id": "1915393589846175931",
      "text": "Wife of deceased Shailesh Kalthia completely Exposed Modi sarkar in #Pahalgam attack .\n\nDo not defame  Kashmir ,  the problem lies with our security . The army also said why do you keep coming here for a walk . \nhttps://t.co/Rjn0WWqwpQ",
      "cleaned_text": "wife of deceased shailesh kalthia completely exposed modi sarkar in attack do not defame kashmir the problem lies with our security the army also said why do you keep coming here for a walk ",
      "favorite_count": 4976,
      "retweet_count": 1780,
      "reply_count": 50,
      "sentiment": "negative",
      "sentiment_score": -0.8252513408660889,
      "original_lang": "en"
    },
    {
      "id": "1915392812608036909",
      "text": "The wife of bank manager Shailesh, who was killed in the Pahalgam terror attack, expressed anger at Union Minister C.R. Patil, who came to pay homage at the funeral, and criticized the government for not providing security to tourists.\n\nShe asked the Minister, “What kind of a government do we have? You are defaming Kashmir, but there is no problem with Kashmir, the problem is with our government’s security arrangements. There was not a single military man present at the tourist spot in Pahalgam, which had a large number of tourists, and there were no medical facilities either.”",
      "cleaned_text": "the wife of bank manager shailesh who was killed in the pahalgam terror attack expressed anger at union minister c r patil who came to pay homage at the funeral and criticized the government for not providing security to tourists she asked the minister what kind of a government do we have you are defaming kashmir but there is no problem with kashmir the problem is with our government s security arrangements there was not a single military man present at the tourist spot in pahalgam which had a large number of tourists and there were no medical facilities either ",
      "favorite_count": 3471,
      "retweet_count": 1087,
      "reply_count": 99,
      "sentiment": "negative",
      "sentiment_score": -0.8612704873085022,
      "original_lang": "en"
    },
    {
      "id": "1915560387241824319",
      "text": "Every sanghi should open their eyes \n\nMassive protest held by Kashmiri women students against Pahalgam attack 🔥\n\nGodi media won't telecast on national TV for obvious reasons. https://t.co/0asSlGs9DX",
      "cleaned_text": "every sanghi should open their eyes massive protest held by kashmiri women students against pahalgam attack godi media won t telecast on national tv for obvious reasons ",
      "favorite_count": 2989,
      "retweet_count": 1028,
      "reply_count": 145,
      "sentiment": "negative",
      "sentiment_score": -0.13672217726707458,
      "original_lang": "en"
    },
    {
      "id": "1915045403742949622",
      "text": "In memory of the victims of the Pahalgam terror attack. https://t.co/GsTGjmlH7N",
      "cleaned_text": "in memory of the victims of the pahalgam terror attack ",
      "favorite_count": 14120,
      "retweet_count": 575,
      "reply_count": 25,
      "sentiment": "negative",
      "sentiment_score": -0.4652871787548065,
      "original_lang": "en"
    },
    {
      "id": "1915009227967660259",
      "text": "Finally, a tourist has exposed the false Hindu-Muslim narrative over Pahalgam attack, saying Kashmiri Muslims are standing by them in this hour of grief. Let’s not divide people and give our enemies a chance. Unity is the need of the hour from Kashmir to Kanyakumari. India stands united against violence on innocents. #PahalgamTerroristAttack",
      "cleaned_text": "finally a tourist has exposed the false hindu muslim narrative over pahalgam attack saying kashmiri muslims are standing by them in this hour of grief let s not divide people and give our enemies a chance unity is the need of the hour from kashmir to kanyakumari india stands united against violence on innocents ",
      "favorite_count": 1555,
      "retweet_count": 450,
      "reply_count": 492,
      "sentiment": "negative",
      "sentiment_score": -0.3313427269458771,
      "original_lang": "en"
    },
    {
      "id": "1914691424487870509",
      "text": "Amit Shah claim vs Reality \n\nMore than 25 people have been killed in today’s terror attack in Pahalgam. \n\nOur soldiers, policemen, pilgrims and now tourists, no body is safe..\n\nFailed Amit Shah must resign …. https://t.co/mX1VSmRZnG",
      "cleaned_text": "amit shah claim vs reality more than 25 people have been killed in today s terror attack in pahalgam our soldiers policemen pilgrims and now tourists no body is safe failed amit shah must resign ",
      "favorite_count": 2478,
      "retweet_count": 876,
      "reply_count": 206,
      "sentiment": "negative",
      "sentiment_score": -0.9052271246910095,
      "original_lang": "en"
    },
    {
      "id": "1914691862905995351",
      "text": "Another brutal attack in Pahalgam. From Bangladesh to Bengal to Kashmir, the same mindset targets Hindus. But 'seculars' and judiciary insist the attackers are 'oppressed minorities.' Victims deserve justice. https://t.co/GtA5WpFjIr",
      "cleaned_text": "another brutal attack in pahalgam from bangladesh to bengal to kashmir the same mindset targets hindus but seculars and judiciary insist the attackers are oppressed minorities victims deserve justice ",
      "favorite_count": 18414,
      "retweet_count": 4054,
      "reply_count": 308,
      "sentiment": "negative",
      "sentiment_score": -0.8881478309631348,
      "original_lang": "en"
    },
    {
      "id": "1914787268608549171",
      "text": "TRUTH REMINDER : Your muslim friend didn't post a single story condemning Pahalgam Terror Attack. That same muslim friend posted uncountable stuff for Palestine, Rafah and Gaza.",
      "cleaned_text": "truth reminder your muslim friend didn t post a single story condemning pahalgam terror attack that same muslim friend posted uncountable stuff for palestine rafah and gaza ",
      "favorite_count": 34271,
      "retweet_count": 6664,
      "reply_count": 470,
      "sentiment": "negative",
      "sentiment_score": -0.6199233531951904,
      "original_lang": "en"
    },
    {
      "id": "1914978287396548794",
      "text": "UHM Shri @AmitShah today visited the site of the Pahalgam terror attack and took a detailed briefing about the incident from officers. https://t.co/ZNHK7tfstZ",
      "cleaned_text": "uhm shri today visited the site of the pahalgam terror attack and took a detailed briefing about the incident from officers ",
      "favorite_count": 11037,
      "retweet_count": 1434,
      "reply_count": 270,
      "sentiment": "neutral",
      "sentiment_score": 0.0005701929330825806,
      "original_lang": "en"
    },
    {
      "id": "1915376151368806535",
      "text": "BREAKING NEWS 🚨\n\nThis woman lost her husband in #Pahalgam attack \n\nShe destroyed BJP and exposed the govt more than 200 Godi media journalists \n\n\"There were no police or security personnel to save us during attack\" 💔\n\nShameless BJP govt needs to go now 🙏 https://t.co/fz3LgHfV5R",
      "cleaned_text": "breaking news this woman lost her husband in attack she destroyed bjp and exposed the govt more than 200 godi media journalists there were no police or security personnel to save us during attack shameless bjp govt needs to go now ",
      "favorite_count": 8306,
      "retweet_count": 3158,
      "reply_count": 166,
      "sentiment": "negative",
      "sentiment_score": -0.910258412361145,
      "original_lang": "en"
    },
    {
      "id": "1914708489676746879",
      "text": "While India is mourning the loss of 27 lives in #Pahalgam attack\n\nNever forget how Arnab Goswami was celebrating Pulwama attack after we lost 40 soldiers 💔\n\nNEVER FORGET, NEVER FORGIVE https://t.co/6mcBnMngKm",
      "cleaned_text": "while india is mourning the loss of 27 lives in attack never forget how arnab goswami was celebrating pulwama attack after we lost 40 soldiers never forget never forgive ",
      "favorite_count": 2760,
      "retweet_count": 1149,
      "reply_count": 87,
      "sentiment": "negative",
      "sentiment_score": -0.694128692150116,
      "original_lang": "en"
    },
    {
      "id": "1915424110043332712",
      "text": "महिला ने लिया था पहलगाम आतंकी का फोटो \n\n◆ आंतकी महिला से ले रहा था जानकारी \n\n#PahalgamTerroristAttack | #PahalgamAttack | Pahalgam Attack https://t.co/mmC8FJfpRq",
      "cleaned_text": "मह ल न ल य थ पहलग म आत क क फ ट आ तक मह ल स ल रह थ ज नक र pahalgam attack ",
      "favorite_count": 8101,
      "retweet_count": 2361,
      "reply_count": 80,
      "sentiment": "negative",
      "sentiment_score": -0.11768755316734314,
      "original_lang": "hi"
    },
    {
      "id": "1915262149611356662",
      "text": "Everyone standing in solidarity for pahalgam terror attack, except one fan 😯\n\nWhy always CSK Fans? Seriously, I want the answer 🧐 https://t.co/nOncJuDfsm",
      "cleaned_text": "everyone standing in solidarity for pahalgam terror attack except one fan why always csk fans seriously i want the answer ",
      "favorite_count": 7253,
      "retweet_count": 1895,
      "reply_count": 218,
      "sentiment": "negative",
      "sentiment_score": -0.5412439703941345,
      "original_lang": "en"
    },
    {
      "id": "1914686337195892873",
      "text": "We can keep blaming Pakistan for the #Pahalgam attack, but it is impossible to execute this without any local support. https://t.co/HuiRdwhDqJ",
      "cleaned_text": "we can keep blaming pakistan for the attack but it is impossible to execute this without any local support ",
      "favorite_count": 24040,
      "retweet_count": 6121,
      "reply_count": 464,
      "sentiment": "negative",
      "sentiment_score": -0.8723666071891785,
      "original_lang": "en"
    },
    {
      "id": "1914918724450103595",
      "text": "0% Sympathy for 28 Indians who were killed in Pahalgam terror attack\n\n0% Questions on security failure \n\n0% Questions on Intelligence failure\n\n0% Accountability asked\n\n0% Journalism \n\n100% PR\n\n100% Modi Aarti\n\nThe state of Indian Media 🤡 https://t.co/EWGs7bwtdS",
      "cleaned_text": "0 sympathy for 28 indians who were killed in pahalgam terror attack 0 questions on security failure 0 questions on intelligence failure 0 accountability asked 0 journalism 100 pr 100 modi aarti the state of indian media ",
      "favorite_count": 3180,
      "retweet_count": 1195,
      "reply_count": 89,
      "sentiment": "negative",
      "sentiment_score": -0.8405585885047913,
      "original_lang": "en"
    },
    {
      "id": "1915297418108871119",
      "text": "Tragedy struck the breathtaking Baisaran Valley in Pahalgam on April 22nd—26 lives lost in a brutal terrorist attack that shook the nation. The serene ‘Mini Switzerland’ of Kashmir turned into a nightmare. From nationwide protests to decisive government action, the ripple effects are intense. What happened, who’s responsible, and what’s next? Read the full story and stay informed: https://t.co/yPPzvy5GJj\n\n#PahalgamTerroristAttack",
      "cleaned_text": "tragedy struck the breathtaking baisaran valley in pahalgam on april 22nd 26 lives lost in a brutal terrorist attack that shook the nation the serene mini switzerland of kashmir turned into a nightmare from nationwide protests to decisive government action the ripple effects are intense what happened who s responsible and what s next read the full story and stay informed ",
      "favorite_count": 958,
      "retweet_count": 748,
      "reply_count": 18,
      "sentiment": "negative",
      "sentiment_score": -0.8219243288040161,
      "original_lang": "en"
    },
    {
      "id": "1914952501465637124",
      "text": "Standing in solidarity with the victims of the Pahalgam terror attack. Prayers for the families who lost their loved ones in this gruesome attack 💔 https://t.co/KXAJelZ1n3",
      "cleaned_text": "standing in solidarity with the victims of the pahalgam terror attack prayers for the families who lost their loved ones in this gruesome attack ",
      "favorite_count": 49146,
      "retweet_count": 4668,
      "reply_count": 800,
      "sentiment": "negative",
      "sentiment_score": -0.7441608309745789,
      "original_lang": "en"
    },
    {
      "id": "1914994595836137517",
      "text": "UHM Shri @AmitShah today visited the injured of the Pahalgam terror attack, admitted to the hospital and assured them of every possible assistance. https://t.co/D9m2L6jCWB",
      "cleaned_text": "uhm shri today visited the injured of the pahalgam terror attack admitted to the hospital and assured them of every possible assistance ",
      "favorite_count": 5110,
      "retweet_count": 765,
      "reply_count": 158,
      "sentiment": "neutral",
      "sentiment_score": -0.035171493887901306,
      "original_lang": "en"
    },
    {
      "id": "1915597206200988030",
      "text": "This girl on Instagram named Shreshta Jhaa (@/shesh_diaries) is openly accusing the Government of India of planning the Pahalgam Terrorist attack. She’s accusing the Government of India of killing its own innocent people. @MIB_India @AshwiniVaishnaw @DelhiPolice care to act? https://t.co/sapD0xsStQ",
      "cleaned_text": "this girl on instagram named shreshta jhaa shesh_diaries is openly accusing the government of india of planning the pahalgam terrorist attack she s accusing the government of india of killing its own innocent people care to act ",
      "favorite_count": 1094,
      "retweet_count": 560,
      "reply_count": 48,
      "sentiment": "negative",
      "sentiment_score": -0.6952084302902222,
      "original_lang": "en"
    },
    {
      "id": "1915030287043412434",
      "text": "If Pakistan truly has no role in the Pahalgam terror attack, why hasn’t Prime Minister @CMShehbaz condemned it yet? Why are your forces suddenly on high alert? Because deep down, you know the truth — you’re sheltering and nurturing terrorists. Shame on you.",
      "cleaned_text": "if pakistan truly has no role in the pahalgam terror attack why hasn t prime minister condemned it yet why are your forces suddenly on high alert because deep down you know the truth you re sheltering and nurturing terrorists shame on you ",
      "favorite_count": 61590,
      "retweet_count": 9615,
      "reply_count": 2667,
      "sentiment": "negative",
      "sentiment_score": -0.8727502226829529,
      "original_lang": "en"
    },
    {
      "id": "1915468076809937095",
      "text": "ABP news ran the news of Kiren Riju accepting that the Govt made mistakes and failed in the #Pahalgam attack. \n\nIt started getting traction and was immediately deleted, the video was taken off from all ABP social media handles, cropped from the Live Stream as well. \n\nJust Imagine the fear in the media.",
      "cleaned_text": "abp news ran the news of kiren riju accepting that the govt made mistakes and failed in the attack it started getting traction and was immediately deleted the video was taken off from all abp social media handles cropped from the live stream as well just imagine the fear in the media ",
      "favorite_count": 1041,
      "retweet_count": 363,
      "reply_count": 16,
      "sentiment": "negative",
      "sentiment_score": -0.8582600355148315,
      "original_lang": "en"
    },
    {
      "id": "1915359249494155421",
      "text": "BJP leader from Chittishgarh is thanking a Kashmiri Muslim family for saving his and his family’s lives while risking his life during the Pahalgam terror attack. \n\n#Pahalgam #PahalgamTerrorAttack https://t.co/X7aoJNGBoD",
      "cleaned_text": "bjp leader from chittishgarh is thanking a kashmiri muslim family for saving his and his family s lives while risking his life during the pahalgam terror attack ",
      "favorite_count": 881,
      "retweet_count": 137,
      "reply_count": 29,
      "sentiment": "negative",
      "sentiment_score": -0.16523438692092896,
      "original_lang": "en"
    },
    {
      "id": "1915413296380862941",
      "text": "A Kashmiri Muslim saved the life of BJP leader in Pahalgam attack 🔥🔥\n\nThis news deserves to go viral. Let propaganda get destroyed. https://t.co/MDoaU9Afg7",
      "cleaned_text": "a kashmiri muslim saved the life of bjp leader in pahalgam attack this news deserves to go viral let propaganda get destroyed ",
      "favorite_count": 1049,
      "retweet_count": 425,
      "reply_count": 27,
      "sentiment": "neutral",
      "sentiment_score": -0.035245805978775024,
      "original_lang": "en"
    },
    {
      "id": "1915632554100609231",
      "text": "The house of two terrorists involved in the Pahalgam attack has been blown up by the Indian Army.\n\nThis is just the beginning. https://t.co/sUkdJYZXAq",
      "cleaned_text": "the house of two terrorists involved in the pahalgam attack has been blown up by the indian army this is just the beginning ",
      "favorite_count": 567,
      "retweet_count": 110,
      "reply_count": 13,
      "sentiment": "negative",
      "sentiment_score": -0.4944901168346405,
      "original_lang": "en"
    },
    {
      "id": "1915013787142234241",
      "text": "#GKShorts | Viral video shows a local carrying injured tourist to safety on his back after #Pahalgam terror attack https://t.co/s5RhtnSGSU",
      "cleaned_text": " viral video shows a local carrying injured tourist to safety on his back after terror attack ",
      "favorite_count": 3968,
      "retweet_count": 906,
      "reply_count": 187,
      "sentiment": "negative",
      "sentiment_score": -0.6206880807876587,
      "original_lang": "en"
    },
    {
      "id": "1915007841913516261",
      "text": "\"Godi media Hai hai.\"\n\nABP news anchor, faced protests in Srinagar, after locals alleged that the reporter was trying to spread fake news about the recent Pahalgam attack in Kashmir. https://t.co/D5W6gpyBEm",
      "cleaned_text": " godi media hai hai abp news anchor faced protests in srinagar after locals alleged that the reporter was trying to spread fake news about the recent pahalgam attack in kashmir ",
      "favorite_count": 14232,
      "retweet_count": 4150,
      "reply_count": 380,
      "sentiment": "negative",
      "sentiment_score": -0.48125699162483215,
      "original_lang": "en"
    },
    {
      "id": "1915636581509058798",
      "text": "#BREAKING: India has destroyed the houses of Pahalgam terror attack local terrorists Asif Sheikh in Tral and Aadil Thakur of Bijbehara of Kashmir valley. The houses were blasted overnight in India’s Kashmir valley conveying a strong message against terror. https://t.co/EQCsPOpDCA",
      "cleaned_text": " india has destroyed the houses of pahalgam terror attack local terrorists asif sheikh in tral and aadil thakur of bijbehara of kashmir valley the houses were blasted overnight in india s kashmir valley conveying a strong message against terror ",
      "favorite_count": 136,
      "retweet_count": 27,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.8169553875923157,
      "original_lang": "en"
    },
    {
      "id": "1915056353103757789",
      "text": "\"समय आ गया है कि भारत को भी इसराइल और अमेरिका की तरह जवाब देने की जरूरत है\"\n\n◆ पहलगामा आतंकी हमले को लेकर बाबा रामदेव ने कहा \n\n@yogrishiramdev | #PahalgamTerroristAttack | Pahalgam Attack https://t.co/WcB46gYIXn",
      "cleaned_text": " समय आ गय ह क भ रत क भ इसर इल और अम र क क तरह जव ब द न क जर रत ह पहलग म आत क हमल क ल कर ब ब र मद व न कह pahalgam attack ",
      "favorite_count": 5509,
      "retweet_count": 1428,
      "reply_count": 223,
      "sentiment": "neutral",
      "sentiment_score": 0.03452277183532715,
      "original_lang": "hi"
    },
    {
      "id": "1915601935031304646",
      "text": "As per initial reports Asif Sheikh was  Involved in #Pahalgam attack. When army reached his House, suspicious IED type material was seen, BDS along RR, destroyed that IED in which Asif's house partially damaged. https://t.co/dhB37wLumw",
      "cleaned_text": "as per initial reports asif sheikh was involved in attack when army reached his house suspicious ied type material was seen bds along rr destroyed that ied in which asif s house partially damaged ",
      "favorite_count": 499,
      "retweet_count": 99,
      "reply_count": 9,
      "sentiment": "negative",
      "sentiment_score": -0.8447216153144836,
      "original_lang": "en"
    },
    {
      "id": "1915624127718940840",
      "text": "Indian Army Blows Up House of Asim Sheikh who was Involved in Pahalgam Terrorist Attack \n\nBoom Boom! Indian Army in Action\n\nhttps://t.co/2G0UdZrDjp",
      "cleaned_text": "indian army blows up house of asim sheikh who was involved in pahalgam terrorist attack boom boom indian army in action ",
      "favorite_count": 2234,
      "retweet_count": 434,
      "reply_count": 42,
      "sentiment": "neutral",
      "sentiment_score": -0.019202232360839844,
      "original_lang": "en"
    },
    {
      "id": "1915409142287605902",
      "text": "‘He said I’m Christian, they shot him, I couldn't save him’: Wife’s anguished cry after #Pahalgam valley attack \n\nRead here 🔗https://t.co/dKa1Rh8h4A \n\n#PahalgamTerrorAttack #PahalgamAttack #PahalgamTerroristAttack",
      "cleaned_text": " he said i m christian they shot him i couldn t save him wife s anguished cry after valley attack read here ",
      "favorite_count": 788,
      "retweet_count": 203,
      "reply_count": 8,
      "sentiment": "negative",
      "sentiment_score": -0.876627504825592,
      "original_lang": "en"
    },
    {
      "id": "1915343232264778074",
      "text": "Kashmiri muslims showing solidarity for Pahalgam terror attack victims with candles, smiles and smirks.. https://t.co/dAyuzYBuG5",
      "cleaned_text": "kashmiri muslims showing solidarity for pahalgam terror attack victims with candles smiles and smirks ",
      "favorite_count": 657,
      "retweet_count": 289,
      "reply_count": 40,
      "sentiment": "positive",
      "sentiment_score": 0.2226642370223999,
      "original_lang": "en"
    },
    {
      "id": "1915295665241944350",
      "text": "Pakistan carried out an all-out terror attack against our people in #Pahalgam , so many died. Yet some wannabe Aman Ki Aasha warriors are still inviting Pakistani 'experts' to give gyan, that too at our Bharat Mandapam.\n\n@JhpiegoIndia must answer: either cancel the event or get the hell out of our country and rot in Pakistan.",
      "cleaned_text": "pakistan carried out an all out terror attack against our people in so many died yet some wannabe aman ki aasha warriors are still inviting pakistani experts to give gyan that too at our bharat mandapam must answer either cancel the event or get the hell out of our country and rot in pakistan ",
      "favorite_count": 1116,
      "retweet_count": 443,
      "reply_count": 41,
      "sentiment": "negative",
      "sentiment_score": -0.8292262554168701,
      "original_lang": "en"
    },
    {
      "id": "1915409527014584336",
      "text": "Not forgotten. Never will. ❤️‍🩹 \n\nOur thoughts and prayers are with the innocent lives lost in the tragic terror attack in Pahalgam, Kashmir. 🥺\n\nWe stand in solidarity with their families and loved ones during this difficult time. As a mark of respect, we are wearing 𝐁𝐥𝐚𝐜𝐤 𝐀𝐫𝐦𝐛𝐚𝐧𝐝𝐬 in today’s match. 🙏",
      "cleaned_text": "not forgotten never will our thoughts and prayers are with the innocent lives lost in the tragic terror attack in pahalgam kashmir we stand in solidarity with their families and loved ones during this difficult time as a mark of respect we are wearing 𝐁𝐥𝐚𝐜𝐤 𝐀𝐫𝐦𝐛𝐚𝐧𝐝𝐬 in today s match ",
      "favorite_count": 6007,
      "retweet_count": 675,
      "reply_count": 25,
      "sentiment": "negative",
      "sentiment_score": -0.2886033356189728,
      "original_lang": "en"
    },
    {
      "id": "1915461334885437928",
      "text": "How can some people be so shameless? It’s ok if you're feeling safe and having fun in Pahalgam but calling such a major terrorist attack 'small thing happens,' with a big smile, is absolutely disgusting.\n\nThese commies should be named and shamed. https://t.co/CbRIWGeJNQ",
      "cleaned_text": "how can some people be so shameless it s ok if you re feeling safe and having fun in pahalgam but calling such a major terrorist attack small thing happens with a big smile is absolutely disgusting these commies should be named and shamed ",
      "favorite_count": 7157,
      "retweet_count": 2368,
      "reply_count": 611,
      "sentiment": "negative",
      "sentiment_score": -0.9203771948814392,
      "original_lang": "en"
    },
    {
      "id": "1915631377661235647",
      "text": "BIG BREAKING NEWS 🚨 A USA Air Force plane just landed in Jaipur, India.\n\nSome hours ago Israel military planes landed in India.\n\nHouses of two local terrorists involved in Pahalgam terror attack demolished by authorities.\n\nAction will be taken against social media handles in India that are running propaganda videos from Pakistan.",
      "cleaned_text": "big breaking news a usa air force plane just landed in jaipur india some hours ago israel military planes landed in india houses of two local terrorists involved in pahalgam terror attack demolished by authorities action will be taken against social media handles in india that are running propaganda videos from pakistan ",
      "favorite_count": 2571,
      "retweet_count": 512,
      "reply_count": 62,
      "sentiment": "negative",
      "sentiment_score": -0.4203932285308838,
      "original_lang": "en"
    },
    {
      "id": "1915310123322417599",
      "text": "Breaking ‼️\nResidents of Mumbai (Dombivali) out on streets protesting against Modi Govt.\n▪️Why is Z security provided to ministers and not to ordinary citizens.\n▪️If you had prior intelligence input why was no security in Pahalgam \n▪️Where was the PM when attack happened.\n▪️Each and every individual should be provided with protection.\n▪️Why should we live in fear.\nDombivali resident Mr. Mone along with 2 others were victims of the shooting attack. RIP 💔🙏\n#PahalgamTerroristAttack",
      "cleaned_text": "breaking residents of mumbai dombivali out on streets protesting against modi govt why is z security provided to ministers and not to ordinary citizens if you had prior intelligence input why was no security in pahalgam where was the pm when attack happened each and every individual should be provided with protection why should we live in fear dombivali resident mr mone along with 2 others were victims of the shooting attack rip ",
      "favorite_count": 8535,
      "retweet_count": 2815,
      "reply_count": 349,
      "sentiment": "negative",
      "sentiment_score": -0.829140841960907,
      "original_lang": "en"
    },
    {
      "id": "1914759398288662867",
      "text": "Traumatic experience of those tourists who saw Pahalgam terror attack in front of their eyes in Kashmir and managed to escape. Indian Army comes to the rescue. Heart goes out to all the victim families in India. We stand in solidarity with each one of you. https://t.co/d8WeM0vuvM",
      "cleaned_text": "traumatic experience of those tourists who saw pahalgam terror attack in front of their eyes in kashmir and managed to escape indian army comes to the rescue heart goes out to all the victim families in india we stand in solidarity with each one of you ",
      "favorite_count": 26508,
      "retweet_count": 7161,
      "reply_count": 781,
      "sentiment": "negative",
      "sentiment_score": -0.1460074782371521,
      "original_lang": "en"
    },
    {
      "id": "1914736904035295255",
      "text": "Donald Trump had clearly said \n\n“ Islam hates us “ \n\nAnd today he stands strong with India against the Terrorist attack planted by Pakistan in #Pahalgam Jammu &amp; Kashmir \n\nPakistan has dug it’s own grave 🔥 https://t.co/PUuPgz3Zo9",
      "cleaned_text": "donald trump had clearly said islam hates us and today he stands strong with india against the terrorist attack planted by pakistan in jammu amp kashmir pakistan has dug it s own grave ",
      "favorite_count": 20548,
      "retweet_count": 4205,
      "reply_count": 320,
      "sentiment": "negative",
      "sentiment_score": -0.5795592069625854,
      "original_lang": "en"
    },
    {
      "id": "1915270811977502741",
      "text": "The new India's business of hate.\n\nAfter the Pahalgam terror attack, Pen Multiplex has shared a scene from the film Shaurya in which Brigadier Rudra Pratap says that the entire Muslim community is full of poison, they are termites. The featured image and title says he was right. https://t.co/tJBXwCD0fn",
      "cleaned_text": "the new india s business of hate after the pahalgam terror attack pen multiplex has shared a scene from the film shaurya in which brigadier rudra pratap says that the entire muslim community is full of poison they are termites the featured image and title says he was right ",
      "favorite_count": 1444,
      "retweet_count": 355,
      "reply_count": 59,
      "sentiment": "negative",
      "sentiment_score": -0.7048213481903076,
      "original_lang": "en"
    },
    {
      "id": "1915318622064693676",
      "text": "He said the same thing after Gurdaspur, Udhampur, Pathankot,Pampore, Uri, Nagrota,Anantnag and Pulwama attacks. \n\nHe is repeating the same dialougue after #Pahalgam attack. \n\nThis dialogue baazi is enough to give orgasm to his bhakts. \n\nHe has failed. \n https://t.co/ol7J1i5vxk",
      "cleaned_text": "he said the same thing after gurdaspur udhampur pathankot pampore uri nagrota anantnag and pulwama attacks he is repeating the same dialougue after attack this dialogue baazi is enough to give orgasm to his bhakts he has failed ",
      "favorite_count": 3232,
      "retweet_count": 1068,
      "reply_count": 144,
      "sentiment": "negative",
      "sentiment_score": -0.6642312407493591,
      "original_lang": "en"
    },
    {
      "id": "1915628194121867343",
      "text": "Pak defence minister @KhawajaMAsif admits they carried out the Pahalgam attack. Some corps commanders seem upset with Asim Munir &amp; are leaking that he ordered the attack without consultation. Khawaja would not say this without some army acquiescence\nhttps://t.co/0QlPkj53uM",
      "cleaned_text": "pak defence minister admits they carried out the pahalgam attack some corps commanders seem upset with asim munir amp are leaking that he ordered the attack without consultation khawaja would not say this without some army acquiescence ",
      "favorite_count": 1589,
      "retweet_count": 469,
      "reply_count": 42,
      "sentiment": "negative",
      "sentiment_score": -0.6662981510162354,
      "original_lang": "en"
    },
    {
      "id": "1915622707355595237",
      "text": "After the Pahalgam terror attack, Kashmiri youth are spreading a message of peace and hospitality—offering free travel, food, and water to tourists.\n\nHumanity wins.❤️ https://t.co/brxAejb3Bo",
      "cleaned_text": "after the pahalgam terror attack kashmiri youth are spreading a message of peace and hospitality offering free travel food and water to tourists humanity wins ",
      "favorite_count": 93,
      "retweet_count": 24,
      "reply_count": 3,
      "sentiment": "positive",
      "sentiment_score": 0.4223991632461548,
      "original_lang": "en"
    },
    {
      "id": "1915253129089532088",
      "text": "- @gurgaonpolice @police_haryana \n\nAnanya, Founder of Dash Agency is involved in anti-national activity, calling India oppressor and occupied to downplay the Pahalgam terror attack \n\nRequesting @MukeshSharmaGG Ji to look into the matter and take appropriate action as per Law https://t.co/2VN9h36iSb",
      "cleaned_text": " ananya founder of dash agency is involved in anti national activity calling india oppressor and occupied to downplay the pahalgam terror attack requesting ji to look into the matter and take appropriate action as per law ",
      "favorite_count": 15758,
      "retweet_count": 6149,
      "reply_count": 709,
      "sentiment": "negative",
      "sentiment_score": -0.6907328963279724,
      "original_lang": "en"
    },
    {
      "id": "1915006698840051815",
      "text": "Lost in the chaos of Pahalgam attack yesterday was this little update— Pune Porsche teen’s mother Shivani Agarwal granted interim bail by the Supreme Court. It was HER blood that was swapped with the blood of her drunk son that night. Faith in judiciary has never been higher. https://t.co/dBtxVvAIkM",
      "cleaned_text": "lost in the chaos of pahalgam attack yesterday was this little update pune porsche teen s mother shivani agarwal granted interim bail by the supreme court it was her blood that was swapped with the blood of her drunk son that night faith in judiciary has never been higher ",
      "favorite_count": 21576,
      "retweet_count": 6160,
      "reply_count": 411,
      "sentiment": "negative",
      "sentiment_score": -0.3604200482368469,
      "original_lang": "en"
    },
    {
      "id": "1915238180137378267",
      "text": "Pahalgam Attack: पहलगाम हमले में शहीद हुए मधुसूदन राव... \n\nश्रद्धांजलि देते वक्त बेटे ने किया पिता को सैल्यूट.. पार्थिव शरीर को कई बार चूमा\n\n#PahalgamTerroristAttack #pahalgamattack #Pahalgam #पहलगाम_आतंकी_हमला #TamilNadu https://t.co/JfaFVC0vXN",
      "cleaned_text": "pahalgam attack पहलग म हमल म शह द ह ए मध स दन र व श रद ध जल द त वक त ब ट न क य प त क स ल य ट प र थ व शर र क कई ब र च म म_आत क _हमल ",
      "favorite_count": 5086,
      "retweet_count": 742,
      "reply_count": 25,
      "sentiment": "neutral",
      "sentiment_score": 0.01285398006439209,
      "original_lang": "hi"
    },
    {
      "id": "1915335735571583457",
      "text": "Osaf Khan, an Optometrist who made a derogatory remark about one of the female victims and falsely accused her of hiring the shooter and using the Pahalgam terror attack as a chance to get rid of her husband, has now been arrested in Jabalpur, MP.\n\nThanks to @MPPoliceDeptt and everyone who raised voice against him on social media. Special thanks to Abhay Srivastava who went to Hanumantal Police Station to register FIR and case against Osaf Khan.",
      "cleaned_text": "osaf khan an optometrist who made a derogatory remark about one of the female victims and falsely accused her of hiring the shooter and using the pahalgam terror attack as a chance to get rid of her husband has now been arrested in jabalpur mp thanks to and everyone who raised voice against him on social media special thanks to abhay srivastava who went to hanumantal police station to register fir and case against osaf khan ",
      "favorite_count": 7513,
      "retweet_count": 2391,
      "reply_count": 146,
      "sentiment": "negative",
      "sentiment_score": -0.28889408707618713,
      "original_lang": "en"
    },
    {
      "id": "1915123016901759350",
      "text": "MOYE MOYE 🚨😂\n\nAn eye witness of Pahalgam attack punctured Hindu-Muslim propaganda on Amish Devgan’s show \n\n“Locals Kashmiris protected us, endangered their own lives to save us. We are alive only because of them”\n\nThe disappointment on Gullu’s face is PURE GOLD 🤣🤣🤣 https://t.co/aMlUAZieRJ",
      "cleaned_text": "moye moye an eye witness of pahalgam attack punctured hindu muslim propaganda on amish devgan s show locals kashmiris protected us endangered their own lives to save us we are alive only because of them the disappointment on gullu s face is pure gold ",
      "favorite_count": 1178,
      "retweet_count": 491,
      "reply_count": 35,
      "sentiment": "negative",
      "sentiment_score": -0.605528712272644,
      "original_lang": "en"
    },
    {
      "id": "1915554121752735803",
      "text": "Am truly shocked by the marginal, virtually non coverage of the Pahalgam Terror attack in the American media , ignorance, insularity and self obsession-hence even tougher to take huffy puffy op-eds on India seriously. They just don’t get us.",
      "cleaned_text": "am truly shocked by the marginal virtually non coverage of the pahalgam terror attack in the american media ignorance insularity and self obsession hence even tougher to take huffy puffy op eds on india seriously they just don t get us ",
      "favorite_count": 1696,
      "retweet_count": 248,
      "reply_count": 238,
      "sentiment": "negative",
      "sentiment_score": -0.9352726936340332,
      "original_lang": "en"
    },
    {
      "id": "1915631200149885365",
      "text": "House of Aadil who was involved in the Pahalgam terrorist attack has been destroyed https://t.co/M0LVODPuw1",
      "cleaned_text": "house of aadil who was involved in the pahalgam terrorist attack has been destroyed ",
      "favorite_count": 1786,
      "retweet_count": 284,
      "reply_count": 46,
      "sentiment": "negative",
      "sentiment_score": -0.9062331914901733,
      "original_lang": "en"
    },
    {
      "id": "1915319557566120364",
      "text": "#WATCH | Surat, Gujarat | Shailesh Kalthia, a native of Varachha area of ​​Surat city, was killed in the Pahalgam terror attack on 22nd April.\n\nHis son, Naksh Kalthia, says, \"We were at the 'mini Switzerland' point in Pahalgam, J&K. We heard gunshots... We hid once we realised that terrorists had entered the area. But, they found us. We saw two terrorists. I heard one of them ordered all the men to separate into Muslims and Hindus, and then shot all the Hindu men. The terrorists asked the men to recite 'Kalma' three times... All those who could not recite it were shot. Once the terrorists left, the locals came and said that all those who had survived should go downhill immediately. The army arrived an hour or so after we climbed down from the point... The terrorists were not letting him (my father) speak at all...They did not say anything (to my mother)...One of the terrorists was fair and had a beard. He had a camera tied to his head...They spared the women and the children...\"",
      "cleaned_text": " surat gujarat shailesh kalthia a native of varachha area of surat city was killed in the pahalgam terror attack on 22nd april his son naksh kalthia says we were at the mini switzerland point in pahalgam j k we heard gunshots we hid once we realised that terrorists had entered the area but they found us we saw two terrorists i heard one of them ordered all the men to separate into muslims and hindus and then shot all the hindu men the terrorists asked the men to recite kalma three times all those who could not recite it were shot once the terrorists left the locals came and said that all those who had survived should go downhill immediately the army arrived an hour or so after we climbed down from the point the terrorists were not letting him my father speak at all they did not say anything to my mother one of the terrorists was fair and had a beard he had a camera tied to his head they spared the women and the children ",
      "favorite_count": 7125,
      "retweet_count": 1978,
      "reply_count": 224,
      "sentiment": "negative",
      "sentiment_score": -0.5554788112640381,
      "original_lang": "en"
    },
    {
      "id": "1914984859136868788",
      "text": "Grief beyond words. Can’t forget, can’t forgive. Indian Navy Lieutenant Vinay Narwal's wife bids an emotional farewell to her husband, who was killed in the Pahalgam terror attack\n\nThe couple got married on April 16. https://t.co/GJXjG368i7",
      "cleaned_text": "grief beyond words can t forget can t forgive indian navy lieutenant vinay narwal s wife bids an emotional farewell to her husband who was killed in the pahalgam terror attack the couple got married on april 16 ",
      "favorite_count": 4938,
      "retweet_count": 744,
      "reply_count": 179,
      "sentiment": "negative",
      "sentiment_score": -0.6986821889877319,
      "original_lang": "en"
    },
    {
      "id": "1915331224731889869",
      "text": "Eyewitness of Pahalgam attack !!\n\nA single army or police officer was not present in the area.\n\nWe did not experience any Hindu-Muslim conflict in Kashmir.\n\nThere is no such environment there. \n\nI feel it is only the Pakistanis who talk of the Hindu-Muslim divide to cause conflicts.\n\nThe government should ensure adequate security in such places or not allow people to enter such danger zones..\n\nThere was nothing there, no hospital, no security, no help.",
      "cleaned_text": "eyewitness of pahalgam attack a single army or police officer was not present in the area we did not experience any hindu muslim conflict in kashmir there is no such environment there i feel it is only the pakistanis who talk of the hindu muslim divide to cause conflicts the government should ensure adequate security in such places or not allow people to enter such danger zones there was nothing there no hospital no security no help ",
      "favorite_count": 2256,
      "retweet_count": 927,
      "reply_count": 71,
      "sentiment": "negative",
      "sentiment_score": -0.883969783782959,
      "original_lang": "en"
    },
    {
      "id": "1914934989990334547",
      "text": "The horrific Pahalgam attack has deeply shaken us. My heart goes out to the bereaved families. As a mark of respect & solidarity, JanaSena will observe 3 days of mourning across the Telugu States. Our party flag will fly at half-mast.\nIn this dark hour, we remain resolute; Our Bharat's unity cannot be broken by terror. I have full faith that our leadership will respond with strength and purpose to ensure justice prevails and such atrocities never occur again.\nTogether, we will overcome. Together, we will heal. #UnitedAgainstTerror\" \n@PMOIndia @HMOIndia",
      "cleaned_text": "the horrific pahalgam attack has deeply shaken us my heart goes out to the bereaved families as a mark of respect solidarity janasena will observe 3 days of mourning across the telugu states our party flag will fly at half mast in this dark hour we remain resolute our bharat s unity cannot be broken by terror i have full faith that our leadership will respond with strength and purpose to ensure justice prevails and such atrocities never occur again together we will overcome together we will heal ",
      "favorite_count": 28877,
      "retweet_count": 6772,
      "reply_count": 393,
      "sentiment": "positive",
      "sentiment_score": 0.0798039436340332,
      "original_lang": "en"
    },
    {
      "id": "1915485443401064909",
      "text": "BREAKING NEWS 🚨\n\nPeople are hitting streets against BJP after Pahalgam attack \n\nThis is Dombivali Mumbai, common man is grilling BJP on coal 🔥🔥\n\n\"They just know how to do Hindu Muslim and buy MLAs to topple govt. No accountability from govt\" ⚡\n\nPls spread this widely. https://t.co/q7eKfZHXrv",
      "cleaned_text": "breaking news people are hitting streets against bjp after pahalgam attack this is dombivali mumbai common man is grilling bjp on coal they just know how to do hindu muslim and buy mlas to topple govt no accountability from govt pls spread this widely ",
      "favorite_count": 2277,
      "retweet_count": 751,
      "reply_count": 33,
      "sentiment": "negative",
      "sentiment_score": -0.525639533996582,
      "original_lang": "en"
    },
    {
      "id": "1915572158815936818",
      "text": "According to this Malayalam Anchor\n\nThe reason behind the Pahalgam Terrorist attack is to influence Bihar Elections.\n\nChannel name: Media one.\n\nKERALA SAAR, 100% LITERACY SAAR 🤡 https://t.co/qtrZZ6A4HQ",
      "cleaned_text": "according to this malayalam anchor the reason behind the pahalgam terrorist attack is to influence bihar elections channel name media one kerala saar 100 literacy saar ",
      "favorite_count": 1668,
      "retweet_count": 611,
      "reply_count": 70,
      "sentiment": "negative",
      "sentiment_score": -0.20737460255622864,
      "original_lang": "en"
    },
    {
      "id": "1914712926537306124",
      "text": "THIS IS OUR INDIA 🇮🇳 \n\nLocal Kashmiris in #Pahalgam are taking out candle march &amp; praying for the victims of the attack on tourists\n\nThis UNITY will scare Pakistanis more than anything!\n\nMost powerful visuals of the day ❤️ https://t.co/mTaXmTCRoz",
      "cleaned_text": "this is our india local kashmiris in are taking out candle march amp praying for the victims of the attack on tourists this unity will scare pakistanis more than anything most powerful visuals of the day ",
      "favorite_count": 12811,
      "retweet_count": 2172,
      "reply_count": 1596,
      "sentiment": "negative",
      "sentiment_score": -0.38892847299575806,
      "original_lang": "en"
    },
    {
      "id": "1915453437011017962",
      "text": "These crazy Muslim hating Hindus in India won't tell you that among the victims of the Pahalgam, Kashmir attack was Adeel Hussein Shah. Who was killed trying to stop the militants. \n\nCalling for a war with Pakistan is not a Bollywood film. Idiots. https://t.co/r03OT7diZh",
      "cleaned_text": "these crazy muslim hating hindus in india won t tell you that among the victims of the pahalgam kashmir attack was adeel hussein shah who was killed trying to stop the militants calling for a war with pakistan is not a bollywood film idiots ",
      "favorite_count": 2753,
      "retweet_count": 502,
      "reply_count": 399,
      "sentiment": "negative",
      "sentiment_score": -0.8327879905700684,
      "original_lang": "en"
    },
    {
      "id": "1914953898030485538",
      "text": "Picture of the terrorists involved in the Pahalgam terror attack. The first two appear to be Bangladeshi or Rohingya. If true, this could indicate a new pattern. Many of them are settled in J&amp;K. https://t.co/kjGSkMeOtf",
      "cleaned_text": "picture of the terrorists involved in the pahalgam terror attack the first two appear to be bangladeshi or rohingya if true this could indicate a new pattern many of them are settled in j amp k ",
      "favorite_count": 13106,
      "retweet_count": 3163,
      "reply_count": 324,
      "sentiment": "negative",
      "sentiment_score": -0.35420864820480347,
      "original_lang": "en"
    },
    {
      "id": "1915433621525323928",
      "text": "BIGGEST BREAKING 🚨\n\nABP has deleted this video from Twitter 🤯\n\nThe Modi government has accepted security lapse in Pahalgam attack ⚡\n\n\"There are few mistakes from our side\"  said Minister Kiren Rijiju \n\nMODI GOVERNMENT IS EXPOSED. https://t.co/4aPFnBY4Vm",
      "cleaned_text": "biggest breaking abp has deleted this video from twitter the modi government has accepted security lapse in pahalgam attack there are few mistakes from our side said minister kiren rijiju modi government is exposed ",
      "favorite_count": 3942,
      "retweet_count": 1498,
      "reply_count": 50,
      "sentiment": "negative",
      "sentiment_score": -0.6203263401985168,
      "original_lang": "en"
    },
    {
      "id": "1915463704008679598",
      "text": "BREAKING NEWS 🚨 Former Pakistani soldier reveals, 'Pahalgam attack was carried out on the orders of Pak army chief'.\n\nPahalgam attack was a part of a well-planned conspiracy⚡️ https://t.co/vWE9WAgful",
      "cleaned_text": "breaking news former pakistani soldier reveals pahalgam attack was carried out on the orders of pak army chief pahalgam attack was a part of a well planned conspiracy ",
      "favorite_count": 3915,
      "retweet_count": 842,
      "reply_count": 18,
      "sentiment": "negative",
      "sentiment_score": -0.5419291853904724,
      "original_lang": "en"
    },
    {
      "id": "1915588069522104490",
      "text": "When 200 people died in Kerala floods :\n\nRahul Gandhi next day reached mortuary room to meet families of victims, he hugged them \n\nWhen 27 people died in Pahalgam attack :\n\nNarendra Modi was smiling with Nitish Kumar in Madhubani Bihar rally 💔\n\nRaGa is more patriotic than any BJP leader.",
      "cleaned_text": "when 200 people died in kerala floods rahul gandhi next day reached mortuary room to meet families of victims he hugged them when 27 people died in pahalgam attack narendra modi was smiling with nitish kumar in madhubani bihar rally raga is more patriotic than any bjp leader ",
      "favorite_count": 1501,
      "retweet_count": 364,
      "reply_count": 62,
      "sentiment": "neutral",
      "sentiment_score": -0.02887505292892456,
      "original_lang": "en"
    },
    {
      "id": "1915238541887422619",
      "text": "These feminist girls didn’t post a single word for the Hindus who lost their lives in the Pahalgam terrorist attack.\n\nBut now, they’re busy spreading their usual propaganda to defend them. https://t.co/gzC8aLw2Mp",
      "cleaned_text": "these feminist girls didn t post a single word for the hindus who lost their lives in the pahalgam terrorist attack but now they re busy spreading their usual propaganda to defend them ",
      "favorite_count": 6710,
      "retweet_count": 1741,
      "reply_count": 566,
      "sentiment": "negative",
      "sentiment_score": -0.8746941685676575,
      "original_lang": "en"
    },
    {
      "id": "1915497613543047472",
      "text": "As co-chairs of the US India Caucus, @RepMcCormick and I strongly condemn the horrific terrorist attack in Pahalgam, India. We call for close intelligence cooperation between US-India and support for counterterrorism operations to dismantle Lashkar-e-Taiba and Hizbul Mujahideen. https://t.co/7Tx2AwCrIr",
      "cleaned_text": "as co chairs of the us india caucus and i strongly condemn the horrific terrorist attack in pahalgam india we call for close intelligence cooperation between us india and support for counterterrorism operations to dismantle lashkar e taiba and hizbul mujahideen ",
      "favorite_count": 529,
      "retweet_count": 123,
      "reply_count": 45,
      "sentiment": "negative",
      "sentiment_score": -0.19780223071575165,
      "original_lang": "en"
    },
    {
      "id": "1915602548729467220",
      "text": "After the brutal Pahalgam terror attack, emotions are running high. \n\nAn eatery in Indore has put up a bold poster: “Pigs and Pakistanis not allowed,” with a morphed image of the Mastermind of massacare, Pak's army chief Munir. \n\nLocals are flocking to show support https://t.co/EOsrsuBmZ2",
      "cleaned_text": "after the brutal pahalgam terror attack emotions are running high an eatery in indore has put up a bold poster pigs and pakistanis not allowed with a morphed image of the mastermind of massacare pak s army chief munir locals are flocking to show support ",
      "favorite_count": 5208,
      "retweet_count": 872,
      "reply_count": 38,
      "sentiment": "negative",
      "sentiment_score": -0.6895412802696228,
      "original_lang": "en"
    },
    {
      "id": "1915532771948155043",
      "text": "United Nations asks India and Pakistan to have maximum restraint after the Pahalgam terror attack. \n\nAre you serious, UN?\n\nEnough of this sermon. Enough of being a mute spectator. Enough of wearing blinkers towards terrorism. UN has failed to put efforts to end Pakistani terror. https://t.co/QgWXwAw6dn",
      "cleaned_text": "united nations asks india and pakistan to have maximum restraint after the pahalgam terror attack are you serious un enough of this sermon enough of being a mute spectator enough of wearing blinkers towards terrorism un has failed to put efforts to end pakistani terror ",
      "favorite_count": 5718,
      "retweet_count": 1146,
      "reply_count": 577,
      "sentiment": "negative",
      "sentiment_score": -0.7194840908050537,
      "original_lang": "en"
    },
    {
      "id": "1915356121453232428",
      "text": "HEARTBREAKING 🚨💔\n\nThis child lost his father in Pahalgam attack &amp; is asking some tough questions from Modi Govt\n\nThe pain in his voice will surely break your hearts 💔💔\n\nWhy is Godi Media not raising his voice, his pain? https://t.co/ublX7v8Hsp",
      "cleaned_text": "heartbreaking this child lost his father in pahalgam attack amp is asking some tough questions from modi govt the pain in his voice will surely break your hearts why is godi media not raising his voice his pain ",
      "favorite_count": 4222,
      "retweet_count": 1414,
      "reply_count": 95,
      "sentiment": "negative",
      "sentiment_score": -0.915036141872406,
      "original_lang": "en"
    },
    {
      "id": "1915440157626376259",
      "text": "The events of April 22, 2025, mark a pivotal moment. A heinous and cowardly terrorist attack in Pahalgam will trigger an escalation between the two nations, during which a significant portion of Pakistan-occupied Kashmir (POK) will be reclaimed by the Indian Army. #RudraKaranPartaap",
      "cleaned_text": "the events of april 22 2025 mark a pivotal moment a heinous and cowardly terrorist attack in pahalgam will trigger an escalation between the two nations during which a significant portion of pakistan occupied kashmir pok will be reclaimed by the indian army ",
      "favorite_count": 1642,
      "retweet_count": 252,
      "reply_count": 40,
      "sentiment": "negative",
      "sentiment_score": -0.46958887577056885,
      "original_lang": "en"
    },
    {
      "id": "1915103755005313525",
      "text": "Can you believe it? Vinay Narwal who was martyred in Pahalgam was alive for 1.5 hours but no one came to his help, claims his sister.\n\n1.5 hours !!!! \n\nNo wonder media didn’t show this. Total failure of the govt before and even after the attack. \n https://t.co/rG1pwv7iUF",
      "cleaned_text": "can you believe it vinay narwal who was martyred in pahalgam was alive for 1 5 hours but no one came to his help claims his sister 1 5 hours no wonder media didn t show this total failure of the govt before and even after the attack ",
      "favorite_count": 2151,
      "retweet_count": 662,
      "reply_count": 61,
      "sentiment": "negative",
      "sentiment_score": -0.8386853337287903,
      "original_lang": "en"
    },
    {
      "id": "1915460652942188688",
      "text": "Pahalgam Attack में सरकार ने मानी सुरक्षा चूक\n\n#JammuKashmir #PahalgamTerroristAttack #ATDigital https://t.co/gRgw1cG8eo",
      "cleaned_text": "pahalgam attack म सरक र न म न स रक ष च क ",
      "favorite_count": 1483,
      "retweet_count": 182,
      "reply_count": 58,
      "sentiment": "negative",
      "sentiment_score": -0.2827634811401367,
      "original_lang": NaN
    },
    {
      "id": "1915439660329021917",
      "text": "जम्मू-कश्मीर : पहलगाम हमले को लेकर लाल चौक में लोगों ने अपनी दुकानों पर लगाए काले झंडे\n\n#PahalgamTerrorAttack | #PahalgamTerrorAttack | Pahalgam Terror Attack https://t.co/Vsk8uGqGWt",
      "cleaned_text": "जम म कश म र पहलग म हमल क ल कर ल ल च क म ल ग न अपन द क न पर लग ए क ल झ ड pahalgam terror attack ",
      "favorite_count": 961,
      "retweet_count": 184,
      "reply_count": 11,
      "sentiment": "negative",
      "sentiment_score": -0.22257846593856812,
      "original_lang": "hi"
    },
    {
      "id": "1915074755889447078",
      "text": "Anjana is doing Hindu-Muslim\n\nChitra is doing Hindu-Muslim \n\nShweta is doing Hindu-Muslim \n\nMeanwhile Pratima Mishra ⚡\n\nShe is asking the most important questions to BJP on Pahalgam attack Intelligence and security concern. EXCELLENT. 🔥\n\nhttps://t.co/w3di4veG0z",
      "cleaned_text": "anjana is doing hindu muslim chitra is doing hindu muslim shweta is doing hindu muslim meanwhile pratima mishra she is asking the most important questions to bjp on pahalgam attack intelligence and security concern excellent ",
      "favorite_count": 1582,
      "retweet_count": 578,
      "reply_count": 30,
      "sentiment": "positive",
      "sentiment_score": 0.14425405859947205,
      "original_lang": "en"
    },
    {
      "id": "1915324177831092578",
      "text": "Kochi, Kerala |  Arathi, eye witness and daughter of N Ramachandran, who was killed by terrorists in Pahalgam attack, says, \"On hearing a gunshot, I asked my father what that sound was. He said he wasn’t sure. As we heard more gunshots, we started to run. We saw other people also running. It was a chaos overall. Suddenly, we saw a man coming with a gun. There were 2-3 groups beside us. We saw the man asking the group something, and then he was shooting at them. At this, I panicked, and I told my father that the man was coming towards us. My father was calm, and he said let’s see what happens. The man came towards us and said 'Kalma'. When we said we didn't understand what he was saying, the man shot my father...Kashmiris are very helpful. Both Central and J&K govt also helped us a lot.\"",
      "cleaned_text": "kochi kerala arathi eye witness and daughter of n ramachandran who was killed by terrorists in pahalgam attack says on hearing a gunshot i asked my father what that sound was he said he wasn t sure as we heard more gunshots we started to run we saw other people also running it was a chaos overall suddenly we saw a man coming with a gun there were 2 3 groups beside us we saw the man asking the group something and then he was shooting at them at this i panicked and i told my father that the man was coming towards us my father was calm and he said let s see what happens the man came towards us and said kalma when we said we didn t understand what he was saying the man shot my father kashmiris are very helpful both central and j k govt also helped us a lot ",
      "favorite_count": 3790,
      "retweet_count": 595,
      "reply_count": 237,
      "sentiment": "negative",
      "sentiment_score": -0.30719172954559326,
      "original_lang": "en"
    },
    {
      "id": "1915563912361370013",
      "text": "Press Release : LIC announces relaxations for victims of Pahalgam Terror Attack\n\n#Pahalgam #LIC https://t.co/lg0A9vLDJs",
      "cleaned_text": "press release lic announces relaxations for victims of pahalgam terror attack ",
      "favorite_count": 139,
      "retweet_count": 36,
      "reply_count": 7,
      "sentiment": "negative",
      "sentiment_score": -0.062428951263427734,
      "original_lang": "en"
    },
    {
      "id": "1915120904595509270",
      "text": "Hello @Uppolice\n\nHe is Abrar from Uttar Pradesh, and he is celebrating the terrorist attack happened on Hindus yesterday in Pahalgam, Kashmir, He is mocking on killings of Hindus\n\n@dgpup Sir, Please teach him lesson of patriotism so that he never forget what UP Police can do 🙏🏻 https://t.co/CjpsgPFiOH",
      "cleaned_text": "hello he is abrar from uttar pradesh and he is celebrating the terrorist attack happened on hindus yesterday in pahalgam kashmir he is mocking on killings of hindus sir please teach him lesson of patriotism so that he never forget what up police can do ",
      "favorite_count": 2599,
      "retweet_count": 1441,
      "reply_count": 101,
      "sentiment": "negative",
      "sentiment_score": -0.14705073833465576,
      "original_lang": "en"
    },
    {
      "id": "1914854178087674221",
      "text": "Central Govt controls Army, Police &amp; Intelligence in Jammu &amp; Kashmir —before &amp; after elections\n\nYet Arnab Goswami blames elections &amp; Supreme Court for Pahalgam terr0r attack, just to shield the Govt\n\nThis isn’t Journalism. It’s a betrayal of the martyrs\n\n#PahalgamTerroristAttack https://t.co/MrIQE8YguA",
      "cleaned_text": "central govt controls army police amp intelligence in jammu amp kashmir before amp after elections yet arnab goswami blames elections amp supreme court for pahalgam terr0r attack just to shield the govt this isn t journalism it s a betrayal of the martyrs ",
      "favorite_count": 4675,
      "retweet_count": 1319,
      "reply_count": 452,
      "sentiment": "negative",
      "sentiment_score": -0.6855848431587219,
      "original_lang": "en"
    },
    {
      "id": "1915604359700001095",
      "text": "VIDEO | Anantnag, Jammu and Kashmir: Visuals of the house of a terrorist allegedly involved in Pahalgam attack. The House was demolished overnight.\n\n#PahalgamTerroristAttack #Pahalgam \n\n(Full video available on PTI Videos - https://t.co/n147TvrpG7) https://t.co/BGq0SnfQf8",
      "cleaned_text": "video anantnag jammu and kashmir visuals of the house of a terrorist allegedly involved in pahalgam attack the house was demolished overnight full video available on pti videos ",
      "favorite_count": 574,
      "retweet_count": 79,
      "reply_count": 30,
      "sentiment": "negative",
      "sentiment_score": -0.42216968536376953,
      "original_lang": "en"
    },
    {
      "id": "1915036028219408836",
      "text": "Iran strongly and unequivocally condemns the terrorist attack against tourists in #Pahalgam. Our thoughts and prayers are with the innocent victims and their families. \nWe extend our heartfelt  condolences to the people &amp; government of India. https://t.co/rJc674Oogl",
      "cleaned_text": "iran strongly and unequivocally condemns the terrorist attack against tourists in our thoughts and prayers are with the innocent victims and their families we extend our heartfelt condolences to the people amp government of india ",
      "favorite_count": 9424,
      "retweet_count": 955,
      "reply_count": 212,
      "sentiment": "negative",
      "sentiment_score": -0.42638099193573,
      "original_lang": "en"
    },
    {
      "id": "1914928800678154722",
      "text": "These are the sketches of the terrorists involved in the terror attack in J&amp;K's Pahalgam, in which at least 26 tourists were killed.\n\nThe names of  the 3 terrorists are Asif Fauji, Suleman Shah and Abu Talha.\n\nShare these sketches everywhere. https://t.co/6kPkDHGPmd",
      "cleaned_text": "these are the sketches of the terrorists involved in the terror attack in j amp k s pahalgam in which at least 26 tourists were killed the names of the 3 terrorists are asif fauji suleman shah and abu talha share these sketches everywhere ",
      "favorite_count": 4088,
      "retweet_count": 2069,
      "reply_count": 83,
      "sentiment": "negative",
      "sentiment_score": -0.5375254154205322,
      "original_lang": "en"
    },
    {
      "id": "1914882510116544934",
      "text": "Sri Lanka strongly condemns the heinous terrorist attack that took place in Pahalgam, Jammu & Kashmir today. \n\n🇮🇳🇱🇰\n\nWe extend our heartfelt condolences to the families of the victims and wish a speedy recovery to those injured.\n\n#Pahalgam #PahalgamTerroristAttack #PahalgamTerrorAttack \n\nSri Lanka stands in firm solidarity with the Government and people of India in the fight against terrorism in all its forms and manifestations. We reiterate our unwavering commitment to regional peace and security. @MFA_SriLanka \n\nPray 🙏",
      "cleaned_text": "sri lanka strongly condemns the heinous terrorist attack that took place in pahalgam jammu kashmir today we extend our heartfelt condolences to the families of the victims and wish a speedy recovery to those injured sri lanka stands in firm solidarity with the government and people of india in the fight against terrorism in all its forms and manifestations we reiterate our unwavering commitment to regional peace and security pray ",
      "favorite_count": 7371,
      "retweet_count": 636,
      "reply_count": 35,
      "sentiment": "negative",
      "sentiment_score": -0.14632657170295715,
      "original_lang": "en"
    },
    {
      "id": "1914930997465882782",
      "text": "Shubhankar Mishra doing his job as a journalist and holding Modi and Amit Shah directly responsible for their failure in the #Pahalgam Terror Attack. \n\nRare sight to see a journalist showing spine. 🔥\n\nThis video should reach everyone. https://t.co/zSpcaBHWDQ",
      "cleaned_text": "shubhankar mishra doing his job as a journalist and holding modi and amit shah directly responsible for their failure in the terror attack rare sight to see a journalist showing spine this video should reach everyone ",
      "favorite_count": 4316,
      "retweet_count": 1336,
      "reply_count": 107,
      "sentiment": "neutral",
      "sentiment_score": -0.0419154167175293,
      "original_lang": "en"
    },
    {
      "id": "1914654963105710589",
      "text": "Pahalgam attack: 12 tourists injured. 1 dead. Casualties likely to rise.\n\nEyewitness says terrorist checked religion (Non-Muslim) before shooting. \n\nPM calls HM Amit Shah and asks him to take immediate measures including visit to site. Urgent meeting called at HM residence https://t.co/lITGOfhs2A",
      "cleaned_text": "pahalgam attack 12 tourists injured 1 dead casualties likely to rise eyewitness says terrorist checked religion non muslim before shooting pm calls hm amit shah and asks him to take immediate measures including visit to site urgent meeting called at hm residence ",
      "favorite_count": 4434,
      "retweet_count": 1755,
      "reply_count": 178,
      "sentiment": "negative",
      "sentiment_score": -0.7375394701957703,
      "original_lang": "en"
    },
    {
      "id": "1915611700386291770",
      "text": "VIDEO | House of terrorist Asif Sheikh, who was allegedly involved in Pahalgam terror attack, was blown up in Jammu and Kashmir's Tral. More details awaited.\n\n(Source: Third Party)\n\n(Full video available on PTI Videos - https://t.co/n147TvrpG7) https://t.co/KQLGoPRpgf",
      "cleaned_text": "video house of terrorist asif sheikh who was allegedly involved in pahalgam terror attack was blown up in jammu and kashmir s tral more details awaited source third party full video available on pti videos ",
      "favorite_count": 427,
      "retweet_count": 57,
      "reply_count": 28,
      "sentiment": "negative",
      "sentiment_score": -0.2605625092983246,
      "original_lang": "en"
    },
    {
      "id": "1915310327279083941",
      "text": "Resolution adopted by the Congress Working Committee Meeting held today — \n\nThe Congress Working Committee (CWC) expresses its deepest shock and condemnation of the heinous terrorist attack in Pahalgam, Jammu and Kashmir, on April 22, 2025, which claimed the lives of 26 innocent tourists and left more than 20 others grievously injured. The Congress Working Committee extends its deepest condolences to the bereaved families. It stands with them wholeheartedly in this moment of profound anguish.\n\nThis cowardly and calculated act of terror, mastermind by Pakistan, is a direct assault on the values of our Republic. The deliberate targeting of Hindus was done to inflame passions across the country.We appeal for calm in the face of this grave provocation and reaffirm our collective strength in the face of adversity. The CWC appeals for calm and reaffirms the Indian National Congress' longstanding resolve to combat cross-border terrorism with determination and unity.\n\nCWC also pays tribute to the local ponywalas and tourist guides, one of whom was martyred while selflessly trying to protect the tourist to uphold the idea of india.\n\nIn order to demonstrate the collective will of the nation, the Indian National Congress had, on the night of the 22nd itself, called for an all-party meeting chaired by the Hon’ble Prime Minister. This meeting has now been scheduled for today.\n\nPahalgam is known to be a heavily guarded area, secured by a three-tier security https://t.co/0Bpk5WmzqP is imperative that a comprehensive analysis is conducted into the intelligence failures and security lapses that enabled such an attack in a Union Territory — an area directly under the purview of the Union Home Ministry. These questions must be raised in the larger public interest. This is the only way justice can truly be seen to be served for the families whose lives have been so brutally devastated.\n\nThe CWC also notes that the Amarnath Yatra is set to commence shortly. Lakhs of pilgrims from across India participate in this annual journey, and their safety must be treated as a national priority. Robust, transparent, and proactive security arrangements must be put in place without delay. The safety of pilgrims, as well as the livelihoods of the people of Jammu and Kashmir, many of whom depend on tourism, must be protected with full sincerity and seriousness.\n\nThe massacre has rightly drawn condemnation from all political parties in Jammu and Kashmir and from a wide cross-section of its citizens. However, it is shocking that the BJP is exploiting this grave tragedy through official and proxy social media platforms to sow further discord, mistrust, polarisation and division at a time when unity and solidarity is most needed.\n\n#PahalgamTerroristAttack",
      "cleaned_text": "resolution adopted by the congress working committee meeting held today the congress working committee cwc expresses its deepest shock and condemnation of the heinous terrorist attack in pahalgam jammu and kashmir on april 22 2025 which claimed the lives of 26 innocent tourists and left more than 20 others grievously injured the congress working committee extends its deepest condolences to the bereaved families it stands with them wholeheartedly in this moment of profound anguish this cowardly and calculated act of terror mastermind by pakistan is a direct assault on the values of our republic the deliberate targeting of hindus was done to inflame passions across the country we appeal for calm in the face of this grave provocation and reaffirm our collective strength in the face of adversity the cwc appeals for calm and reaffirms the indian national congress longstanding resolve to combat cross border terrorism with determination and unity cwc also pays tribute to the local ponywalas and tourist guides one of whom was martyred while selflessly trying to protect the tourist to uphold the idea of india in order to demonstrate the collective will of the nation the indian national congress had on the night of the 22nd itself called for an all party meeting chaired by the hon ble prime minister this meeting has now been scheduled for today pahalgam is known to be a heavily guarded area secured by a three tier security is imperative that a comprehensive analysis is conducted into the intelligence failures and security lapses that enabled such an attack in a union territory an area directly under the purview of the union home ministry these questions must be raised in the larger public interest this is the only way justice can truly be seen to be served for the families whose lives have been so brutally devastated the cwc also notes that the amarnath yatra is set to commence shortly lakhs of pilgrims from across india participate in this annual journey and their safety must be treated as a national priority robust transparent and proactive security arrangements must be put in place without delay the safety of pilgrims as well as the livelihoods of the people of jammu and kashmir many of whom depend on tourism must be protected with full sincerity and seriousness the massacre has rightly drawn condemnation from all political parties in jammu and kashmir and from a wide cross section of its citizens however it is shocking that the bjp is exploiting this grave tragedy through official and proxy social media platforms to sow further discord mistrust polarisation and division at a time when unity and solidarity is most needed ",
      "favorite_count": 2335,
      "retweet_count": 994,
      "reply_count": 108,
      "sentiment": "negative",
      "sentiment_score": -0.7933398485183716,
      "original_lang": "en"
    },
    {
      "id": "1915616362669424970",
      "text": "#WATCH | Anantnag, J&amp;K | Visuals of a destroyed house that allegedly belonged to a terrorist involved in the Pahalgam terror attack https://t.co/hYav2gUpCC",
      "cleaned_text": " anantnag j amp k visuals of a destroyed house that allegedly belonged to a terrorist involved in the pahalgam terror attack ",
      "favorite_count": 1044,
      "retweet_count": 114,
      "reply_count": 25,
      "sentiment": "negative",
      "sentiment_score": -0.7342665791511536,
      "original_lang": "en"
    },
    {
      "id": "1915628207388205260",
      "text": "Haryana, Ambala.\n\nHindu groups shouted \"Jai Shri Ram\" while attacking Muslim-run biryani shops and threatening Muslim women with sexual violence during a protest over the Pahalgam attack.\n#PahalgamTerrorAttack https://t.co/u7Ln5sEODN",
      "cleaned_text": "haryana ambala hindu groups shouted jai shri ram while attacking muslim run biryani shops and threatening muslim women with sexual violence during a protest over the pahalgam attack ",
      "favorite_count": 122,
      "retweet_count": 85,
      "reply_count": 12,
      "sentiment": "negative",
      "sentiment_score": -0.6866974234580994,
      "original_lang": "en"
    },
    {
      "id": "1915623477148557408",
      "text": "#WATCH | Tral, J&amp;K | Visuals of a destroyed house that is allegedly linked to a terrorist involved in the Pahalgam terror attack https://t.co/luIH9rQIKR",
      "cleaned_text": " tral j amp k visuals of a destroyed house that is allegedly linked to a terrorist involved in the pahalgam terror attack ",
      "favorite_count": 683,
      "retweet_count": 79,
      "reply_count": 19,
      "sentiment": "negative",
      "sentiment_score": -0.7563755512237549,
      "original_lang": "en"
    },
    {
      "id": "1914671802262888499",
      "text": "#Pahalgam attack is not just a terror attack, it’s a massacre.  Attack planned to time with JD Vance visit and after Asim Munir’s anti-Hindu rant against India. Will Wait for official numbers of casualties but what sources are saying are heartbreaking 💔  😡 https://t.co/VJikA39sel",
      "cleaned_text": " attack is not just a terror attack it s a massacre attack planned to time with jd vance visit and after asim munir s anti hindu rant against india will wait for official numbers of casualties but what sources are saying are heartbreaking ",
      "favorite_count": 688,
      "retweet_count": 363,
      "reply_count": 45,
      "sentiment": "negative",
      "sentiment_score": -0.8838768005371094,
      "original_lang": "en"
    },
    {
      "id": "1915599535608619201",
      "text": "DO INDIAN LIVES MATTER AT ALL?\n\nLast evening, the Modi Govt called an all-party meeting on the dastardly terror attack which happened in Pahalgam, J&K. \n\nBut instead of being at the meeting, PM Modi was busy with an election campaign program in Bihar waving a flag for a train.\n\nCould he have sent the Rail Minister instead? Absolutely.\n\nEven during the Pulwama terror attack, Modi was busy shooting a TV show called \"Man vs. Wild\" with Bear Grylls in Uttarakhand.\n\nJust days ago, 26 innocent Indians were murdered by terrorists. And all political parties came together last evening to support the Union Govt on responding to the attack. The LoPs from BOTH Houses of Parliament were present. \n\nBut Modi didn't feel that 26 Indian lives are important.\n\nBecause, for the shameless man Modi, every death (in uniform or of a civilian) is merely an opportunity to ask for votes & to campaign for elections.",
      "cleaned_text": "do indian lives matter at all last evening the modi govt called an all party meeting on the dastardly terror attack which happened in pahalgam j k but instead of being at the meeting pm modi was busy with an election campaign program in bihar waving a flag for a train could he have sent the rail minister instead absolutely even during the pulwama terror attack modi was busy shooting a tv show called man vs wild with bear grylls in uttarakhand just days ago 26 innocent indians were murdered by terrorists and all political parties came together last evening to support the union govt on responding to the attack the lops from both houses of parliament were present but modi didn t feel that 26 indian lives are important because for the shameless man modi every death in uniform or of a civilian is merely an opportunity to ask for votes to campaign for elections ",
      "favorite_count": 330,
      "retweet_count": 121,
      "reply_count": 27,
      "sentiment": "negative",
      "sentiment_score": -0.5701530575752258,
      "original_lang": "en"
    },
    {
      "id": "1915391406446711159",
      "text": "Pahalgam Attack victim Aarthi Menon- \n\n\"A man emerged from the woods. \n\nHe asked us to kneel down and we did. \n\nThen, he said something like 'Kalma' twice. We didn't get it. \n\nNext moment, he opened fire. My father fell beside us. \n\nMy sons started screaming, and the man walked off. I knew my father was gone. I grabbed the boys and ran into the forest.\n\nI don't know how long we ran in the woods. \n\nWhen finally my phone picked up the signal, I called our driver. \n\nThey reached in 10 minutes. My driver Musafir and another man Sameer who I now consider my brothers stood by me through everything.\n\n They took me to mortuary and helped with the formalities. I waited there till 3 AM. I was in trauma.\"",
      "cleaned_text": "pahalgam attack victim aarthi menon a man emerged from the woods he asked us to kneel down and we did then he said something like kalma twice we didn t get it next moment he opened fire my father fell beside us my sons started screaming and the man walked off i knew my father was gone i grabbed the boys and ran into the forest i don t know how long we ran in the woods when finally my phone picked up the signal i called our driver they reached in 10 minutes my driver musafir and another man sameer who i now consider my brothers stood by me through everything they took me to mortuary and helped with the formalities i waited there till 3 am i was in trauma ",
      "favorite_count": 5436,
      "retweet_count": 901,
      "reply_count": 269,
      "sentiment": "negative",
      "sentiment_score": -0.14193470776081085,
      "original_lang": "en"
    },
    {
      "id": "1914952106597032184",
      "text": "Pakistani terrorist Suleman Shah is standing extreme right. Pakistani terrorist Abu Talha is extreme left. Both puppets of coward Asim Munir responsible for the Pahalgam terror attack. One local terrorist Junaid (third person) is already dead in an old encounter. https://t.co/nGCuHHI2B7",
      "cleaned_text": "pakistani terrorist suleman shah is standing extreme right pakistani terrorist abu talha is extreme left both puppets of coward asim munir responsible for the pahalgam terror attack one local terrorist junaid third person is already dead in an old encounter ",
      "favorite_count": 4288,
      "retweet_count": 1135,
      "reply_count": 109,
      "sentiment": "negative",
      "sentiment_score": -0.7999305725097656,
      "original_lang": "en"
    },
    {
      "id": "1915622186804531588",
      "text": "Lashkar Chief Hafiz Saeed Was \"Handler\" For Pahalgam Attack Terrorists: Sources https://t.co/89VxMxlUUh https://t.co/z0ACvPiSGW",
      "cleaned_text": "lashkar chief hafiz saeed was handler for pahalgam attack terrorists sources ",
      "favorite_count": 89,
      "retweet_count": 13,
      "reply_count": 13,
      "sentiment": "negative",
      "sentiment_score": -0.27257633209228516,
      "original_lang": "en"
    },
    {
      "id": "1914965903873384823",
      "text": "Update: An Islamist from Jharkhand who was celebrating the Pahalgam terror attack by congratulating the Lashkar-e-Taiba (LeT) terrorist organization and thanking Pakistan on social media has now been arrested.\n\nThank you @JharkhandPolice, @DC_Ranchi, @ranchipolice, @bokaropolice https://t.co/kQ2fVh8cEs",
      "cleaned_text": "update an islamist from jharkhand who was celebrating the pahalgam terror attack by congratulating the lashkar e taiba let terrorist organization and thanking pakistan on social media has now been arrested thank you ",
      "favorite_count": 6090,
      "retweet_count": 1680,
      "reply_count": 185,
      "sentiment": "negative",
      "sentiment_score": -0.18774649500846863,
      "original_lang": "en"
    },
    {
      "id": "1915331518597128397",
      "text": "#Watch: Meet #SajadBhat, a local who carried an injured tourist down to safety on his back after the #Pahalgam attack https://t.co/VcT1fUAbdS",
      "cleaned_text": " meet a local who carried an injured tourist down to safety on his back after the attack ",
      "favorite_count": 645,
      "retweet_count": 124,
      "reply_count": 20,
      "sentiment": "negative",
      "sentiment_score": -0.6538204550743103,
      "original_lang": "en"
    },
    {
      "id": "1915374451283333498",
      "text": "Rank 1 CA Atul Aggarwal (@air1caatul) now a teacher with 28,000 followers on Telegram, is spreading hate against fellow Indians after the Pahalgam terror attack.\n\nEvery time something happens, people like him target Indian Muslims: never those actually in power.\n\nYou voted for Modi-Shah. Hold them accountable, not your neighbours.\n\nThis attack has nothing to do with Indian Muslims.\nBut bigots like Atul Aggarwal will always use tragedies to peddle hate.\n\nTerrorists kill. These people divide.\nAnd both need to be called out. Loudly.",
      "cleaned_text": "rank 1 ca atul aggarwal now a teacher with 28 000 followers on telegram is spreading hate against fellow indians after the pahalgam terror attack every time something happens people like him target indian muslims never those actually in power you voted for modi shah hold them accountable not your neighbours this attack has nothing to do with indian muslims but bigots like atul aggarwal will always use tragedies to peddle hate terrorists kill these people divide and both need to be called out loudly ",
      "favorite_count": 732,
      "retweet_count": 340,
      "reply_count": 45,
      "sentiment": "negative",
      "sentiment_score": -0.8425745964050293,
      "original_lang": "en"
    },
    {
      "id": "1914936249615257997",
      "text": "Cowardly. Inhuman. Shameful.\nThe attack in Pahalgam is not just an assault on lives, but on the spirit of our nation.\nWe stand united against terror — justice must be swift, strong, and uncompromising.\n#Pahalgam #TerrorAttack #IndiaWillNotForge https://t.co/XBrYhbIuN5",
      "cleaned_text": "cowardly inhuman shameful the attack in pahalgam is not just an assault on lives but on the spirit of our nation we stand united against terror justice must be swift strong and uncompromising ",
      "favorite_count": 12617,
      "retweet_count": 1217,
      "reply_count": 73,
      "sentiment": "negative",
      "sentiment_score": -0.8987633585929871,
      "original_lang": "en"
    },
    {
      "id": "1915075993770881069",
      "text": "Congress again started it's dirty secular game to brainwash Hindus\n\nPahalgam attack was a religious attack by Islamic terrorists but Congress supporters started a fake Hindu Muslim narrative to fool Hindus again \n\nHer name is Puja More and she is a supporter of Congress and NCP https://t.co/wBXJpG1csj",
      "cleaned_text": "congress again started it s dirty secular game to brainwash hindus pahalgam attack was a religious attack by islamic terrorists but congress supporters started a fake hindu muslim narrative to fool hindus again her name is puja more and she is a supporter of congress and ncp ",
      "favorite_count": 5109,
      "retweet_count": 2619,
      "reply_count": 252,
      "sentiment": "negative",
      "sentiment_score": -0.7722858786582947,
      "original_lang": "en"
    },
    {
      "id": "1914728954226991318",
      "text": "🚨ISLAMIC TERROR ATTACK🚨\n\nPresident Trump is reacting to the brutal attack that left 28 dead in Pahalgam, Kashmir.\n\nIslamic terrorists targeted Hindu tourists, including newlyweds. \n\nThe assailants checked victims' IDs and forced them to reveal their religion by removing clothing.\n\nNon-Muslims were then shot dead at close range, according to @AmyMek’s report.",
      "cleaned_text": " islamic terror attack president trump is reacting to the brutal attack that left 28 dead in pahalgam kashmir islamic terrorists targeted hindu tourists including newlyweds the assailants checked victims ids and forced them to reveal their religion by removing clothing non muslims were then shot dead at close range according to s report ",
      "favorite_count": 3164,
      "retweet_count": 1258,
      "reply_count": 193,
      "sentiment": "negative",
      "sentiment_score": -0.8498117923736572,
      "original_lang": "en"
    },
    {
      "id": "1914708062578909577",
      "text": "These are visuals of local Kashmiris in #Pahalgam holding a candle march and condemning the deadly and cowardly terror attack on Tourists. \n\nTight slap to Pakistan Sponsored Jihadis by Kashmiris 👏🏻\n\nIndia stands against terror. \n https://t.co/SVosRSl2B6",
      "cleaned_text": "these are visuals of local kashmiris in holding a candle march and condemning the deadly and cowardly terror attack on tourists tight slap to pakistan sponsored jihadis by kashmiris india stands against terror ",
      "favorite_count": 7440,
      "retweet_count": 1344,
      "reply_count": 599,
      "sentiment": "negative",
      "sentiment_score": -0.6906304955482483,
      "original_lang": "en"
    },
    {
      "id": "1914943790999077021",
      "text": "BREAKING: \"China condemns the Pahalgam attack and opposes all forms of terrorism,\" says Chinese govt https://t.co/TEhEoC4Jf3",
      "cleaned_text": "breaking china condemns the pahalgam attack and opposes all forms of terrorism says chinese govt ",
      "favorite_count": 8321,
      "retweet_count": 674,
      "reply_count": 42,
      "sentiment": "negative",
      "sentiment_score": -0.8076081275939941,
      "original_lang": "en"
    },
    {
      "id": "1915040309677052305",
      "text": "PAT CUMMINS, HARDIK PANDYA AND HARSHA BHOGLE CONDEMN THE PAHALGAM TERROR ATTACK. 🙏https://t.co/DSVqhcEuPT",
      "cleaned_text": "pat cummins hardik pandya and harsha bhogle condemn the pahalgam terror attack ",
      "favorite_count": 30380,
      "retweet_count": 2960,
      "reply_count": 92,
      "sentiment": "negative",
      "sentiment_score": -0.17008014023303986,
      "original_lang": "en"
    },
    {
      "id": "1915290325880369412",
      "text": "Muslim journalist reported that Hindus were selectively k!lled in Pahalgam terror attack. Even someone like Owaisi accepted it. \n\nBut our Hindu seculars……🤡🤡🤡🤡 https://t.co/qCuDNDF22c",
      "cleaned_text": "muslim journalist reported that hindus were selectively k lled in pahalgam terror attack even someone like owaisi accepted it but our hindu seculars ",
      "favorite_count": 7308,
      "retweet_count": 2780,
      "reply_count": 37,
      "sentiment": "negative",
      "sentiment_score": -0.7406608462333679,
      "original_lang": "en"
    },
    {
      "id": "1915448104171848071",
      "text": "Pahalgam Attack के खिलाफ Bathinda में अनोखा विरोध प्रदर्शन, प्रदर्शनकारी के हाथों में दिखी बंदूक\n\n#PahalgamTerroristAttack #Pahalgam | #pahalgamattack",
      "cleaned_text": "pahalgam attack क ख ल फ bathinda म अन ख व र ध प रदर शन प रदर शनक र क ह थ म द ख ब द क ",
      "favorite_count": 1202,
      "retweet_count": 231,
      "reply_count": 57,
      "sentiment": "negative",
      "sentiment_score": -0.18479183316230774,
      "original_lang": "hi"
    },
    {
      "id": "1914738463964061803",
      "text": "Lt. Vinay Narwal, 26, posted in Kochi, is among those killed in the Pahalgam attack while on his honeymoon. A native of Haryana, he had just tied the knot on April 16. His wife is also reportedly among the victims. https://t.co/IIWcF53biJ",
      "cleaned_text": "lt vinay narwal 26 posted in kochi is among those killed in the pahalgam attack while on his honeymoon a native of haryana he had just tied the knot on april 16 his wife is also reportedly among the victims ",
      "favorite_count": 6954,
      "retweet_count": 1715,
      "reply_count": 79,
      "sentiment": "negative",
      "sentiment_score": -0.4659975469112396,
      "original_lang": "en"
    },
    {
      "id": "1915022736994271432",
      "text": "BJP workers thrashed a journalist from Kathua associated with Jagran news. \n\nHe was asking, “who is responsible for the Pahalgam attack? Is the home ministry not accountable?\n\nFor this, BJP goons attacked him and now he is in hospital. \n\nShame on BJP workers! https://t.co/m30PAW7oVh",
      "cleaned_text": "bjp workers thrashed a journalist from kathua associated with jagran news he was asking who is responsible for the pahalgam attack is the home ministry not accountable for this bjp goons attacked him and now he is in hospital shame on bjp workers ",
      "favorite_count": 3436,
      "retweet_count": 1443,
      "reply_count": 52,
      "sentiment": "negative",
      "sentiment_score": -0.7469728589057922,
      "original_lang": "en"
    },
    {
      "id": "1915091906335522914",
      "text": "“La Ilaha Illallah”: How This Professor Survived the Pahalgam Attack\n\nDebasish Bhattacharyya was caught in the deadly Pahalgam terror attack. He believes he was spared because he recited the Kalima.\n\n#PahalgamAttack #KashmirTerrorAttack #Kalima #Terrorism #ViralStory #MO https://t.co/lK2IDnjmsJ",
      "cleaned_text": " la ilaha illallah how this professor survived the pahalgam attack debasish bhattacharyya was caught in the deadly pahalgam terror attack he believes he was spared because he recited the kalima ",
      "favorite_count": 2228,
      "retweet_count": 716,
      "reply_count": 191,
      "sentiment": "negative",
      "sentiment_score": -0.05383548140525818,
      "original_lang": "en"
    },
    {
      "id": "1915459494227722543",
      "text": "Pakistan has deemed India’s suspension of the Indus Water Treaty an ‘act of war’, following the deadly tourist attack in Kashmir’s Pahalgam.\n\nHere's what you need to know about India’s Indus Waters Treaty freeze https://t.co/1FfYGVCKUR https://t.co/EPGu2NWo0B",
      "cleaned_text": "pakistan has deemed india s suspension of the indus water treaty an act of war following the deadly tourist attack in kashmir s pahalgam here s what you need to know about india s indus waters treaty freeze ",
      "favorite_count": 451,
      "retweet_count": 179,
      "reply_count": 39,
      "sentiment": "negative",
      "sentiment_score": -0.8240756392478943,
      "original_lang": "en"
    },
    {
      "id": "1914781280849592751",
      "text": "It’s basic common sense but in today’s India, this needs to be said out loud—Kashmiris and Muslims living across India have absolutely nothing to do with the terrorist attack in Pahalgam. As a society, we must ensure that they are not harassed in the name of “retaliation”.",
      "cleaned_text": "it s basic common sense but in today s india this needs to be said out loud kashmiris and muslims living across india have absolutely nothing to do with the terrorist attack in pahalgam as a society we must ensure that they are not harassed in the name of retaliation ",
      "favorite_count": 6331,
      "retweet_count": 1113,
      "reply_count": 502,
      "sentiment": "negative",
      "sentiment_score": -0.2873268723487854,
      "original_lang": "en"
    },
    {
      "id": "1915283738210251136",
      "text": "The Congress Working Committee, in its meeting today, strongly condemned the recent Pahalgam terror attack and paid tribute to the innocent lives lost. \n\nWe stand united in the fight against terrorism.\n\n📍 New Delhi https://t.co/bFCwnD3jvz",
      "cleaned_text": "the congress working committee in its meeting today strongly condemned the recent pahalgam terror attack and paid tribute to the innocent lives lost we stand united in the fight against terrorism new delhi ",
      "favorite_count": 2247,
      "retweet_count": 752,
      "reply_count": 102,
      "sentiment": "neutral",
      "sentiment_score": -0.012242048978805542,
      "original_lang": "en"
    },
    {
      "id": "1915357822813872613",
      "text": "Two Muslim men attacked by Hindutva mob in Haryana. \n\nFollowing the Pahalgam attack in Kashmir, innocent Muslims are being targeted and attacked by Hindutva mobs across the country. \n\n#India https://t.co/2pyPcCulBm",
      "cleaned_text": "two muslim men attacked by hindutva mob in haryana following the pahalgam attack in kashmir innocent muslims are being targeted and attacked by hindutva mobs across the country ",
      "favorite_count": 712,
      "retweet_count": 399,
      "reply_count": 29,
      "sentiment": "negative",
      "sentiment_score": -0.845713198184967,
      "original_lang": "en"
    },
    {
      "id": "1915244517369712939",
      "text": "சரியான நேரத்தில் சரியான வீடியோ 🔥🔥\n\nPahalgam Terrorist Attack இதன் பின்னணி என்ன? https://t.co/SkGgTuEhxI",
      "cleaned_text": "சர ய ன ந ரத த ல சர ய ன வ ட ய pahalgam terrorist attack இதன ப ன னண என ன ",
      "favorite_count": 5991,
      "retweet_count": 2086,
      "reply_count": 67,
      "sentiment": "negative",
      "sentiment_score": -0.3510252833366394,
      "original_lang": NaN
    },
    {
      "id": "1914784984784634104",
      "text": "My dear friend @narendramodi,\nI am deeply saddened by the barbaric terrorist attack in #Pahalgam, Jammu &amp; Kashmir, that killed and injured dozens of innocents.\nOur thoughts and prayers are with the victims &amp; their families.\nIsrael stands with India in its fight against terrorism.",
      "cleaned_text": "my dear friend i am deeply saddened by the barbaric terrorist attack in jammu amp kashmir that killed and injured dozens of innocents our thoughts and prayers are with the victims amp their families israel stands with india in its fight against terrorism ",
      "favorite_count": 64430,
      "retweet_count": 9664,
      "reply_count": 1082,
      "sentiment": "negative",
      "sentiment_score": -0.9124895334243774,
      "original_lang": "en"
    },
    {
      "id": "1915291439384125715",
      "text": "Under the leadership of INC President Sh. Mallikarjun @kharge ji, CPP Chairperson Smt. Sonia Gandhi ji and LOP Sh. @RahulGandhi ji, we held an emergency CWC Meeting at 24, Akbar Road today to discuss the horrific Pahalgam terror attack. \n\nWe began the meeting by observing 2 minutes of silence for the deceased victims of this attack. No words are enough to condemn the cowardly act of these terrorists.",
      "cleaned_text": "under the leadership of inc president sh mallikarjun ji cpp chairperson smt sonia gandhi ji and lop sh ji we held an emergency cwc meeting at 24 akbar road today to discuss the horrific pahalgam terror attack we began the meeting by observing 2 minutes of silence for the deceased victims of this attack no words are enough to condemn the cowardly act of these terrorists ",
      "favorite_count": 939,
      "retweet_count": 285,
      "reply_count": 23,
      "sentiment": "negative",
      "sentiment_score": -0.6196931600570679,
      "original_lang": "en"
    },
    {
      "id": "1915297288387436873",
      "text": "Pawan Kalyan questions the cabal who unite and voice their concern for Palestine Muslims but keep quiet when the attack is on HINDUS \n\nBe it Bangladesh or the Pahalgam attack \nThe particular community is targeting HINDUs \n\nAs a mark of respect & solidarity @JanaSenaParty will observe 3 days of mourning across the Telugu States. JSP party flag will fly at half-mast",
      "cleaned_text": "pawan kalyan questions the cabal who unite and voice their concern for palestine muslims but keep quiet when the attack is on hindus be it bangladesh or the pahalgam attack the particular community is targeting hindus as a mark of respect solidarity will observe 3 days of mourning across the telugu states jsp party flag will fly at half mast",
      "favorite_count": 18291,
      "retweet_count": 5280,
      "reply_count": 64,
      "sentiment": "negative",
      "sentiment_score": -0.07960787415504456,
      "original_lang": "en"
    },
    {
      "id": "1915265583991435682",
      "text": "Why Colin Munro is wearing black armband during PSL match, is it for pahalgam terror attack or something else 🤔 just asking https://t.co/JN0SQhJWIe",
      "cleaned_text": "why colin munro is wearing black armband during psl match is it for pahalgam terror attack or something else just asking ",
      "favorite_count": 8170,
      "retweet_count": 378,
      "reply_count": 53,
      "sentiment": "negative",
      "sentiment_score": -0.5630239248275757,
      "original_lang": "en"
    },
    {
      "id": "1915546028431863877",
      "text": "Hindu American Foundation slams Western Media for Whitewashing and Gaslighting the Islamist Terror attack by Pakistani terror group in India’s Pahalgam of Jammu in Kashmir. Bravo, @SuhagAShukla! We Kashmiris are used to Western Press shielding Islamist terrorists in reportage. https://t.co/oSYR9N9lk3",
      "cleaned_text": "hindu american foundation slams western media for whitewashing and gaslighting the islamist terror attack by pakistani terror group in india s pahalgam of jammu in kashmir bravo we kashmiris are used to western press shielding islamist terrorists in reportage ",
      "favorite_count": 2740,
      "retweet_count": 737,
      "reply_count": 14,
      "sentiment": "negative",
      "sentiment_score": -0.5399798154830933,
      "original_lang": "en"
    },
    {
      "id": "1915092875630747657",
      "text": "SHOCKING NEWS 🚨 Women Journalists Chitra Tripathi and Republic TV anchor heckled by locals in Kashmir.\n\nSHAMEFUL INCIDENT !!\n\nThey were just reporting on the attack on Hindus in Pahalgam.\n\nChants of \"Godi Media go back\" echoed.\n\nMUSLIM WOMEN : You Go Back !!\n\nCHITRA TRIPATHI : I won't go\n\nThen they were forced to switch off Camera.",
      "cleaned_text": "shocking news women journalists chitra tripathi and republic tv anchor heckled by locals in kashmir shameful incident they were just reporting on the attack on hindus in pahalgam chants of godi media go back echoed muslim women you go back chitra tripathi i won t go then they were forced to switch off camera ",
      "favorite_count": 13866,
      "retweet_count": 3585,
      "reply_count": 325,
      "sentiment": "negative",
      "sentiment_score": -0.7247618436813354,
      "original_lang": "en"
    },
    {
      "id": "1915614884374421748",
      "text": "🚨 Done and Dusted \n\nThe house of Adil Thokar involved in the Pahalgam terror attack was demolished in Bijbehara, Anantnag : Report \n\nPTI https://t.co/c6X7E4JWHX",
      "cleaned_text": " done and dusted the house of adil thokar involved in the pahalgam terror attack was demolished in bijbehara anantnag report pti ",
      "favorite_count": 1816,
      "retweet_count": 208,
      "reply_count": 37,
      "sentiment": "negative",
      "sentiment_score": -0.5148264765739441,
      "original_lang": "en"
    },
    {
      "id": "1915480659579326877",
      "text": "BIG BREAKING NEWS 🚨 Italian PM Georgia Meloni called PM Modi.\n\nShe expressed full support of Italy 🔥\n\nShe conveyed solidarity with India over the Pahalgam terror attack that killed 26 people.\n\nShe said \"India and Italy will work together to strengthen counter-terrorism effort\"\n\nIsrael PM Netanyahu & French President Emanual Macron also called PM Modi & conveyed personal condolences.",
      "cleaned_text": "big breaking news italian pm georgia meloni called pm modi she expressed full support of italy she conveyed solidarity with india over the pahalgam terror attack that killed 26 people she said india and italy will work together to strengthen counter terrorism effort israel pm netanyahu french president emanual macron also called pm modi conveyed personal condolences ",
      "favorite_count": 21436,
      "retweet_count": 2746,
      "reply_count": 163,
      "sentiment": "positive",
      "sentiment_score": 0.14487352967262268,
      "original_lang": "en"
    },
    {
      "id": "1915630070179234254",
      "text": "House of a terrorist involved in Pahalgam terror attack demolished by administration in Anantnag.\n\nThe same should happen in Tamil Nadu, too, if anybody supports Pakistan and Terrorists. \n\n@mkstalin @CMOTamilnadu \n https://t.co/C4Jmqpipnl",
      "cleaned_text": "house of a terrorist involved in pahalgam terror attack demolished by administration in anantnag the same should happen in tamil nadu too if anybody supports pakistan and terrorists ",
      "favorite_count": 197,
      "retweet_count": 46,
      "reply_count": 3,
      "sentiment": "negative",
      "sentiment_score": -0.5516191720962524,
      "original_lang": "en"
    },
    {
      "id": "1915290676549607823",
      "text": "VIDEO | Pahalgam terror attack: Local shawl hawker Sajad Ahmad Bhat, who carried an injured tourist to safety, says, \"This is a murder of humanity, and the entire Kashmir. It would've been better had they (terrorists) killed us, the Kashmiris. This was a cowardly act. This is the first time I have seen such an incident. The entire Kashmir is in shock.\"\n\n#Pahalgamterrorattack #Pahalgam\n\n(Full video available on PTI Videos - https://t.co/bIyFWTfmBd)",
      "cleaned_text": "video pahalgam terror attack local shawl hawker sajad ahmad bhat who carried an injured tourist to safety says this is a murder of humanity and the entire kashmir it would ve been better had they terrorists killed us the kashmiris this was a cowardly act this is the first time i have seen such an incident the entire kashmir is in shock full video available on pti videos ",
      "favorite_count": 2018,
      "retweet_count": 412,
      "reply_count": 54,
      "sentiment": "negative",
      "sentiment_score": -0.7948319911956787,
      "original_lang": "en"
    },
    {
      "id": "1915634700762128817",
      "text": "#WATCH | Following Pahalgam attack, Stéphane Dujarric, spox for UN Secretary-General says,\" We very much appeal to both the govts of Pakistan and govt of India, to exercise maximum restraint...\"\n\nHe (UN Secretary General) has not had any direct contact, but I can tell you he's obviously following the situation very closely and with very great concern. We were very clear in our condemnation of the terror attack that occurred in Jammu and Kashmir, on the 22nd, two days ago, which killed large number of civilians. But we very much appeal to both the governments of Pakistan and the government of India, to exercise maximum restraint and to ensure that the situation and the developments we've seen do not deteriorate any further. Any issues between Pakistan and India, we believe can be and should be resolved peacefully, through meaningful, mutual engagement.\"\n\n(Video source: United Nations/YouTube)",
      "cleaned_text": " following pahalgam attack stéphane dujarric spox for un secretary general says we very much appeal to both the govts of pakistan and govt of india to exercise maximum restraint he un secretary general has not had any direct contact but i can tell you he s obviously following the situation very closely and with very great concern we were very clear in our condemnation of the terror attack that occurred in jammu and kashmir on the 22nd two days ago which killed large number of civilians but we very much appeal to both the governments of pakistan and the government of india to exercise maximum restraint and to ensure that the situation and the developments we ve seen do not deteriorate any further any issues between pakistan and india we believe can be and should be resolved peacefully through meaningful mutual engagement video source united nations youtube ",
      "favorite_count": 34,
      "retweet_count": 6,
      "reply_count": 22,
      "sentiment": "negative",
      "sentiment_score": -0.1622479259967804,
      "original_lang": "en"
    },
    {
      "id": "1915012262546358607",
      "text": "Robert Vadra acting as ISI Spokesperson and Justifying Pahalgam terror attack  -“it happened because Muslims are feeling weakened” \n@irobertvadra  Why 26/11 Mumbai, Pulwama ,Uri and attack on Parliament happened ??  कितने पाकिस्तान बनाओगे तुम लोग 😳 https://t.co/NLF6wr1J1V",
      "cleaned_text": "robert vadra acting as isi spokesperson and justifying pahalgam terror attack it happened because muslims are feeling weakened why 26 11 mumbai pulwama uri and attack on parliament happened क तन प क स त न बन ओग त म ल ग ",
      "favorite_count": 989,
      "retweet_count": 369,
      "reply_count": 156,
      "sentiment": "negative",
      "sentiment_score": -0.6452292203903198,
      "original_lang": "en"
    },
    {
      "id": "1915283456017289657",
      "text": "Hamas leaders visited Pakistan & PoK multiple times last year, including a Feb 2025 anti-India rally in Rawalakot, PoK, with Jaish-e-Mohammed & Lashkar-e-Taiba, and JeM’s Bahawalpur HQ. The Pahalgam attack, echoing Hamas’s Oct 7 tactics, suggests coordinated terror planning. Watch this video from PoK. \n#PahalgamTerrroristAttack",
      "cleaned_text": "hamas leaders visited pakistan pok multiple times last year including a feb 2025 anti india rally in rawalakot pok with jaish e mohammed lashkar e taiba and jem s bahawalpur hq the pahalgam attack echoing hamas s oct 7 tactics suggests coordinated terror planning watch this video from pok ",
      "favorite_count": 3400,
      "retweet_count": 1133,
      "reply_count": 71,
      "sentiment": "negative",
      "sentiment_score": -0.06611084938049316,
      "original_lang": "en"
    },
    {
      "id": "1914957162620788840",
      "text": "My heart shatters into a million pieces as I grapple with the devastating news & chilling visuals of the Pahalgam attack. A land so divinely beautiful, blessed with majestic mountains and serene valleys, has been desecrated by the brutal hands of hatred & senseless political agendas. Innocent lives, full of hope and promise, were mercilessly snuffed out, leaving behind a trail of tears, shattered dreams, and inconsolable grief.\n\nHow can humanity stoop to such depths of depravity? How can the beauty of nature be perverted to stage such horrific crimes against humanity?\nThis tragic photo will never be forgotten & will forever represent the legacy of the barbaric terror that has killed thousands of innocent lives… \n\nMy thoughts are with the families of the victims, who now bear the unbearable weight of loss and sorrow. May they find the strength to carry on, and ‘May Justice Be Served Once & For All’ to bring solace to their shattered lives. \n“We need this chapter to end FOREVER!!”\n\n #PahalgamTerroristAttack",
      "cleaned_text": "my heart shatters into a million pieces as i grapple with the devastating news chilling visuals of the pahalgam attack a land so divinely beautiful blessed with majestic mountains and serene valleys has been desecrated by the brutal hands of hatred senseless political agendas innocent lives full of hope and promise were mercilessly snuffed out leaving behind a trail of tears shattered dreams and inconsolable grief how can humanity stoop to such depths of depravity how can the beauty of nature be perverted to stage such horrific crimes against humanity this tragic photo will never be forgotten will forever represent the legacy of the barbaric terror that has killed thousands of innocent lives my thoughts are with the families of the victims who now bear the unbearable weight of loss and sorrow may they find the strength to carry on and may justice be served once for all to bring solace to their shattered lives we need this chapter to end forever ",
      "favorite_count": 1185,
      "retweet_count": 122,
      "reply_count": 104,
      "sentiment": "negative",
      "sentiment_score": -0.44663965702056885,
      "original_lang": "en"
    },
    {
      "id": "1915615615907250553",
      "text": "Action against terror begins!\n\nLocal LeT terrorist Adil Thoker—one of the key suspects in the Pahalgam terror attack — lived in a quiet middle-class neighborhood of shopkeepers & cafe owners who served Bharat’s tourists with warmth. \n\nIndia is taking decisive and uncompromising action against terrorists & terror backers under Prime Minister @narendramodi Ji. \n\nTerrorist house now stands demolished. \n\n#PahalgamTerrorAttack",
      "cleaned_text": "action against terror begins local let terrorist adil thoker one of the key suspects in the pahalgam terror attack lived in a quiet middle class neighborhood of shopkeepers cafe owners who served bharat s tourists with warmth india is taking decisive and uncompromising action against terrorists terror backers under prime minister ji terrorist house now stands demolished ",
      "favorite_count": 536,
      "retweet_count": 124,
      "reply_count": 32,
      "sentiment": "negative",
      "sentiment_score": -0.5212258696556091,
      "original_lang": "en"
    },
    {
      "id": "1915623391098192220",
      "text": "#WATCH | Delhi | On Pahalgam terrorist attack, Senior advocate Kapil Sibal says, \"... I have a few suggestions for the Prime Minister. A special session of the Parliament must be held to discuss and get suggestions from everyone. The nation is standing with him... A terrorist is a terrorist, he has no religion... A resolution must be passed unanimously to express the sentiment of the nation in front of the world... We should send a delegation of the ruling and Oppostion MPs to countries like Africa, the US, Europe, China, Japan, Australia, New Zealand, Russia and South America, so that we can tell them on a global level about the situation. We will not be able to create diplomatic pressure if we don't take this step...\"",
      "cleaned_text": " delhi on pahalgam terrorist attack senior advocate kapil sibal says i have a few suggestions for the prime minister a special session of the parliament must be held to discuss and get suggestions from everyone the nation is standing with him a terrorist is a terrorist he has no religion a resolution must be passed unanimously to express the sentiment of the nation in front of the world we should send a delegation of the ruling and oppostion mps to countries like africa the us europe china japan australia new zealand russia and south america so that we can tell them on a global level about the situation we will not be able to create diplomatic pressure if we don t take this step ",
      "favorite_count": 253,
      "retweet_count": 22,
      "reply_count": 262,
      "sentiment": "negative",
      "sentiment_score": -0.4368290901184082,
      "original_lang": "en"
    },
    {
      "id": "1915445349000298848",
      "text": "AIUDF MLA Aminul Islam blamed the Indian govt for the Pahalgam attack.\n\nThink, he is an elected representative from Assam, India. But he is supporting Pakistan and its Islamic terrorists. https://t.co/TUHalsjcW3",
      "cleaned_text": "aiudf mla aminul islam blamed the indian govt for the pahalgam attack think he is an elected representative from assam india but he is supporting pakistan and its islamic terrorists ",
      "favorite_count": 252,
      "retweet_count": 101,
      "reply_count": 15,
      "sentiment": "negative",
      "sentiment_score": -0.5829164385795593,
      "original_lang": "en"
    },
    {
      "id": "1915194843225350435",
      "text": "With great anguish, landed in Bengaluru along with the families of the Pahalgam terror attack victims.\n\nThe mortal remains of Shri Manjunath are being taken to his hometown in Shivamogga, while those of Shri Bharath Bhushan are being moved to his residence in Mathikere. The mortal remains of the other victim from Karnataka, Shri Madhusudan, have been transported to his native Nellore via Chennai.\n\nOffered my heartfelt respects at the airport along with MoS Shri @VSOMANNA_BJP, standing in solidarity with the grieving family members during this deeply painful moment.\n\nMay they find strength in the love and prayers of the entire nation.\n\n@DheerajMuniraj",
      "cleaned_text": "with great anguish landed in bengaluru along with the families of the pahalgam terror attack victims the mortal remains of shri manjunath are being taken to his hometown in shivamogga while those of shri bharath bhushan are being moved to his residence in mathikere the mortal remains of the other victim from karnataka shri madhusudan have been transported to his native nellore via chennai offered my heartfelt respects at the airport along with mos shri standing in solidarity with the grieving family members during this deeply painful moment may they find strength in the love and prayers of the entire nation ",
      "favorite_count": 3210,
      "retweet_count": 450,
      "reply_count": 62,
      "sentiment": "positive",
      "sentiment_score": 0.09562608599662781,
      "original_lang": "en"
    },
    {
      "id": "1915496536903176319",
      "text": "SHOCKING | Bengali Hindu girl receives rape threats from two TMC-linked Muslim workers after speaking out on Pahalgam terror attack.\n\n#PahalgamTerroristAttack #Pahalgam #WestBengal \n https://t.co/GnmJFw4XiN",
      "cleaned_text": "shocking bengali hindu girl receives rape threats from two tmc linked muslim workers after speaking out on pahalgam terror attack ",
      "favorite_count": 768,
      "retweet_count": 535,
      "reply_count": 31,
      "sentiment": "negative",
      "sentiment_score": -0.8444028496742249,
      "original_lang": "en"
    },
    {
      "id": "1915469240209113313",
      "text": "The commentators of IPL were giving condolences to the victims of the Pahalgam terrorist attack.\n\nMeanwhile Jahils were bombarding laugh emojis.\n\nAnd still they have mouth to say that it wasn't about Hindu Muslim.\n\nJahil for a reason !!https://t.co/k7jJZkSAsf",
      "cleaned_text": "the commentators of ipl were giving condolences to the victims of the pahalgam terrorist attack meanwhile jahils were bombarding laugh emojis and still they have mouth to say that it wasn t about hindu muslim jahil for a reason ",
      "favorite_count": 1410,
      "retweet_count": 570,
      "reply_count": 26,
      "sentiment": "negative",
      "sentiment_score": -0.5293606519699097,
      "original_lang": "en"
    },
    {
      "id": "1915031655644860592",
      "text": "\"Pakistani terrorist Suleman Shah is standing on the extreme right. Pakistani terrorist Abu Talha is on the extreme left. Both puppets of coward Asim Munir are responsible for the Pahalgam terror attack. One local terrorist, Junaid (3rd), is already dead in an old encounter.\n\nSeven others are yet to be identified.\"\n\n- @FarazPervaiz3",
      "cleaned_text": " pakistani terrorist suleman shah is standing on the extreme right pakistani terrorist abu talha is on the extreme left both puppets of coward asim munir are responsible for the pahalgam terror attack one local terrorist junaid 3rd is already dead in an old encounter seven others are yet to be identified ",
      "favorite_count": 981,
      "retweet_count": 291,
      "reply_count": 45,
      "sentiment": "negative",
      "sentiment_score": -0.7596409916877747,
      "original_lang": "en"
    },
    {
      "id": "1915626272119771465",
      "text": "“What kind of government do we have? You are defaming Kashmir, but there is no problem with Kashmir—the problem is with our government’s security arrangements.”\n\n— Wife of Surat’s Shailesh Kalthia, who was killed in the Pahalgam terror attack https://t.co/66i8wUVfTe",
      "cleaned_text": " what kind of government do we have you are defaming kashmir but there is no problem with kashmir the problem is with our government s security arrangements wife of surat s shailesh kalthia who was killed in the pahalgam terror attack ",
      "favorite_count": 22,
      "retweet_count": 10,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.757588803768158,
      "original_lang": "en"
    },
    {
      "id": "1915450118561530319",
      "text": "Resolution in Argentina Parliament to condemn the Pahalgam terror attack: https://t.co/qoZA0DKUfF",
      "cleaned_text": "resolution in argentina parliament to condemn the pahalgam terror attack ",
      "favorite_count": 10236,
      "retweet_count": 1417,
      "reply_count": 33,
      "sentiment": "negative",
      "sentiment_score": -0.5579555630683899,
      "original_lang": "en"
    },
    {
      "id": "1915324138056745431",
      "text": "Indian drama about the Pahalgam attack exposed as victims are alive and well. This married couple was reported to be killed in the Pahalgam attack by Indian media and social media, but as the entire episode was a false flag, things are getting exposed. Shame on RAW and India. https://t.co/Lz6tpQPlba",
      "cleaned_text": "indian drama about the pahalgam attack exposed as victims are alive and well this married couple was reported to be killed in the pahalgam attack by indian media and social media but as the entire episode was a false flag things are getting exposed shame on raw and india ",
      "favorite_count": 250,
      "retweet_count": 99,
      "reply_count": 31,
      "sentiment": "negative",
      "sentiment_score": -0.7701765298843384,
      "original_lang": "en"
    },
    {
      "id": "1915475739119399128",
      "text": "SHOCKING NEWS 🚨 The area of ​​Pahalgam where the terrorist attack took place was opened on 20 April by some local tour operator without informing the Center and security agencies.\n\nIt was opened just 2 days before the attack🤯\n\nWho stabbed us in the back?😳 https://t.co/M7TYMTI3Yv",
      "cleaned_text": "shocking news the area of pahalgam where the terrorist attack took place was opened on 20 april by some local tour operator without informing the center and security agencies it was opened just 2 days before the attack who stabbed us in the back ",
      "favorite_count": 775,
      "retweet_count": 239,
      "reply_count": 15,
      "sentiment": "negative",
      "sentiment_score": -0.873167872428894,
      "original_lang": "en"
    },
    {
      "id": "1915098714458169744",
      "text": "The barbaric attack in Pahalgam has stolen the lives of newlyweds, children, and families simply seeking joy.\n\nOur hearts break for them.\n\nTo those mourning - know that the UK stands with you in sorrow and solidarity.\n\nTerror will never win. We grieve with India.",
      "cleaned_text": "the barbaric attack in pahalgam has stolen the lives of newlyweds children and families simply seeking joy our hearts break for them to those mourning know that the uk stands with you in sorrow and solidarity terror will never win we grieve with india ",
      "favorite_count": 56722,
      "retweet_count": 6031,
      "reply_count": 648,
      "sentiment": "negative",
      "sentiment_score": -0.9178697466850281,
      "original_lang": "en"
    },
    {
      "id": "1915002243306185016",
      "text": "SHOCKING NEWS 🚨  2 Muslims Wasim Khan and Tanveer Qureshi arrested from Madhya Pradesh for social media posts.\n\nThey had posted in favour of Pahalgam terrorists 😱\n\nMeanwhile, Sketch of Islamic terrorists involved in Pahalgam attack released.\n\nTheir photos also released.\n\nMeeting chaired by Defence Minister Rajnath Singh with NSA Ajit Doval and Armed Forces Chiefs lasted for 2.5 hours for future course of ACTION.",
      "cleaned_text": "shocking news 2 muslims wasim khan and tanveer qureshi arrested from madhya pradesh for social media posts they had posted in favour of pahalgam terrorists meanwhile sketch of islamic terrorists involved in pahalgam attack released their photos also released meeting chaired by defence minister rajnath singh with nsa ajit doval and armed forces chiefs lasted for 2 5 hours for future course of action ",
      "favorite_count": 21490,
      "retweet_count": 4436,
      "reply_count": 409,
      "sentiment": "negative",
      "sentiment_score": -0.27579569816589355,
      "original_lang": "en"
    },
    {
      "id": "1915307690571817323",
      "text": "Once again, the Attari-Wagah border bears witness to heartbreaking human stories. After the Pahalgam attack, gates remain closed—leaving Seema from Kanpur, visa in hand, stranded. She’s desperate to reach Karachi and care for her gravely ill sister. https://t.co/btcjSr0zdd",
      "cleaned_text": "once again the attari wagah border bears witness to heartbreaking human stories after the pahalgam attack gates remain closed leaving seema from kanpur visa in hand stranded she s desperate to reach karachi and care for her gravely ill sister ",
      "favorite_count": 1479,
      "retweet_count": 193,
      "reply_count": 1002,
      "sentiment": "negative",
      "sentiment_score": -0.8517985939979553,
      "original_lang": "en"
    },
    {
      "id": "1914922338875056421",
      "text": "Kashmiri Journalist gave Godi anchor Chitra Tripathi a lesson over the terror attack in Pahalgam.\n#PahalgamTerrorAttack https://t.co/thAwV1SRbH",
      "cleaned_text": "kashmiri journalist gave godi anchor chitra tripathi a lesson over the terror attack in pahalgam ",
      "favorite_count": 3582,
      "retweet_count": 959,
      "reply_count": 80,
      "sentiment": "negative",
      "sentiment_score": -0.11024290323257446,
      "original_lang": "en"
    },
    {
      "id": "1914947346099789943",
      "text": "🚨 THEY. WERE. MASSACRED. BECAUSE. THEY. WERE. HINDUS.\n\nDo not let the media or political elites sanitize what just happened in Pahalgam, Kashmir. This was not a \"tourist attack.\" \n\nIt was a religious cleansing—a ritualistic slaughter committed by Islamic terrorists who asked the victims to prove their religion before executing them.\n\n🔻 Survivors recount:\n\nStripped to check for circumcision.\n\nOrdered to recite Islamic prayers.\n\nMuslims were spared.\n\nHindus were slaughtered on the spot—men, women, honeymooners, human beings—gunned down simply for being born Hindu.\n\n(Listen to the survivor - not the media who hides these truths)\n\n🩸 This is not new. This is a pattern:\n\nWestgate Mall, Kenya: Muslims spared, non-Muslims shot.\n\nMandera Bus, Kenya: Recite the Shahada or die.\n\nPahalgam, India: Strip or recite—or be executed.\n\nSt. Cloud, Minnesota: “Are you Muslim?”—stabbed if the answer was no.\n\nLiège, Belgium: Hostages released after confirming they were Muslim.\n\nThe list goes on....\n\nThis is selective slaughter rooted in ideology, not poverty. Not mental health. Not “grievances.”\n\n🧨 These terrorists aren’t hiding their intent. They follow a doctrine that demands supremacy and the erasure of all who don’t submit.\n\nAnd the media covers it up, calls it “sectarian tension,” “militancy,” or “anti-tourism.” No. This was jihad.\n\n🇺🇸 How long until they hit America again?\n\nHow long until it’s a church, a bus, a school—and they ask: “Are you Christian? Are you Jewish? Are you Hindu?”\n\n🛑 WAKE UP.\n\nEvery time we ignore this pattern, we embolden it.\nEvery time we downplay it, we prepare our own graves.",
      "cleaned_text": " they were massacred because they were hindus do not let the media or political elites sanitize what just happened in pahalgam kashmir this was not a tourist attack it was a religious cleansing a ritualistic slaughter committed by islamic terrorists who asked the victims to prove their religion before executing them survivors recount stripped to check for circumcision ordered to recite islamic prayers muslims were spared hindus were slaughtered on the spot men women honeymooners human beings gunned down simply for being born hindu listen to the survivor not the media who hides these truths this is not new this is a pattern westgate mall kenya muslims spared non muslims shot mandera bus kenya recite the shahada or die pahalgam india strip or recite or be executed st cloud minnesota are you muslim stabbed if the answer was no liège belgium hostages released after confirming they were muslim the list goes on this is selective slaughter rooted in ideology not poverty not mental health not grievances these terrorists aren t hiding their intent they follow a doctrine that demands supremacy and the erasure of all who don t submit and the media covers it up calls it sectarian tension militancy or anti tourism no this was jihad how long until they hit america again how long until it s a church a bus a school and they ask are you christian are you jewish are you hindu wake up every time we ignore this pattern we embolden it every time we downplay it we prepare our own graves ",
      "favorite_count": 4482,
      "retweet_count": 2279,
      "reply_count": 155,
      "sentiment": "negative",
      "sentiment_score": -0.8172910809516907,
      "original_lang": "en"
    }
  ]
}