{
  "metadata": {
    "search_query": "USA Tariff",
    "timestamp": "2025-04-22_19-32-16",
    "total_tweets": 157,
    "language_stats": [
      {
        "language": "English",
        "code": "en",
        "count": 144,
        "percentage": 91.7
      },
      {
        "language": "Hindi",
        "code": "hi",
        "count": 4,
        "percentage": 2.5
      }
    ]
  },
  "tweets": [
    {
      "id": "1914672569434747177",
      "text": "USA China tariff deal.\n\nInterest Rate cuts.\n\nQuantitative easing. \n\nMoney Printing. \n\nBull run 2025- Early 2026. \n\nMy bag are ready pump it 🚀 https://t.co/80RpGIXJGi",
      "cleaned_text": "usa china tariff deal interest rate cuts quantitative easing money printing bull run 2025 early 2026 my bag are ready pump it ",
      "favorite_count": 2,
      "retweet_count": 2,
      "reply_count": 1,
      "sentiment": "positive",
      "sentiment_score": 0.1741982400417328,
      "original_lang": "en"
    },
    {
      "id": "1914667221487640866",
      "text": "Could Trump tariffs push US tech giants like Intel and Oracle to leave Malaysia?\n\n#TZA #MITI #ThisIsWhereGlobalStarts #MADANIIsWorking #tariff #usa #trump https://t.co/XqsLsXmOZ6",
      "cleaned_text": "could trump tariffs push us tech giants like intel and oracle to leave malaysia ",
      "favorite_count": 8,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.4840514659881592,
      "original_lang": "en"
    },
    {
      "id": "1914666526562803927",
      "text": "@TrumpRealDaily LET china FIGHT THE USA TARIFF THEN WHEN THE WORLD REALISES THAT THEY WANT FAIR TRADE THEN THEY WILL FOLLOW USA FAIR TRADE. THE chinese WILL LOSE, ALL THE RICH AND POOR WILL BAND TOGETHER TO  ELIMINATE THE COMMUNIST GOVERNMENT",
      "cleaned_text": " let china fight the usa tariff then when the world realises that they want fair trade then they will follow usa fair trade the chinese will lose all the rich and poor will band together to eliminate the communist government",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.6497581601142883,
      "original_lang": "en"
    },
    {
      "id": "1914666326439944675",
      "text": "@elonmuskADO LET china FIGHT THE USA TARIFF THEN WHEN THE WORLD REALISES THAT THEY WANT FAIR TRADE THEN THEY WILL FOLLOW USA FAIR TRADE. THE chinese WILL LOSE, ALL THE RICH AND POOR WILL BAND TOGETHER TO  ELIMINATE THE COMMUNIST GOVERNMENT",
      "cleaned_text": " let china fight the usa tariff then when the world realises that they want fair trade then they will follow usa fair trade the chinese will lose all the rich and poor will band together to eliminate the communist government",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.6497581601142883,
      "original_lang": "en"
    },
    {
      "id": "1914665772523147628",
      "text": "Trump says tariff revenue could replace income taxes. Why economists disagree. https://t.co/jxhv2NqmbU",
      "cleaned_text": "trump says tariff revenue could replace income taxes why economists disagree ",
      "favorite_count": 5,
      "retweet_count": 5,
      "reply_count": 4,
      "sentiment": "negative",
      "sentiment_score": -0.2364354431629181,
      "original_lang": "en"
    },
    {
      "id": "1914663377600737399",
      "text": "USA China tariff deal.\n\nRate cuts and QE \n\nFED Money Printing \n\nMega Bull run in 2025\n\nMy bags are loaded.",
      "cleaned_text": "usa china tariff deal rate cuts and qe fed money printing mega bull run in 2025 my bags are loaded ",
      "favorite_count": 1333,
      "retweet_count": 143,
      "reply_count": 152,
      "sentiment": "neutral",
      "sentiment_score": -0.010584473609924316,
      "original_lang": "en"
    },
    {
      "id": "1914663000272744809",
      "text": "USA China tariff deal.\n\nInterest Rate cuts.\n\nQuantitative easing. \n\nMoney Printing. \n\nBull run 2025- Early 2026. \n\nMy bags are ready.",
      "cleaned_text": "usa china tariff deal interest rate cuts quantitative easing money printing bull run 2025 early 2026 my bags are ready ",
      "favorite_count": 148,
      "retweet_count": 23,
      "reply_count": 19,
      "sentiment": "positive",
      "sentiment_score": 0.1946788728237152,
      "original_lang": "en"
    },
    {
      "id": "1914662356199616879",
      "text": "JUST IN: Oil prices rose Tuesday after Monday’s drop, with Brent at $67.01 and WTI at $63.25. Gains were capped by U.S.-Iran nuclear talks and OPEC+ output hikes, which may boost supply. Tariff tensions and weak demand still weigh on market sentiment.\n\n#TrumpTarrifs #USA #Brent",
      "cleaned_text": "just in oil prices rose tuesday after monday s drop with brent at 67 01 and wti at 63 25 gains were capped by u s iran nuclear talks and opec output hikes which may boost supply tariff tensions and weak demand still weigh on market sentiment ",
      "favorite_count": 3,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": 0.005605220794677734,
      "original_lang": "en"
    },
    {
      "id": "1914658022439158077",
      "text": "Discover the Hidden Gem🇺🇸: \nWorksport´s Q1 growth showcases the power of American-made products.\n\n📈 Q1 dealer growth: +64%\n⬆️ March sales: +70% MoM\n 🇺🇸 The AL4:  built in the USA with 90%+ U.S. materials\n\nTariff-proof.  Dealer-approved.\n Undervalued.🚀 Growing fast.\n\nThis is just the beginning…\n\nLear more: https://t.co/eV6oY3aDRh\n\n#StockMarket #StockMarketNews #StocksToWatch #tarrifs #USA #americaninnovation #Growth $nasdaq $wksp #madeintheusatoseetheusa #Economics #investors",
      "cleaned_text": "discover the hidden gem worksport s q1 growth showcases the power of american made products q1 dealer growth 64 march sales 70 mom the al4 built in the usa with 90 u s materials tariff proof dealer approved undervalued growing fast this is just the beginning lear more nasdaq wksp ",
      "favorite_count": 4,
      "retweet_count": 2,
      "reply_count": 2,
      "sentiment": "positive",
      "sentiment_score": 0.387114018201828,
      "original_lang": "en"
    },
    {
      "id": "1914655467273417017",
      "text": "USA China Tariff Deal.\n\nRate Cuts.\n\nQuantitive Easing. \n\nBull Run in 2025/2026. My Bags Are Ready.",
      "cleaned_text": "usa china tariff deal rate cuts quantitive easing bull run in 2025 2026 my bags are ready ",
      "favorite_count": 13,
      "retweet_count": 10,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.2599668502807617,
      "original_lang": "en"
    },
    {
      "id": "1914654000114205140",
      "text": "@EricLDaugh Trump tariff policy seems to be working on getting companies to invest in USA. Non computer engineering students and trade and technical students will have renaissance.",
      "cleaned_text": " trump tariff policy seems to be working on getting companies to invest in usa non computer engineering students and trade and technical students will have renaissance ",
      "favorite_count": 3,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.5712100863456726,
      "original_lang": "en"
    },
    {
      "id": "1914651693335118104",
      "text": "The USA has just put a 352.1% Tariff on Solar Panels.\n\nDonald Trump is owned by Fossil Fuel and he wants you to keep being ripped off.",
      "cleaned_text": "the usa has just put a 352 1 tariff on solar panels donald trump is owned by fossil fuel and he wants you to keep being ripped off ",
      "favorite_count": 175,
      "retweet_count": 62,
      "reply_count": 4,
      "sentiment": "negative",
      "sentiment_score": -0.8377582430839539,
      "original_lang": "en"
    },
    {
      "id": "1914641892903469253",
      "text": "USA China tariff deal.\n\nRate cuts.\n\nQuantitive easing. \n\nBull run in 2025/2026. My bags are ready.",
      "cleaned_text": "usa china tariff deal rate cuts quantitive easing bull run in 2025 2026 my bags are ready ",
      "favorite_count": 393,
      "retweet_count": 51,
      "reply_count": 38,
      "sentiment": "positive",
      "sentiment_score": 0.2599668502807617,
      "original_lang": "en"
    },
    {
      "id": "1914637127217811759",
      "text": "The Vice President of the USA lands in India — with the entire family, kids included. 🛬🇮🇳🇺🇸\n\nAt a time when the US-China tariff war is heating up... 🔥\n\nWhy now?\n\nWhy with family?\n\nIs this diplomacy — or a deeper signal?\n\nAnd how is PM Modi turning this into a strategic win?\n\nSo many questions. 👀\n\n#USIndia #Geopolitics #ModiDiplomacy #JDVanceInIndia",
      "cleaned_text": "the vice president of the usa lands in india with the entire family kids included at a time when the us china tariff war is heating up why now why with family is this diplomacy or a deeper signal and how is pm modi turning this into a strategic win so many questions ",
      "favorite_count": 6,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.22311268746852875,
      "original_lang": "en"
    },
    {
      "id": "1914598335853306286",
      "text": "World : Donald Trump के विरोध में पूरे America में प्रदर्शन ? Tariff | USA |\n\nमहज कुछ ही महीने हुए हैं Donald Trump को दोबारा सत्ता में आए, लेकिन जनता सड़कों पर उतर आई है । 50 राज्यों में 1200 से ज्यादा लोगों ने Trump की नीतियों के खिलाफ प्रदर्शन किया । विरोध कर रही भीड़ ने Trump को ही निशाना नहीं बनाया, बल्कि उनके करीबी सहयोगी और कारोबारी Elon Musk के खिलाफ भी नारेबाजी की । देखिये ये खास रिपोर्ट  \n\n#usa #donaldtrump #america #ustariffs #elonmusk #internationalpolitics",
      "cleaned_text": "world donald trump क व र ध म प र america म प रदर शन tariff usa महज क छ ह मह न ह ए ह donald trump क द ब र सत त म आए ल क न जनत सड क पर उतर आई ह 50 र ज य म 1200 स ज य द ल ग न trump क न त य क ख ल फ प रदर शन क य व र ध कर रह भ ड न trump क ह न श न नह बन य बल क उनक कर ब सहय ग और क र ब र elon musk क ख ल फ भ न र ब ज क द ख य य ख स र प र ट ",
      "favorite_count": 2,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": -0.007512778043746948,
      "original_lang": "hi"
    },
    {
      "id": "1914597547357954442",
      "text": "#MediaFocus According to an article on the USA Today website, four economists and academicians were invited to predict what the trend of #US #tariff policy may look like in 2028. The experts believe that #Trump's tariff policy is uncertain and complex, and it is difficult to judge moving forward. Moreover, it is highly likely to have a negative impact on the US and global #economy.",
      "cleaned_text": " according to an article on the usa today website four economists and academicians were invited to predict what the trend of policy may look like in 2028 the experts believe that s tariff policy is uncertain and complex and it is difficult to judge moving forward moreover it is highly likely to have a negative impact on the us and global ",
      "favorite_count": 4,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.7921704649925232,
      "original_lang": "en"
    },
    {
      "id": "1914597371901817323",
      "text": "@TrumpRealDaily All of you want a higher tariff on China. Businessmen also want to finance their factories in the USA. But the Americans do not want to work in the factories! You need to address this issue first.",
      "cleaned_text": " all of you want a higher tariff on china businessmen also want to finance their factories in the usa but the americans do not want to work in the factories you need to address this issue first ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.7021245360374451,
      "original_lang": "en"
    },
    {
      "id": "1914578562729771047",
      "text": "@TrumpRealDaily No. Congress trying to manage tariff's is like the dog walking the people, not the people walking the dog. Congress is supposed to be dealing with the laws of the land, not digging themselves new swamp to steal more money from the USA!",
      "cleaned_text": " no congress trying to manage tariff s is like the dog walking the people not the people walking the dog congress is supposed to be dealing with the laws of the land not digging themselves new swamp to steal more money from the usa ",
      "favorite_count": 7,
      "retweet_count": 0,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.7438158392906189,
      "original_lang": "en"
    },
    {
      "id": "1914559203613593971",
      "text": "After USA, now India jumps on China Tariffs🔥\n\nBharat to impose 12% temporary tariff on steel to curb cheap China imports. https://t.co/XHTzcmcsnT",
      "cleaned_text": "after usa now india jumps on china tariffs bharat to impose 12 temporary tariff on steel to curb cheap china imports ",
      "favorite_count": 1478,
      "retweet_count": 206,
      "reply_count": 11,
      "sentiment": "negative",
      "sentiment_score": -0.21942462027072906,
      "original_lang": "en"
    },
    {
      "id": "1914553985182150699",
      "text": "@SethAbramson 📯🚨 In 1926\nThe Fordney-McCumber Tariff, Enacted in 1922, Triggered A \"Tariff War\" As Other Countries Retaliated Against the USA\nBy Raising Their OWN Tariffs, Ultimately Hindering International Trade &amp; Contributing TO;\n\"THE GREAT DEPRESSION !\n\nTake a Closer LOOK\nAt THE WORDS  🧐 https://t.co/nRCdZ9gm2h",
      "cleaned_text": " in 1926 the fordney mccumber tariff enacted in 1922 triggered a tariff war as other countries retaliated against the usa by raising their own tariffs ultimately hindering international trade amp contributing to the great depression take a closer look at the words ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.6434551477432251,
      "original_lang": "en"
    },
    {
      "id": "1914550591323562156",
      "text": "@spectatorindex I think Malaysia should be more closer in trade to China compare to USA. \n\nThe China policy is more stable compare to USA. They keep on change their tariff etc without think about the others. \n\n@chedetofficial is right. We need to look more to East compare to the West now.",
      "cleaned_text": " i think malaysia should be more closer in trade to china compare to usa the china policy is more stable compare to usa they keep on change their tariff etc without think about the others is right we need to look more to east compare to the west now ",
      "favorite_count": 8,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.13868287205696106,
      "original_lang": "en"
    },
    {
      "id": "1914536807749787995",
      "text": "China’s CRAZY luxury branding strategy - China is now Exposing the True Pricing of Luxury Brands to the world after Tariff War with USA - Birkin Bag that sells for a Whopping 32 lakhs Actually costs Only Rs 1 lakh and is Made in China!! 🤯😯 https://t.co/OBL3f8OOt0",
      "cleaned_text": "china s crazy luxury branding strategy china is now exposing the true pricing of luxury brands to the world after tariff war with usa birkin bag that sells for a whopping 32 lakhs actually costs only rs 1 lakh and is made in china ",
      "favorite_count": 135,
      "retweet_count": 42,
      "reply_count": 11,
      "sentiment": "negative",
      "sentiment_score": -0.5342693328857422,
      "original_lang": "en"
    },
    {
      "id": "1914492470722764952",
      "text": "@WhiteHouse @PlantServices @Bayer Why WAS Elon Musk going to build this factory in Mexico instead of USA?\nJuly 2024:\nTesla has paused plans to build a NEW GIGAFACTORY IN MEXICO until after the election in November, as Donald Trump pledged to impose a 100% tariff on vehicles made in Mexico.\nhttps://t.co/zERkvdzIOO",
      "cleaned_text": " why was elon musk going to build this factory in mexico instead of usa july 2024 tesla has paused plans to build a new gigafactory in mexico until after the election in november as donald trump pledged to impose a 100 tariff on vehicles made in mexico ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.5263842344284058,
      "original_lang": "en"
    },
    {
      "id": "1914491981331620153",
      "text": "Shawn Fain just endorsed the Trump tariff policy that is demolishing the world economy and his reward is a presidential endorsement from Jacobin magazine",
      "cleaned_text": "shawn fain just endorsed the trump tariff policy that is demolishing the world economy and his reward is a presidential endorsement from jacobin magazine",
      "favorite_count": 117,
      "retweet_count": 13,
      "reply_count": 6,
      "sentiment": "negative",
      "sentiment_score": -0.7664283514022827,
      "original_lang": "en"
    },
    {
      "id": "1914487387520114766",
      "text": "Swedish commercial vehicle maker Volvo Group will cut up to 800 jobs at three US sites due to the impact of Trump's tariffs.\n\nVolvo will review its production system as the future of the market becomes uncertain due to the reciprocal tariff hike.\n\nhttps://t.co/QMnbmkOZ8O\n#EU #USA",
      "cleaned_text": "swedish commercial vehicle maker volvo group will cut up to 800 jobs at three us sites due to the impact of trump s tariffs volvo will review its production system as the future of the market becomes uncertain due to the reciprocal tariff hike ",
      "favorite_count": 2,
      "retweet_count": 3,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": 0.049574822187423706,
      "original_lang": "en"
    },
    {
      "id": "1914483907778764842",
      "text": "Tariff war between USA and China simplified. https://t.co/GWga29I1z6",
      "cleaned_text": "tariff war between usa and china simplified ",
      "favorite_count": 11,
      "retweet_count": 2,
      "reply_count": 6,
      "sentiment": "negative",
      "sentiment_score": -0.1434234380722046,
      "original_lang": "en"
    },
    {
      "id": "1914475928056697187",
      "text": "I just talked to a long time friend in China and asked him how’s the tariff war affecting his business.  He mostly export outdoor camping gears to the U.S.  this is what he said:  there are impacts to our business; but U.S is the one started the trade war, at this point, we 100% support our government’s retaliatory actions against the U.S. \n\nWell… I’m surprised and not surprised. \nSurprised he still supports Chinese government fight the trade war even this means he will not have a business anymore; \nNot surprised he’s supporting Chinese government, as that’s majority of Chinese people do.",
      "cleaned_text": "i just talked to a long time friend in china and asked him how s the tariff war affecting his business he mostly export outdoor camping gears to the u s this is what he said there are impacts to our business but u s is the one started the trade war at this point we 100 support our government s retaliatory actions against the u s well i m surprised and not surprised surprised he still supports chinese government fight the trade war even this means he will not have a business anymore not surprised he s supporting chinese government as that s majority of chinese people do ",
      "favorite_count": 53,
      "retweet_count": 3,
      "reply_count": 23,
      "sentiment": "negative",
      "sentiment_score": -0.2861049473285675,
      "original_lang": "en"
    },
    {
      "id": "1914451954270646305",
      "text": "@CoraCHarrington There are people in the USA that still think the exporter pays the tariff. We are so cooked as a country.",
      "cleaned_text": " there are people in the usa that still think the exporter pays the tariff we are so cooked as a country ",
      "favorite_count": 397,
      "retweet_count": 7,
      "reply_count": 5,
      "sentiment": "negative",
      "sentiment_score": -0.880442202091217,
      "original_lang": "en"
    },
    {
      "id": "1914450915513581670",
      "text": "@CTVNews Crises? Trump has rolled back almost every tariff except what Liberals already do back to the USA for the last decade.\n\nCarney milking the gravy train, OUR TAX DOLLARS!\n\nCarney = Tax Theif",
      "cleaned_text": " crises trump has rolled back almost every tariff except what liberals already do back to the usa for the last decade carney milking the gravy train our tax dollars carney tax theif",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.7642923593521118,
      "original_lang": "en"
    },
    {
      "id": "1914441360956072007",
      "text": "@CTVNews Which crisis? \n\nHousing crisis\nHealthcare crisis\nFentanyl crisis\nAffordability crisis\nImmigration crisis\nMilitary crisis\nTrade crisis\nNational unity crisis\nTariff crisis China &amp; USA\n\nAll caused by the liberal party.",
      "cleaned_text": " which crisis housing crisis healthcare crisis fentanyl crisis affordability crisis immigration crisis military crisis trade crisis national unity crisis tariff crisis china amp usa all caused by the liberal party ",
      "favorite_count": 7,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.7319000363349915,
      "original_lang": "en"
    },
    {
      "id": "1914438318521045272",
      "text": "@epaleezeldin I agree 100% but can you please speak to President Trump, whom I voted for 3X and donated weekly to his campaign to stop lighting trillions of our hard earned money into flames through trade policies and tariff wars that cannot possibly be won. The only clear loser is the USA. 😞",
      "cleaned_text": " i agree 100 but can you please speak to president trump whom i voted for 3x and donated weekly to his campaign to stop lighting trillions of our hard earned money into flames through trade policies and tariff wars that cannot possibly be won the only clear loser is the usa ",
      "favorite_count": 5,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.8390171527862549,
      "original_lang": "en"
    },
    {
      "id": "1914434908874768655",
      "text": "If you care about tariff effects on our industry, this is a good article",
      "cleaned_text": "if you care about tariff effects on our industry this is a good article",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.5834272503852844,
      "original_lang": "en"
    },
    {
      "id": "1914420792877834558",
      "text": "Make America Great Again 🤡 2030 in USA 🇺🇸 \n#Tariff #AI #TrumpTariffs #MAGA #UnitedStates https://t.co/x8gUzUeKZ0",
      "cleaned_text": "make america great again 2030 in usa ",
      "favorite_count": 7,
      "retweet_count": 3,
      "reply_count": 2,
      "sentiment": "positive",
      "sentiment_score": 0.4778754413127899,
      "original_lang": "en"
    },
    {
      "id": "1914415847814390108",
      "text": "@newlyin2crypto @DisrespectedThe She is correct.   I have 3 containers in China that were suppose to sail 2 weeks ago.  They can't ship at 170% tariff so are stuck in China.  So, the ports and truckers won't be moving them in the USA.  25% tariff from 6 years ago put on by Trump +20% Fentanyl +  125% = 170%",
      "cleaned_text": " she is correct i have 3 containers in china that were suppose to sail 2 weeks ago they can t ship at 170 tariff so are stuck in china so the ports and truckers won t be moving them in the usa 25 tariff from 6 years ago put on by trump 20 fentanyl 125 170 ",
      "favorite_count": 10,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.5203449130058289,
      "original_lang": "en"
    },
    {
      "id": "1914414390323109946",
      "text": "No one took that literally(24 hours), that was USA election campaign hyperbole, directed at Americans...of course you heard about it because Trump doesn't care who is listening. As to the trade and tariff situation, the results are not yet known. Trump is trying to dismantle the Marshall Plan...which has gone on for far too long.",
      "cleaned_text": "no one took that literally 24 hours that was usa election campaign hyperbole directed at americans of course you heard about it because trump doesn t care who is listening as to the trade and tariff situation the results are not yet known trump is trying to dismantle the marshall plan which has gone on for far too long ",
      "favorite_count": 4,
      "retweet_count": 2,
      "reply_count": 3,
      "sentiment": "negative",
      "sentiment_score": -0.8370814323425293,
      "original_lang": "en"
    },
    {
      "id": "1914399105507582009",
      "text": "@RayDalio I think enlightened people in #USA would agree with me in advising Pr. #Trump to freeze implementation of the #tariff increases for now, while the @USSupremeCourt considers the constitutionality of these measures.\n@federalreserve @POTUS #USDebt #BREAKING @WSJ #GoldPrice @RayDalio https://t.co/oBcm3mH2jj",
      "cleaned_text": " i think enlightened people in would agree with me in advising pr to freeze implementation of the increases for now while the considers the constitutionality of these measures ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.051791638135910034,
      "original_lang": "en"
    },
    {
      "id": "1914382767217053986",
      "text": "Let’s get these shifted so we can collaborate on our next design before the Tariff monster comes back 😂\n\nhttps://t.co/zSVkbmgvLT https://t.co/nKSqBIBMRf",
      "cleaned_text": "let s get these shifted so we can collaborate on our next design before the tariff monster comes back ",
      "favorite_count": 5,
      "retweet_count": 2,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.07126469910144806,
      "original_lang": "en"
    },
    {
      "id": "1914357067634139582",
      "text": "@Jamhoora1 USA China tariff’s explained in less then 2 minutes. You decide who screwed up! https://t.co/A4VmX73195",
      "cleaned_text": " usa china tariff s explained in less then 2 minutes you decide who screwed up ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.6860383749008179,
      "original_lang": "en"
    },
    {
      "id": "1914349948637950071",
      "text": "🚨🚨🚨🚨\n\nFirst Made in USA product after Trump's tariff war.\n\nThanks #MAGA\n#Nasdaq\n#PapaFrancesco\n#TSLA\n#TariffWAR https://t.co/yoFuNzGReK",
      "cleaned_text": " first made in usa product after trump s tariff war thanks ",
      "favorite_count": 4,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.16405640542507172,
      "original_lang": "en"
    },
    {
      "id": "1914327397408608621",
      "text": "$TSLA Strong Sell ahead of tomorrow AH report. Lost China losing Europe losing USA share EV subsidies ending tariff impact recall and reorg charges and fascist salute and DOGE layoffs brand destruction. Fair value $150 below.",
      "cleaned_text": " tsla strong sell ahead of tomorrow ah report lost china losing europe losing usa share ev subsidies ending tariff impact recall and reorg charges and fascist salute and doge layoffs brand destruction fair value 150 below ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.6759828329086304,
      "original_lang": "en"
    },
    {
      "id": "1914327115140325610",
      "text": "Trump Tariff Layoffs: \n\n- **Stellantis**: 900 laid off, April 3, 2025\n- **Mack Trucks**: 250–350 laid off, April 18, 2025\n- **Cleveland-Cliffs**: 1,830 laid off, April 2025\n- **John Deere**: 9 laid off, April 2025\n- **Summit Interconnect**: 74 laid off, April 2025\n- **Bando USA Inc.**: 65 laid off, April 2025\n- **Wilson Creek Energy LLC**: 425 laid off, April 2025\n- **Advanced Drainage Systems**: 54 laid off, April 2025\n- **Sensata Technologies**: 57 laid off, April 2025\n- **Volvo Cars**: Up to 800 laid off, April 18, 2025\n\nDouble confirmed by @GroqInc and @GeminiApp",
      "cleaned_text": "trump tariff layoffs stellantis 900 laid off april 3 2025 mack trucks 250 350 laid off april 18 2025 cleveland cliffs 1 830 laid off april 2025 john deere 9 laid off april 2025 summit interconnect 74 laid off april 2025 bando usa inc 65 laid off april 2025 wilson creek energy llc 425 laid off april 2025 advanced drainage systems 54 laid off april 2025 sensata technologies 57 laid off april 2025 volvo cars up to 800 laid off april 18 2025 double confirmed by and ",
      "favorite_count": 1997,
      "retweet_count": 257,
      "reply_count": 28,
      "sentiment": "neutral",
      "sentiment_score": 0.04699781537055969,
      "original_lang": "en"
    },
    {
      "id": "1914310367158616104",
      "text": "🇺🇸 is winning hugely. \n\nEquity market pricing is all paper. It is all supply and demand of liquidity. Fed is being political and squeezing liquidity and creating panic. Underlying businesses are strong. Lots of opportunities for investment in USA with current tariff policies. Trillions being invested. \n\nAs long as 💵 stays the 🌎 reserve currency, the equity markets will recover. At some point, if 🇺🇸 companies are making big $$$, the stock values will be priced appropriately. \n\nTrump is kicking ass on economy right now with this sentiment. People say 🇺🇸 is losing allies. Just not true. They are using 💵s more than ever. They are mad 🇺🇸 is no longer piggy bank.",
      "cleaned_text": " is winning hugely equity market pricing is all paper it is all supply and demand of liquidity fed is being political and squeezing liquidity and creating panic underlying businesses are strong lots of opportunities for investment in usa with current tariff policies trillions being invested as long as stays the reserve currency the equity markets will recover at some point if companies are making big the stock values will be priced appropriately trump is kicking ass on economy right now with this sentiment people say is losing allies just not true they are using s more than ever they are mad is no longer piggy bank ",
      "favorite_count": 11,
      "retweet_count": 1,
      "reply_count": 5,
      "sentiment": "negative",
      "sentiment_score": -0.39959728717803955,
      "original_lang": "en"
    },
    {
      "id": "1914303164464890298",
      "text": "In case you missed it...\n\n🤔 Why the Fed needs to save USA now https://t.co/PyfKBZErnB\n\n🥊 BTC finally breaks out of $85,000 https://t.co/hGAItwEQmu\n\n💻 Will Alphabet's share price collapse deepen amid tariff shock and tech slowdown? https://t.co/zMGU8EEgge\n\n#Forex #Crypto #Stock https://t.co/KMWvLMKEOp",
      "cleaned_text": "in case you missed it why the fed needs to save usa now btc finally breaks out of 85 000 will alphabet s share price collapse deepen amid tariff shock and tech slowdown ",
      "favorite_count": 5,
      "retweet_count": 2,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.2978367805480957,
      "original_lang": "en"
    },
    {
      "id": "1914291532854886681",
      "text": "China is shifting focus to boost domestic consumption — including a USD27B pledge from https://t.co/B0Wbpzz2o0 to buy local. What does this mean for regional exporters like Malaysia?\n\n#TZA #MITI #ThisIsWhereGlobalStarts #MADANIIsWorking #tariff #usa #trump #china https://t.co/7LyJo5Dl6W",
      "cleaned_text": "china is shifting focus to boost domestic consumption including a usd27b pledge from to buy local what does this mean for regional exporters like malaysia ",
      "favorite_count": 12,
      "retweet_count": 5,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.21047505736351013,
      "original_lang": "en"
    },
    {
      "id": "1914290253604565140",
      "text": "Come giustamente dice @adam_tooze il titolo non ha alcun senso. \nFra l'altro i primi ad introdurre pesantissimi dazi furono gli USA nel 1930 con lo Smoot-Hawley Tariff Act e il tema dei dazi fu fra i principali punti politici di ogni dibattito in UK per tutto il primo novecento.",
      "cleaned_text": "come giustamente dice il titolo non ha alcun senso fra l altro i primi ad introdurre pesantissimi dazi furono gli usa nel 1930 con lo smoot hawley tariff act e il tema dei dazi fu fra i principali punti politici di ogni dibattito in uk per tutto il primo novecento ",
      "favorite_count": 16,
      "retweet_count": 5,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.8653526306152344,
      "original_lang": NaN
    },
    {
      "id": "1914288525455069391",
      "text": "Americans Are Searching \"USA Products\" Like Never Before | ZeroHedge\n\nTariffs are designed to shift consumer demand toward domestically produced goods. As foreign products become increasingly expensive, driven by levies such as the Trump administration's 145% effective tariff rate on Chinese imports, consumers are starting to take notice.\n\nFaced with rising prices for foreign goods, some consumers have turned to the internet to determine which products are still made in the United States.\n\nGoogle Trends data shows \"What products are made in the USA?\" reached record highs by mid-April, with data going all the way back to 2004.\n\nWith an effective tariff rate of 145% on all Chinese goods, Beijing signaled on Wednesday that it is open to trade talks in the near term. In the tit-for-tat tariff war, China has imposed 125% duties on U.S. goods.\n\nIn recent weeks, President Trump has paused reciprocal tariffs for countries that chose not to retaliate following \"Liberation Day\" in early April. The White House announced this week that the administration is in talks with 75 countries to secure new trade deals. Trump held discussions with Japan overnight, calling the talks \"big progress.\"\n\nEven as trade deals are expected in the coming weeks and months, the broader objective of the tariff strategy is to reshore critical supply chains essential to national security and to position the United States for dominance in the 2030s. Early internet search trend signs suggest that the tariffs are already influencing consumer behavior - this is a great start.\n\nRead more:\n\nhttps://t.co/f2KGta8WLO",
      "cleaned_text": "americans are searching usa products like never before zerohedge tariffs are designed to shift consumer demand toward domestically produced goods as foreign products become increasingly expensive driven by levies such as the trump administration s 145 effective tariff rate on chinese imports consumers are starting to take notice faced with rising prices for foreign goods some consumers have turned to the internet to determine which products are still made in the united states google trends data shows what products are made in the usa reached record highs by mid april with data going all the way back to 2004 with an effective tariff rate of 145 on all chinese goods beijing signaled on wednesday that it is open to trade talks in the near term in the tit for tat tariff war china has imposed 125 duties on u s goods in recent weeks president trump has paused reciprocal tariffs for countries that chose not to retaliate following liberation day in early april the white house announced this week that the administration is in talks with 75 countries to secure new trade deals trump held discussions with japan overnight calling the talks big progress even as trade deals are expected in the coming weeks and months the broader objective of the tariff strategy is to reshore critical supply chains essential to national security and to position the united states for dominance in the 2030s early internet search trend signs suggest that the tariffs are already influencing consumer behavior this is a great start read more ",
      "favorite_count": 29,
      "retweet_count": 2,
      "reply_count": 3,
      "sentiment": "neutral",
      "sentiment_score": 0.008183583617210388,
      "original_lang": "en"
    },
    {
      "id": "1914280053182955870",
      "text": "@HealthRanger Tariffs are good for everyone else except USA. Don’t think so. Plus, Trump has already said we will just match Tariff rates of other countries. Everyone knows China steals everything and prevents imports. This must stop.",
      "cleaned_text": " tariffs are good for everyone else except usa don t think so plus trump has already said we will just match tariff rates of other countries everyone knows china steals everything and prevents imports this must stop ",
      "favorite_count": 11,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.6399847269058228,
      "original_lang": "en"
    },
    {
      "id": "1914271356780224526",
      "text": "#TradeWar USA Vs China 🔥\n\nChina Is In Economic Dire Straits And They're No Longer Able To Hide It\n \nTrump's tariff actions are widely criticized by the media as erratic or poorly planned, but what they don't understand is that uncertainty is the real leverage, not the tariffs. \n\nChinese shipments are on standby and orders are frozen.  Nothing is moving @zerohedge \n\nhttps://t.co/GVXOdXeobs",
      "cleaned_text": " usa vs china china is in economic dire straits and they re no longer able to hide it trump s tariff actions are widely criticized by the media as erratic or poorly planned but what they don t understand is that uncertainty is the real leverage not the tariffs chinese shipments are on standby and orders are frozen nothing is moving ",
      "favorite_count": 11,
      "retweet_count": 9,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.865997314453125,
      "original_lang": "en"
    },
    {
      "id": "1914261850872840698",
      "text": "What is different this time in tariff war? According to Chinese officials, the USA is using tariffs as a tool to force its allies to reduce imports from China. It warms countries not to appease the USA. \n\nhttps://t.co/xCJZbhjgbB",
      "cleaned_text": "what is different this time in tariff war according to chinese officials the usa is using tariffs as a tool to force its allies to reduce imports from china it warms countries not to appease the usa ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.7114948034286499,
      "original_lang": "en"
    },
    {
      "id": "1914261734677991575",
      "text": "Asia Stock Market Update : Monday's tale !\n\nKey negotiations with USA and economic data, Govt support in China and hopes of tariff clarity helped stabilize select sectors. \n\nMarket participants broadly watched for signals from Washington on trade, particularly in shipping, autos, and industrials.\n\nCHINA\nChinese markets climbed to 2-week highs, as Premier Li Qiang called for stronger efforts to prop the equity prices; prompting confidence in state-backed market support. \n\nGains were led by non-ferrous metals, which surged +4% as the U.S. dollar weakened and gold hit a record high. \n\nThe PBoC central bank, left key lending rates unchanged, with the 1-year LPR at 3.10% and the 5-year at 3.60%.\n\nJAPAN\nJapanese stocks declined amid a stronger yen, weighing on autos and machinery exporters. \n\nSuzuki Motor, Subaru, Komatsu, and Kubota each fell nearly -4%. \n\nIn another development, Ahresty announced the sale of its unprofitable Guangzhou subsidiary, which faced declining orders due to intensified EV competition from Chinese players.\n\nSOUTH KOREA \nSouth Korean equities inched higher, buoyed by gains in utilities, banking, & semiconductor shares; though the overall trade remained light ahead of tariff talks and earnings updates. \n\nKorea Electric Power rose +4.1% and Shinhan Financial Group added +2.2%. \n\nJeju Bank at one-point in intraday moves, dropped nearly -5% after announcing a ₩57 billion Won stock issuance, to fund its operations.",
      "cleaned_text": "asia stock market update monday s tale key negotiations with usa and economic data govt support in china and hopes of tariff clarity helped stabilize select sectors market participants broadly watched for signals from washington on trade particularly in shipping autos and industrials china chinese markets climbed to 2 week highs as premier li qiang called for stronger efforts to prop the equity prices prompting confidence in state backed market support gains were led by non ferrous metals which surged 4 as the u s dollar weakened and gold hit a record high the pboc central bank left key lending rates unchanged with the 1 year lpr at 3 10 and the 5 year at 3 60 japan japanese stocks declined amid a stronger yen weighing on autos and machinery exporters suzuki motor subaru komatsu and kubota each fell nearly 4 in another development ahresty announced the sale of its unprofitable guangzhou subsidiary which faced declining orders due to intensified ev competition from chinese players south korea south korean equities inched higher buoyed by gains in utilities banking semiconductor shares though the overall trade remained light ahead of tariff talks and earnings updates korea electric power rose 4 1 and shinhan financial group added 2 2 jeju bank at one point in intraday moves dropped nearly 5 after announcing a 57 billion won stock issuance to fund its operations ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.1999506950378418,
      "original_lang": "en"
    },
    {
      "id": "1914257929315684560",
      "text": "Zollstreit: US-Präsident Donald Trump imitiert Angela Merkel und fragt, wie viele Chevrolets es in München gibt. #USA #Zoll #Zölle #tariff #tariffs https://t.co/5KbbR4CBdn",
      "cleaned_text": "zollstreit us präsident donald trump imitiert angela merkel und fragt wie viele chevrolets es in münchen gibt ",
      "favorite_count": 8,
      "retweet_count": 2,
      "reply_count": 4,
      "sentiment": "negative",
      "sentiment_score": -0.1950993537902832,
      "original_lang": NaN
    },
    {
      "id": "1914238560833622095",
      "text": "Trump tariffs are simply based on trade surplus a country has with USA. India as $40B goods surplus. Any effort to export more as the tariff is more on China will increase surplus hence more tariff on India. India can't fool Trump. Indian trade deficit is going to get much worse.",
      "cleaned_text": "trump tariffs are simply based on trade surplus a country has with usa india as 40b goods surplus any effort to export more as the tariff is more on china will increase surplus hence more tariff on india india can t fool trump indian trade deficit is going to get much worse ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.7587759494781494,
      "original_lang": "en"
    },
    {
      "id": "1914236044666700099",
      "text": "14 Apr. JINF \"Speaking out\"\nIshiba Should Offer Trump Financial Cooperation\n\n・China taking a strong stance in the tariff war\n・Japan can buy and support U.S. Treasury bonds\n#USA #Trump #China #Tariff #JapanColumn\nhttps://t.co/Z7UAzZeKZl",
      "cleaned_text": "14 apr jinf speaking out ishiba should offer trump financial cooperation china taking a strong stance in the tariff war japan can buy and support u s treasury bonds ",
      "favorite_count": 6,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.11494214832782745,
      "original_lang": "en"
    },
    {
      "id": "1914220213869961308",
      "text": "Due to Trump's tariff policy, China has abandoned beef from the USA worth about $ 2 billion and is now sourcing it from Australia. \nAnd the USA tourist board is expecting a $90 billion drop in tourism this year. \nMake America Gone Again?\n\n#r4today #wato",
      "cleaned_text": "due to trump s tariff policy china has abandoned beef from the usa worth about 2 billion and is now sourcing it from australia and the usa tourist board is expecting a 90 billion drop in tourism this year make america gone again ",
      "favorite_count": 12,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.7899808287620544,
      "original_lang": "en"
    },
    {
      "id": "1914210168222761293",
      "text": "Bitcoin reacted positively to US President Trump’s social media post highlighting the crucial role of gold in global economic and political dynamics.\n\nChina said it would retaliate against nations cooperating with the USA’s tariff wars.\nhttps://t.co/iEZZELMTnG",
      "cleaned_text": "bitcoin reacted positively to us president trump s social media post highlighting the crucial role of gold in global economic and political dynamics china said it would retaliate against nations cooperating with the usa s tariff wars ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.2808515429496765,
      "original_lang": "en"
    },
    {
      "id": "1914205497302859958",
      "text": "The President of the USA was going to end the Ukrainian war on day one. Now it seems tariff wars are more important.",
      "cleaned_text": "the president of the usa was going to end the ukrainian war on day one now it seems tariff wars are more important ",
      "favorite_count": 27,
      "retweet_count": 7,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.6687746047973633,
      "original_lang": "en"
    },
    {
      "id": "1914194789769060434",
      "text": "@BigAlphaID In other words: dengan adanya ribut-ribut tariff ini, China ingin Indonesia menjadi negara yg \"lebih dekat\" ke China daripada ke USA.\n\nSupaya tujuan Trump yg ingin negara-negara yg di-tariff-i itu mendekat ke USA jadi tidak tercapai.",
      "cleaned_text": " in other words dengan adanya ribut ribut tariff ini china ingin indonesia menjadi negara yg lebih dekat ke china daripada ke usa supaya tujuan trump yg ingin negara negara yg di tariff i itu mendekat ke usa jadi tidak tercapai ",
      "favorite_count": 719,
      "retweet_count": 46,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.5387815237045288,
      "original_lang": NaN
    },
    {
      "id": "1914179620859220000",
      "text": "The good thing about #Trump's tariff hit is that it ended both #climatescam and deranged wokeness. The leftist media machine is having the hardest time keeping up with the pace in the White House, let alone setting their own destructive green rainbow agenda. #usa #eu #wef",
      "cleaned_text": "the good thing about s tariff hit is that it ended both and deranged wokeness the leftist media machine is having the hardest time keeping up with the pace in the white house let alone setting their own destructive green rainbow agenda ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.7887110710144043,
      "original_lang": "en"
    },
    {
      "id": "1914176263591514232",
      "text": "U.S. losing economic leverage to China; Jefferies suggest Investors should reduce positions in favour of Europe, China and India\n\nRead @ANI Story | \nhttps://t.co/vaaJ4cEg7A\n#Economy #Tariff #USA https://t.co/D6IyS9Psdt",
      "cleaned_text": "u s losing economic leverage to china jefferies suggest investors should reduce positions in favour of europe china and india read story ",
      "favorite_count": 63,
      "retweet_count": 8,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.7381967306137085,
      "original_lang": "en"
    },
    {
      "id": "1914150294914507113",
      "text": "China is threatening of reciprocal measures to countries making new deal with USA - If  China would lose their grounds.\n\nThis tariff saga brings new twist and turns everyday :) https://t.co/1ICa6B6OA5",
      "cleaned_text": "china is threatening of reciprocal measures to countries making new deal with usa if china would lose their grounds this tariff saga brings new twist and turns everyday ",
      "favorite_count": 27,
      "retweet_count": 3,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.8831661939620972,
      "original_lang": "en"
    },
    {
      "id": "1914129459684450422",
      "text": "क्या टैरिफ़ में गिरावट ने तमाम उभरती अर्थव्यवस्थाओं में विकास को रफ़्तार दी है? अगर ऐसा है तो अब समय आ गया है कि हम विकास के अब तक के सफ़र और रणनीतियों का नए सिरे से मूल्यांकन करें. #USA #Tariff #Economy #India https://t.co/TRYQKQUvVk",
      "cleaned_text": "क य ट र फ म ग र वट न तम म उभरत अर थव यवस थ ओ म व क स क रफ त र द ह अगर ऐस ह त अब समय आ गय ह क हम व क स क अब तक क सफ र और रणन त य क नए स र स म ल य कन कर ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.07297107577323914,
      "original_lang": "hi"
    },
    {
      "id": "1914128699982520632",
      "text": "@TeslaBoomerMama @DivesTech Trump Tariff war make the whole world’s ppl dislike him; because ppl lose business, ppl lose job, usa and the whole world economy are shrinking. Hence, Elon needs to distance away from trump now. Although I like trump other policies, but this one alone really deadly.",
      "cleaned_text": " trump tariff war make the whole world s ppl dislike him because ppl lose business ppl lose job usa and the whole world economy are shrinking hence elon needs to distance away from trump now although i like trump other policies but this one alone really deadly ",
      "favorite_count": 1,
      "retweet_count": 0,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.9130855202674866,
      "original_lang": "en"
    },
    {
      "id": "1914091216515502270",
      "text": "Yes, it's true that gold imports into the USA have surged in early 2025. Reports confirm over 600 tons have been imported since late 2024, driven by tariff concerns and market uncertainty, not a confirmed policy shift.\n\nRegarding Trump's connection, while he has historically supported a gold standard, there’s no official 2025 policy confirming a move away from fiat currency. His recent post about the \"golden rule\" seems symbolic, but speculation about a gold-backed system remains unverified.\n\n- Gold imports: Up significantly due to tariff fears.\n- Trump’s policy: No confirmed shift to a gold standard.",
      "cleaned_text": "yes it s true that gold imports into the usa have surged in early 2025 reports confirm over 600 tons have been imported since late 2024 driven by tariff concerns and market uncertainty not a confirmed policy shift regarding trump s connection while he has historically supported a gold standard there s no official 2025 policy confirming a move away from fiat currency his recent post about the golden rule seems symbolic but speculation about a gold backed system remains unverified gold imports up significantly due to tariff fears trump s policy no confirmed shift to a gold standard ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": -0.035699933767318726,
      "original_lang": "en"
    },
    {
      "id": "1914087298108449091",
      "text": "Trump is LYING about China’s “tariffs.” Trump’s team calculated trade imbalances (i.e. the USA buying more goods from China compared to what China buys from the USA) and then fraudulently labeled that a “tariff.” And far from China cheating the USA on all this, it turns out the USA is cheating China by trading soon-to-be worthless U.S. debt instruments (dollars and treasuries) for useful physical products from China. The USA is ripping off China, not the other way around! And Trump is plunging America into a real economic crisis with his reckless actions targeting China. Full details in my podcast here:\nhttps://t.co/oMXYDpnjde",
      "cleaned_text": "trump is lying about china s tariffs trump s team calculated trade imbalances i e the usa buying more goods from china compared to what china buys from the usa and then fraudulently labeled that a tariff and far from china cheating the usa on all this it turns out the usa is cheating china by trading soon to be worthless u s debt instruments dollars and treasuries for useful physical products from china the usa is ripping off china not the other way around and trump is plunging america into a real economic crisis with his reckless actions targeting china full details in my podcast here ",
      "favorite_count": 67,
      "retweet_count": 11,
      "reply_count": 18,
      "sentiment": "negative",
      "sentiment_score": -0.7902190685272217,
      "original_lang": "en"
    },
    {
      "id": "1914062228690452752",
      "text": "I just know my old macro professor from college would howl at some of the stupid beliefs \n\nUSA buys $150 million of tomatoes from Mexico.\n\n“We’re getting ripped off!! Tariff them 25%!!”\n\nHe really believes anytime you buy something it’s a subsidy. No mention of the value you received",
      "cleaned_text": "i just know my old macro professor from college would howl at some of the stupid beliefs usa buys 150 million of tomatoes from mexico we re getting ripped off tariff them 25 he really believes anytime you buy something it s a subsidy no mention of the value you received",
      "favorite_count": 3,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.7759373188018799,
      "original_lang": "en"
    },
    {
      "id": "1914048643474108475",
      "text": "@kangaroos991 While USA farmers are losing their minds with this dumb tariff shit?? Trump is golfing. Trump wants to golf every week and be a part-time useless president. How can Melania smile around him with all his proven infidelities?? Shame",
      "cleaned_text": " while usa farmers are losing their minds with this dumb tariff shit trump is golfing trump wants to golf every week and be a part time useless president how can melania smile around him with all his proven infidelities shame",
      "favorite_count": 3,
      "retweet_count": 2,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.9128355979919434,
      "original_lang": "en"
    },
    {
      "id": "1914038480222429670",
      "text": "@JayVTheGreat @upholdreality Fact is Trump's tariff policies are very dumb and if the goal is to produce domestically he's going about it completely ass backwards. There's no infrastructure in place for it, there are no workers and he has no interest in bringing in large numbers of immigrants to do the work",
      "cleaned_text": " fact is trump s tariff policies are very dumb and if the goal is to produce domestically he s going about it completely ass backwards there s no infrastructure in place for it there are no workers and he has no interest in bringing in large numbers of immigrants to do the work",
      "favorite_count": 4,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.9170150756835938,
      "original_lang": "en"
    },
    {
      "id": "1914034365400850735",
      "text": "@RnaudBertrand Only fools would negotiate a deal with Trump. Donald Trump lied about every tariff he said foreign countries charge USA goods. They were fake numbers. The reciprocal tariffs were half of the fake tariffs charged USA goods.",
      "cleaned_text": " only fools would negotiate a deal with trump donald trump lied about every tariff he said foreign countries charge usa goods they were fake numbers the reciprocal tariffs were half of the fake tariffs charged usa goods ",
      "favorite_count": 36,
      "retweet_count": 2,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.8268819451332092,
      "original_lang": "en"
    },
    {
      "id": "1914030107691532546",
      "text": "A completely different take on Trump’s tariffs\n\nMichael Hudson – Trump’s Inverted View of America’s Tariff History\n\nhttps://t.co/QgWZlv41yK\n\n#Economics #Tariffs #USA #Trump #Neoliberalism #Monopolies #debt #Workingclass #Geopolitics #Tax #History",
      "cleaned_text": "a completely different take on trump s tariffs michael hudson trump s inverted view of america s tariff history ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.3854202330112457,
      "original_lang": "en"
    },
    {
      "id": "1914015892310012373",
      "text": "@RetroAgent12 It’s what an entrepreneur should be doing now. Negotiating a reasonable price for about a billion “fuck you Trump” flags for the big day. \n\nThey’d be tariff free to all countries….except Maga USA (normal USA exempt).",
      "cleaned_text": " it s what an entrepreneur should be doing now negotiating a reasonable price for about a billion fuck you trump flags for the big day they d be tariff free to all countries except maga usa normal usa exempt ",
      "favorite_count": 7,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.23180386424064636,
      "original_lang": "en"
    },
    {
      "id": "1914009565969912172",
      "text": "@FreightAlley The damage done to USA's reputation is irreversible. Not only the tariff war, but wanting to annex Canada, Greenland, Panama et al. Siding with russia instead of Ukraine. The lives of Ukrainian soldiers lost because of that can never be returned.",
      "cleaned_text": " the damage done to usa s reputation is irreversible not only the tariff war but wanting to annex canada greenland panama et al siding with russia instead of ukraine the lives of ukrainian soldiers lost because of that can never be returned ",
      "favorite_count": 9,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.9357187151908875,
      "original_lang": "en"
    },
    {
      "id": "1913998098948411790",
      "text": "@ShadowofEzra If this is true, if, then the question is which intelligence agency decided to take him out:\n\n- Russia for his bellicosity regarding the Ukraine war\n- EU for his weak support of the anti-tariff campaign\n- USA for his operating a backup deepstate hub",
      "cleaned_text": " if this is true if then the question is which intelligence agency decided to take him out russia for his bellicosity regarding the ukraine war eu for his weak support of the anti tariff campaign usa for his operating a backup deepstate hub",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.7108600735664368,
      "original_lang": "en"
    },
    {
      "id": "1913995383656571224",
      "text": "US-Präsident Donald Trump hat behauptet, dass sein Land durch die vor zwei Wochen verhängten globalen Zölle so viel Geld einnimmt, dass es die Einkommenssteuer abschaffen könnte. #USA #Zoll #tariff #tariffs https://t.co/Yyg9fkd4Ur",
      "cleaned_text": "us präsident donald trump hat behauptet dass sein land durch die vor zwei wochen verhängten globalen zölle so viel geld einnimmt dass es die einkommenssteuer abschaffen könnte ",
      "favorite_count": 4,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": 0.024904310703277588,
      "original_lang": NaN
    },
    {
      "id": "1913990829280293001",
      "text": "Here's time-line.\n\n- 4/21 : USA &amp; China tariff war ended.\n- 4/25 : Russia &amp; Ukraine war ended.\n- 5/7 : Fed cut rate 0.5 points\n\nCaption this post and thank me later.",
      "cleaned_text": "here s time line 4 21 usa amp china tariff war ended 4 25 russia amp ukraine war ended 5 7 fed cut rate 0 5 points caption this post and thank me later ",
      "favorite_count": 3,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.15680687129497528,
      "original_lang": "en"
    },
    {
      "id": "1913975963525812495",
      "text": "Who will buy the US Treasury Bonds from China?\n#china #usa #us #tariffs #tariff #reciprocaltariffs #bonds #treasurybonds #usbonds #trump #trumptsriff https://t.co/9OgmcTpfRb",
      "cleaned_text": "who will buy the us treasury bonds from china ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.12646271288394928,
      "original_lang": "en"
    },
    {
      "id": "1913954512399720803",
      "text": "Your platform includes CBAM which is a tariff Canadians pay.  So why all the talk about being in a  “War with the USA” due to tariffs from the USA. \n\nYOU have put TARIFFS on Canadians through CBAM in your platform!  So you are at war with Canadians according to your logic and statements. \n\nYou talk out of both sides of your mouth and we can NOT afford more taxes.  Who benefits from this tax?  It’s not put toward to the carbon reductions it’s just an additional revenue stream by your own words and with no accountability.   We are more than carbon neutral as a Canadian once our boreal forest and grasslands are accounted for.   We process carbon for other nations for Pete’s sake. It’s a transaction where we (Canadians) do not benefit. It’s not a free market transaction, it’s a Marxist transaction to enable wealth transfer from everyday people to elites.  Shame on you for double speak.",
      "cleaned_text": "your platform includes cbam which is a tariff canadians pay so why all the talk about being in a war with the usa due to tariffs from the usa you have put tariffs on canadians through cbam in your platform so you are at war with canadians according to your logic and statements you talk out of both sides of your mouth and we can not afford more taxes who benefits from this tax it s not put toward to the carbon reductions it s just an additional revenue stream by your own words and with no accountability we are more than carbon neutral as a canadian once our boreal forest and grasslands are accounted for we process carbon for other nations for pete s sake it s a transaction where we canadians do not benefit it s not a free market transaction it s a marxist transaction to enable wealth transfer from everyday people to elites shame on you for double speak ",
      "favorite_count": 5,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.7857489585876465,
      "original_lang": "en"
    },
    {
      "id": "1913945760606880103",
      "text": "Will the Trump tariff war be over by 2028? We talked to economists. https://t.co/mycU0PM8k3",
      "cleaned_text": "will the trump tariff war be over by 2028 we talked to economists ",
      "favorite_count": 15,
      "retweet_count": 12,
      "reply_count": 8,
      "sentiment": "negative",
      "sentiment_score": -0.2117461860179901,
      "original_lang": "en"
    },
    {
      "id": "1913913059761864809",
      "text": "@g_ldn_f @upholdreality P.S it’s only a matter of time before businesses like Nvidia move their HQ to the EU, or Japan. Paying a 10% tariff to sell into the USA makes more sense with freedom to sell at low tariffs to the rest of the world. You’ve literally lost the game of chess by check mating yourself",
      "cleaned_text": " p s it s only a matter of time before businesses like nvidia move their hq to the eu or japan paying a 10 tariff to sell into the usa makes more sense with freedom to sell at low tariffs to the rest of the world you ve literally lost the game of chess by check mating yourself",
      "favorite_count": 3,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.4827404022216797,
      "original_lang": "en"
    },
    {
      "id": "1913907584630730950",
      "text": "Breaking News ‼️\nChina 🇨🇳 BLINKS and wants to negotiate with the USA 🇺🇸 \nAfter the 245% tariff https://t.co/kW3uZboO4p",
      "cleaned_text": "breaking news china blinks and wants to negotiate with the usa after the 245 tariff ",
      "favorite_count": 331,
      "retweet_count": 174,
      "reply_count": 33,
      "sentiment": "positive",
      "sentiment_score": 0.13992811739444733,
      "original_lang": "en"
    },
    {
      "id": "1913886849485225994",
      "text": "85/usec See tweet 79/usec 👆🏼We were the first to write in 2020 about how the Pandemic+ lockdown was a simultaneous demand and supply shock. In 79/usec we argued that it was,the best way to analyse the tariff developments in USA!",
      "cleaned_text": "85 usec see tweet 79 usec we were the first to write in 2020 about how the pandemic lockdown was a simultaneous demand and supply shock in 79 usec we argued that it was the best way to analyse the tariff developments in usa ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": 0.03628373146057129,
      "original_lang": "en"
    },
    {
      "id": "1913883499637211188",
      "text": "@muhdrajaei @Haziqmahmur90an Pelabur asing merangkak sujud untuk buka pasaran Malaysia biar dapat jual barang dia. Tak nampak ke pemimpin komunis dtg negara ni cium tapak kaki askar Melayu sebab kena buli tariff usa? Punca negara ni tak maju, adalah org yg tolak B. Melayu",
      "cleaned_text": " pelabur asing merangkak sujud untuk buka pasaran malaysia biar dapat jual barang dia tak nampak ke pemimpin komunis dtg negara ni cium tapak kaki askar melayu sebab kena buli tariff usa punca negara ni tak maju adalah org yg tolak b melayu",
      "favorite_count": 19,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.7111889123916626,
      "original_lang": NaN
    },
    {
      "id": "1913882560184135747",
      "text": "USA’s first production after Tariff War….!! https://t.co/Ph88zWhvVR",
      "cleaned_text": "usa s first production after tariff war ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.19490782916545868,
      "original_lang": "en"
    },
    {
      "id": "1913877760684024136",
      "text": "A completely different take on Trump’s tariffs\n\nMichael Hudson – Trump’s Inverted View of America’s Tariff History\n\nhttps://t.co/QgWZlv3tJc\n\n#Economics #Tariffs #USA #Trump #Neoliberalism #Monopolies #debt #Workingclass #Geopolitics #Tax #History",
      "cleaned_text": "a completely different take on trump s tariffs michael hudson trump s inverted view of america s tariff history ",
      "favorite_count": 1,
      "retweet_count": 3,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.3854202330112457,
      "original_lang": "en"
    },
    {
      "id": "1913865286702498221",
      "text": "@RnaudBertrand To put this fiasco in simple terms...USA is now reinventing itself as an empire in olden times. And all this tariff and trade imbalance is just a facade for them demanding tributes. The negotiation can be so simple. Just get to the point and ask how much tributes does USA want?",
      "cleaned_text": " to put this fiasco in simple terms usa is now reinventing itself as an empire in olden times and all this tariff and trade imbalance is just a facade for them demanding tributes the negotiation can be so simple just get to the point and ask how much tributes does usa want ",
      "favorite_count": 10,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.8859759569168091,
      "original_lang": "en"
    },
    {
      "id": "1913850059495756077",
      "text": "@childofgod2026 @atensnut We're all Americans, stop with the division BS. Think long term. 170 countries tariff the USA and Trump is fighting back. Bring back the President William McKinley tariffs which worked well under his tenure, America was prosperous, get rid of the income tax.",
      "cleaned_text": " we re all americans stop with the division bs think long term 170 countries tariff the usa and trump is fighting back bring back the president william mckinley tariffs which worked well under his tenure america was prosperous get rid of the income tax ",
      "favorite_count": 18,
      "retweet_count": 1,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.592519998550415,
      "original_lang": "en"
    },
    {
      "id": "1913835018377638001",
      "text": "The people worry about inflation, not trade deficits.\n\nAnd the US tariff war on the world will certainly make inflation inevitable.\n\n#Inflation #USA https://t.co/vDyQ12Lsw7",
      "cleaned_text": "the people worry about inflation not trade deficits and the us tariff war on the world will certainly make inflation inevitable ",
      "favorite_count": 70,
      "retweet_count": 23,
      "reply_count": 5,
      "sentiment": "neutral",
      "sentiment_score": -0.04884821176528931,
      "original_lang": "en"
    },
    {
      "id": "1913813163260207481",
      "text": "Read Prof. @askhimanshurai’s take in the @EconomicTimes on how the USA tariff turmoil is reshaping global business—and why B-school students must gear up for a world where uncertainty is the only constant. \n\n#Leadership #MBALessons #Geopolitics",
      "cleaned_text": "read prof s take in the on how the usa tariff turmoil is reshaping global business and why b school students must gear up for a world where uncertainty is the only constant ",
      "favorite_count": 3,
      "retweet_count": 2,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.3049299716949463,
      "original_lang": "en"
    },
    {
      "id": "1913797910992654715",
      "text": "🍀 이번 주 Keywords (4.21/월 ~ 4.25/금)  🍀\n\n1.  $Trump, $Musk,  #트럼프, #머스크 🇺🇸 \n\n2. #Earnings, #실적   \n\n3. China $LPR (Loan Prime Rate 5Y) 🇭🇰🇨🇳\n\n3. USA Leading Index 🇺🇸\n\n4. $IMF 🌐🌏🌍🌎\n\n 5. $Tariff, #관세   🛳️🚢✈️🚗💳\n\n6 . #한화엔진, $LS 🚀\n\n7. $TSLA, #테슬라 🚗🚘🏎️\n\n8. $AI, 온코크로스 🤖⌨️🖨️💽💾📀🖥️\n\n9. #한미반도체, #HD현대, #삼성바이오로직스, \n     #LG이노텍, #OCI, #유니드, #SK하이닉스, #현대차,\n     #LG전자, #LG디스플레이, #포스코DX, #HD현대,\n     #KB금융, #JB금융지주, #포스코퓨처엠, \n     #포스코인터내셔널,  #삼성에스디에스, #삼성중공업, \n     #POSCO, #제주은행, #한화솔루션, #현대제철\n    #신한지주, #우리금융, #하나금융, #삼성카드, \n    #삼성SDI, #현대모비스,   #포스코인터내셔널, #LX세미콘, #제일기획, \n   \n🗓️📆🏭💳👜\n\n10. 코오롱티슈진, 메디포스트, 차바이오, \n🧬🧫🏥💊⚕️😷\n      \n11. #공모청약, #나우로보틱스, #원일티엔아이, \n      #오가노이드사이언스\n\n12. #정찰위성, #한화에어로스페이스 🛰️📡\n\n13. #이수페타시스, #리가켐바이오  💊\n\n14. $PMI, #신규주택매매, #베이지북 🇺🇸\n\n15. $PM, $TMO,  $NEE, $GEV, $BA, $GD, $IBM, $NOW, $TXN, $LRCX, $ORLY, $CMG, $GOOGL 🇺🇸",
      "cleaned_text": " 이번 주 keywords 4 21 월 4 25 금 1 trump musk 2 3 china lpr loan prime rate 5y 3 usa leading index 4 imf 5 tariff 6 ls 7 tsla 8 ai 온코크로스 9 10 코오롱티슈진 메디포스트 차바이오 11 12 13 14 pmi 15 pm tmo nee gev ba gd ibm now txn lrcx orly cmg googl ",
      "favorite_count": 18,
      "retweet_count": 4,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": -0.009408116340637207,
      "original_lang": NaN
    },
    {
      "id": "1913778161764147400",
      "text": "@GordonGChang The tariff was is hurting the USA the most. \n\nChina's exports to the USA only account for 2.7% of China's total economy.\n\nChina exports more the the Global South than it does to the EU and USA combined. \n\n#FactsMatter https://t.co/fuHVp5hQvy",
      "cleaned_text": " the tariff was is hurting the usa the most china s exports to the usa only account for 2 7 of china s total economy china exports more the the global south than it does to the eu and usa combined ",
      "favorite_count": 15,
      "retweet_count": 2,
      "reply_count": 5,
      "sentiment": "negative",
      "sentiment_score": -0.9068751335144043,
      "original_lang": "en"
    },
    {
      "id": "1913677738088751538",
      "text": "The US-China tariff 'battle' feels staged, like a carefully orchestrated play. 🎭 \n\nWhile politicians posture, smart investors are spotting opportunities. \n\nVolatility = advantage. \n\nThe best deals happen when others panic.\n\n Time to think long-term.\n\n #TradeWar  #usa #China https://t.co/PckCgqnuhK",
      "cleaned_text": "the us china tariff battle feels staged like a carefully orchestrated play while politicians posture smart investors are spotting opportunities volatility advantage the best deals happen when others panic time to think long term ",
      "favorite_count": 3,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": 0.04594367742538452,
      "original_lang": "en"
    },
    {
      "id": "1913677575731437816",
      "text": "Trade and Tariff: India, US to open talks in Washington on April 23: Both sides have finalised terms of reference for a proposed bilateral trade agreement, covering 19 chapters on issues like tariffs, goods, non-tariff barriers and customs facilitation  https://t.co/xckHLFqMHC",
      "cleaned_text": "trade and tariff india us to open talks in washington on april 23 both sides have finalised terms of reference for a proposed bilateral trade agreement covering 19 chapters on issues like tariffs goods non tariff barriers and customs facilitation ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.1810363382101059,
      "original_lang": "en"
    },
    {
      "id": "1913673338272243734",
      "text": "@DevanaUkraine Trump has not achieved anything in foreign policy so far, and most of his campaign rhetoric and slogans have been nothing more than bluffs... In the tariff issue, he was forced to back down because the economy is not a joke and its effects were visible on the stock market and usa https://t.co/cVJiIESubQ",
      "cleaned_text": " trump has not achieved anything in foreign policy so far and most of his campaign rhetoric and slogans have been nothing more than bluffs in the tariff issue he was forced to back down because the economy is not a joke and its effects were visible on the stock market and usa ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8817893862724304,
      "original_lang": "en"
    },
    {
      "id": "1913666119438598232",
      "text": "@KatKanada_TM FFS Canada has no GDP, and obtaining one would mean a massive creation of well paying jobs in the private sector. Carney is anti pipeline, anti private big business, anti mining, anti 0 tariff free trade with the USA. Carney is a green grifter, he will rob us blind.",
      "cleaned_text": " ffs canada has no gdp and obtaining one would mean a massive creation of well paying jobs in the private sector carney is anti pipeline anti private big business anti mining anti 0 tariff free trade with the usa carney is a green grifter he will rob us blind ",
      "favorite_count": 4,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8803120851516724,
      "original_lang": "en"
    },
    {
      "id": "1913665719113244739",
      "text": "Breaking News!!\nGUESS WHO BLINK and want to\nnegotiate with the USA after the 245% tariff",
      "cleaned_text": "breaking news guess who blink and want to negotiate with the usa after the 245 tariff",
      "favorite_count": 9,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.19774314761161804,
      "original_lang": "en"
    },
    {
      "id": "1913665193432780885",
      "text": "@dampedspring Wouldn’t tariff free trade between Europe , Japan, and USA be largely disinflationary and good for bonds? Assuming that happens of course which is a bit of a leap",
      "cleaned_text": " wouldn t tariff free trade between europe japan and usa be largely disinflationary and good for bonds assuming that happens of course which is a bit of a leap",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 2,
      "sentiment": "neutral",
      "sentiment_score": 0.04548528790473938,
      "original_lang": "en"
    },
    {
      "id": "1913658711261708432",
      "text": "@brianlilley like Doug Ford, purposefully attending American News  for the tariff information -  Canada is facing huge trade difficulties with the USA -  more important to get the message out south of the border  #cdnpoli",
      "cleaned_text": " like doug ford purposefully attending american news for the tariff information canada is facing huge trade difficulties with the usa more important to get the message out south of the border ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8318090438842773,
      "original_lang": "en"
    },
    {
      "id": "1913642418563694882",
      "text": "TRUMPENOMICS IN ACTION: Supplier Email to My Small Business Friend Announcing 10% Trump Tariff Tax on Goods Imported From Germany\n\nZweigart is a go-to company for arts &amp; craft supplies. There is no American equivalent.\n\nTariffs are a tax on consumers. Thanks President Trump! https://t.co/VHRiozJa96",
      "cleaned_text": "trumpenomics in action supplier email to my small business friend announcing 10 trump tariff tax on goods imported from germany zweigart is a go to company for arts amp craft supplies there is no american equivalent tariffs are a tax on consumers thanks president trump ",
      "favorite_count": 13,
      "retweet_count": 4,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.3158976435661316,
      "original_lang": "en"
    },
    {
      "id": "1913619310758502572",
      "text": "☕️ Good Morning! 📉 $GOOG just broke support ahead of earnings...\nBut with tariff headlines heating up and IV spiking — is this a breakdown or a setup? I did a full analysis and broke it all down.\n👇 Read the Deep Dive:\nhttps://t.co/Zh0WE6cAlo",
      "cleaned_text": " good morning goog just broke support ahead of earnings but with tariff headlines heating up and iv spiking is this a breakdown or a setup i did a full analysis and broke it all down read the deep dive ",
      "favorite_count": 7,
      "retweet_count": 1,
      "reply_count": 4,
      "sentiment": "negative",
      "sentiment_score": -0.768423855304718,
      "original_lang": "en"
    },
    {
      "id": "1913613865868267836",
      "text": "@LanceUpper98782 @AnterosHyperion @realDonaldTrump The only tariff Canada put on the USA are in the trade deal that Trump made with Canada and Mexico called USMCA and he called it the best deal ever but then he broke it and started his tariff war with the world.",
      "cleaned_text": " the only tariff canada put on the usa are in the trade deal that trump made with canada and mexico called usmca and he called it the best deal ever but then he broke it and started his tariff war with the world ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.6304275393486023,
      "original_lang": "en"
    },
    {
      "id": "1913600153597956291",
      "text": "How US Presidents Have Shaped Tariff and Trade Policy in the USA https://t.co/IBtdtbSzPF via @YouTube",
      "cleaned_text": "how us presidents have shaped tariff and trade policy in the usa via ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": -0.024397149682044983,
      "original_lang": "en"
    },
    {
      "id": "1913593450403865068",
      "text": "Opinion: Trump is using a tariff war to solve a problem that doesn't exist | Opinion https://t.co/eSvuqfu5Go",
      "cleaned_text": "opinion trump is using a tariff war to solve a problem that doesn t exist opinion ",
      "favorite_count": 9,
      "retweet_count": 4,
      "reply_count": 8,
      "sentiment": "negative",
      "sentiment_score": -0.6638028025627136,
      "original_lang": "en"
    },
    {
      "id": "1913571740430500285",
      "text": "The deals were fantastic as they were.\n\nUSA had the lowest:\n\nBefore Trump’s 2025 tariff hikes, the average tariff rates imposed on imports (based on trade-weighted averages from 2023–2024 data) were:\n•  USA: 2.5% (Visual Capitalist, 2024). \n•  China: 3% (Cato Institute, WTO 2023 data). \n•  EU: 2.7% (Cato Institute, WTO 2023 data). \n•  India: 12% (Cato Institute, WTO 2023 data). \nLowest: The USA had the lowest average tariff rate on imports at 2.5%, though the EU was very close at 2.7%.",
      "cleaned_text": "the deals were fantastic as they were usa had the lowest before trump s 2025 tariff hikes the average tariff rates imposed on imports based on trade weighted averages from 2023 2024 data were usa 2 5 visual capitalist 2024 china 3 cato institute wto 2023 data eu 2 7 cato institute wto 2023 data india 12 cato institute wto 2023 data lowest the usa had the lowest average tariff rate on imports at 2 5 though the eu was very close at 2 7 ",
      "favorite_count": 10,
      "retweet_count": 5,
      "reply_count": 2,
      "sentiment": "neutral",
      "sentiment_score": 0.021219253540039062,
      "original_lang": "en"
    },
    {
      "id": "1913569152477864205",
      "text": "FELON TRUMP TARIFF TAXES AFFECT ALL WE BUY. \nHIS TRADE WAR INSANITY IS ISOLATING AMERICA. NOTHING IS 100% MADE IN THE USA #exports #usa #imports #trump #Trump #trade #commerce #USA #Economy #tariffs #taxes #tax #Economia #Reels #trumptariffs #love #shopping #fashion #sale #shop https://t.co/vLN0ztNDIJ",
      "cleaned_text": "felon trump tariff taxes affect all we buy his trade war insanity is isolating america nothing is 100 made in the usa ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.885674238204956,
      "original_lang": "en"
    },
    {
      "id": "1913561346555183359",
      "text": "@CalltoActivism China is making out like a bandit.\nJoint statements with Japan and S Korea.\nEU sending envoys to discuss new opportunities.\nNew markets looking for lower tariff trade.\nReputation shift versus the USA.\nWhen your enemy destroys itself, stay out of the way.",
      "cleaned_text": " china is making out like a bandit joint statements with japan and s korea eu sending envoys to discuss new opportunities new markets looking for lower tariff trade reputation shift versus the usa when your enemy destroys itself stay out of the way ",
      "favorite_count": 25,
      "retweet_count": 5,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8669756650924683,
      "original_lang": "en"
    },
    {
      "id": "1913519485598015678",
      "text": "https://t.co/AQecyzpIls\n\nCaught in the trade war crossfire, Malaysia and ASEAN stands firm: We'll stay neutral, champion fair and open trade, and work with the US & global partners for win-win solutions.\n\n#TZA #MITI #ThisIsWhereGlobalStarts #MADANIIsWorking #tariff #usa #trump #china #myASEAN2025 #advancingASEANeconomy2025 🇲🇾🌺",
      "cleaned_text": " caught in the trade war crossfire malaysia and asean stands firm we ll stay neutral champion fair and open trade and work with the us global partners for win win solutions ",
      "favorite_count": 12,
      "retweet_count": 6,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.12606307864189148,
      "original_lang": "en"
    },
    {
      "id": "1913516954830135683",
      "text": "The USA is guilty of using Us citizen tax dollars for genocide, war mongering with Iran, bombing Yemen, provoking Russia into a hot war, triggering a tariff/trade war with China impacting global commerce and violating rule of law with deportations and unlawful detentions of documented and undocumented immigrants in the USA. \n\nLet Burkinabe spend their gold as they damn well please!",
      "cleaned_text": "the usa is guilty of using us citizen tax dollars for genocide war mongering with iran bombing yemen provoking russia into a hot war triggering a tariff trade war with china impacting global commerce and violating rule of law with deportations and unlawful detentions of documented and undocumented immigrants in the usa let burkinabe spend their gold as they damn well please ",
      "favorite_count": 62,
      "retweet_count": 9,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.902046799659729,
      "original_lang": "en"
    },
    {
      "id": "1913512432493875597",
      "text": "Today Globalization is dead.\nGlobal Supply Chain, \nGlobal Manufacturing, and Concept of one market is dead.\n\nRIP Globalization.\n\nMulti-polar Multi-currency World is Born\n\nWelcome to New World Order.\n\n#Tariff #USA   #China  #Europe  #EU\n #WTO  #Globalization https://t.co/JT67UcO1sv",
      "cleaned_text": "today globalization is dead global supply chain global manufacturing and concept of one market is dead rip globalization multi polar multi currency world is born welcome to new world order ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8095110654830933,
      "original_lang": "en"
    },
    {
      "id": "1913486056684675496",
      "text": "gini yg saya pahami mungkin saya salah\nTextile dari 2018 memang udah kena 37% ini beda sama yg 2025 resiprokal 32% yaa\n\nData on Textile Tariffs (Indonesia to USA)\nTariff Range (10-37%):\n10%: Applies to woven fabrics like HS 5208.52 (since 2005, unchanged).\n16-21%: Applies to knitted apparel (HS 6109) and made-up textiles (HS 6302) (since 2005, with minor adjustments).\n37%: Applies to specific apparel like HS 6203.42 (men’s trousers), starting in 2018, when the base MFN rate of 27.9% was increased by a 10% safeguard duty to 37.9% (rounded to 37% in discussions). This rate was still in place as of April 2025\n\n2025  trump kenakan tarif  32% reciprocal tarif ke indonesia , 32% itu dasarnya adalah SELISIH IMPOR EXPORT dibagi 2 (ini yg lagi diatur dinego beresin aja selisihnya) lalu 32% DIPAUSE jadi 10% aja\n\nnah sekarang kan lagi pause berlaku 10% ya nah inilah angka 47% itu  yg 37% bukan barang baru dan 10% itu memang tarif pause ini bukan angka baru breaking news hari ini tapi ini angka ya udah 2 minggu lalu kan yg pause pause itu\n\nNah yang lagi dinego itu 32% reciprocal , belum ada hasil bukan negonya gagal dan jadi 47% ini beda urusan kalau nego gagal mungkin jadi 69%🤣🤣🤣bukan jadi 47% (32 +37)",
      "cleaned_text": "gini yg saya pahami mungkin saya salah textile dari 2018 memang udah kena 37 ini beda sama yg 2025 resiprokal 32 yaa data on textile tariffs indonesia to usa tariff range 10 37 10 applies to woven fabrics like hs 5208 52 since 2005 unchanged 16 21 applies to knitted apparel hs 6109 and made up textiles hs 6302 since 2005 with minor adjustments 37 applies to specific apparel like hs 6203 42 men s trousers starting in 2018 when the base mfn rate of 27 9 was increased by a 10 safeguard duty to 37 9 rounded to 37 in discussions this rate was still in place as of april 2025 2025 trump kenakan tarif 32 reciprocal tarif ke indonesia 32 itu dasarnya adalah selisih impor export dibagi 2 ini yg lagi diatur dinego beresin aja selisihnya lalu 32 dipause jadi 10 aja nah sekarang kan lagi pause berlaku 10 ya nah inilah angka 47 itu yg 37 bukan barang baru dan 10 itu memang tarif pause ini bukan angka baru breaking news hari ini tapi ini angka ya udah 2 minggu lalu kan yg pause pause itu nah yang lagi dinego itu 32 reciprocal belum ada hasil bukan negonya gagal dan jadi 47 ini beda urusan kalau nego gagal mungkin jadi 69 bukan jadi 47 32 37 ",
      "favorite_count": 114,
      "retweet_count": 25,
      "reply_count": 9,
      "sentiment": "neutral",
      "sentiment_score": -0.03555811941623688,
      "original_lang": NaN
    },
    {
      "id": "1913482145332445654",
      "text": "The Cancellor will be in the USA from Tuesday to Friday for the Spring Meetings of the International Monetary Fund and will push for deal that protects British Car, Steel and Pharmaceutical Industries amid tariff uncertainty.\n\nhttps://t.co/Ne01tJZah7",
      "cleaned_text": "the cancellor will be in the usa from tuesday to friday for the spring meetings of the international monetary fund and will push for deal that protects british car steel and pharmaceutical industries amid tariff uncertainty ",
      "favorite_count": 1,
      "retweet_count": 0,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.0932348221540451,
      "original_lang": "en"
    },
    {
      "id": "1913467561657905234",
      "text": "@KarinLitzcke @bettybloodclot @BreakfastK69577 Exactly 😊 Ever since Trump gave liberal Canada a tariff ultimatum. Liberals only reported on how horrible that was. Never how avoidable and the true reasons for the tariffs. After the election Canada and USA will be stronger than ever. Because Trumps vision is common sense 🙄",
      "cleaned_text": " exactly ever since trump gave liberal canada a tariff ultimatum liberals only reported on how horrible that was never how avoidable and the true reasons for the tariffs after the election canada and usa will be stronger than ever because trumps vision is common sense ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.7960044145584106,
      "original_lang": "en"
    },
    {
      "id": "1913460047256207838",
      "text": "#Emergingmarkets like #India would be hit hardest.  These economies would have to prepare for higher #tariffs becoming the new normal.\n#trump #tariff #economy #tradepolicy #imports #globalization #globalists #usa #china #TrumpTariffs #TariffWAR #WTO #IMF \nhttps://t.co/2eurjmUgyD",
      "cleaned_text": " like would be hit hardest these economies would have to prepare for higher becoming the new normal ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8421846628189087,
      "original_lang": "en"
    },
    {
      "id": "1913455031342297216",
      "text": "Why does the UK let in lots of food tariff free from Ireland but not from the USA?  Competition between US and Ireland would give us more choice and lower prices.",
      "cleaned_text": "why does the uk let in lots of food tariff free from ireland but not from the usa competition between us and ireland would give us more choice and lower prices ",
      "favorite_count": 437,
      "retweet_count": 90,
      "reply_count": 40,
      "sentiment": "negative",
      "sentiment_score": -0.5369596481323242,
      "original_lang": "en"
    },
    {
      "id": "1913439922188407251",
      "text": "2/n \n\nAll indices globally like SPX, Nifty50 etc were falling when Trump announced tariffs and kept on hiking it for China. \nThe 2 countries China & USA makes up around 44% of world’s GDP & tariff war between the 2 + tariffs on all countries could be very bad.\nBut the 2 members were trying hard to convince Trump to take back tariffs but there was 1 person who wouldn’t let them do that.\nMore 👇",
      "cleaned_text": "2 n all indices globally like spx nifty50 etc were falling when trump announced tariffs and kept on hiking it for china the 2 countries china usa makes up around 44 of world s gdp tariff war between the 2 tariffs on all countries could be very bad but the 2 members were trying hard to convince trump to take back tariffs but there was 1 person who wouldn t let them do that more ",
      "favorite_count": 17,
      "retweet_count": 1,
      "reply_count": 3,
      "sentiment": "negative",
      "sentiment_score": -0.6911503076553345,
      "original_lang": "en"
    },
    {
      "id": "1913420103535788257",
      "text": "@ChartingProdigy 100% agree. My only decision is what will be the catalyst to go back up to ATH or close to it. The only catalyst I can think of is if China and USA solve the tariff issue and then other countries follow. Sure Jay may buckle and start QE but may be too late.",
      "cleaned_text": " 100 agree my only decision is what will be the catalyst to go back up to ath or close to it the only catalyst i can think of is if china and usa solve the tariff issue and then other countries follow sure jay may buckle and start qe but may be too late ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.0943170040845871,
      "original_lang": "en"
    },
    {
      "id": "1913417992039457133",
      "text": "@IndoPopBase Trump ni gila...suka berubah2 tariff nya...you cannot do business with this kind of people. Seluruh dunia perlu isolate USA hingga Trump habis tempoh presidensi yakni 2028.",
      "cleaned_text": " trump ni gila suka berubah2 tariff nya you cannot do business with this kind of people seluruh dunia perlu isolate usa hingga trump habis tempoh presidensi yakni 2028 ",
      "favorite_count": 42,
      "retweet_count": 2,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.8549209833145142,
      "original_lang": NaN
    },
    {
      "id": "1913413623235412332",
      "text": "#WTO rules benefit developing countries by providing differentiated tariff rates. #Exports from developing countries are taxed lower rate than those from developed countries!\n#trump #tariff #economy #tradepolicy #imports #globalization #globalists #USA\nhttps://t.co/dtbQ3H7q1a",
      "cleaned_text": " rules benefit developing countries by providing differentiated tariff rates from developing countries are taxed lower rate than those from developed countries ",
      "favorite_count": 2,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.07155722379684448,
      "original_lang": "en"
    },
    {
      "id": "1913374447752392768",
      "text": "@CarlZha What's the tariff on those? How do they even get them to the USA these days?",
      "cleaned_text": " what s the tariff on those how do they even get them to the usa these days ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.7319679856300354,
      "original_lang": "en"
    },
    {
      "id": "1913359313856590284",
      "text": "Q: Number of countries that have ‘made a deal’ with the USA? \nA: Zero\nThankfully Peter Dutton wasn’t PM when the Trump tariff come &amp; KMA negotiations were on! \nImagine what Dutton would have given away to be in the Trump Club!! \nDutton is too jumpy, too anxious to lead Oz!!",
      "cleaned_text": "q number of countries that have made a deal with the usa a zero thankfully peter dutton wasn t pm when the trump tariff come amp kma negotiations were on imagine what dutton would have given away to be in the trump club dutton is too jumpy too anxious to lead oz ",
      "favorite_count": 10,
      "retweet_count": 8,
      "reply_count": 4,
      "sentiment": "negative",
      "sentiment_score": -0.5924687385559082,
      "original_lang": "en"
    },
    {
      "id": "1913336085863686229",
      "text": "Unmoved by Tariff Threats, Mexican GM Workers Win a Double-Digit Wage Hike | Labor Notes https://t.co/yUyUZlakNa",
      "cleaned_text": "unmoved by tariff threats mexican gm workers win a double digit wage hike labor notes ",
      "favorite_count": 3,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": -0.03632113337516785,
      "original_lang": "en"
    },
    {
      "id": "1913336037809570196",
      "text": "alerta comunista on Trump's tariff policy &amp; the Bessent-Miran Schock:\n\n‘The plan is clear: to hit Chinese industry and transfer the high-tech industries to the USA and the labour-intensive ones to India.’\n\nhttps://t.co/K6bvpx7Jp5",
      "cleaned_text": "alerta comunista on trump s tariff policy amp the bessent miran schock the plan is clear to hit chinese industry and transfer the high tech industries to the usa and the labour intensive ones to india ",
      "favorite_count": 8,
      "retweet_count": 1,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.3311905264854431,
      "original_lang": "en"
    },
    {
      "id": "1913327220199657627",
      "text": "USA &amp; China workout a tariff deal.\n\nRussia &amp; Ukraine kiss and make up.\n\nThe fed drastically cuts interest rates.\n\nMarkets and crypto shoot to the moon. ⏲️⌛️⏲️⌛️",
      "cleaned_text": "usa amp china workout a tariff deal russia amp ukraine kiss and make up the fed drastically cuts interest rates markets and crypto shoot to the moon ",
      "favorite_count": 29,
      "retweet_count": 2,
      "reply_count": 3,
      "sentiment": "negative",
      "sentiment_score": -0.0579434335231781,
      "original_lang": "en"
    },
    {
      "id": "1913312375387914354",
      "text": "The guys subverting Trump and the USA,, work for Trump.  Bessent and Navarro (the tariff guys) are just the Fauci Birx of this term. Bessent has always been a Soros guy?  How did you not already know this.  His whole career was Soros.  Soros even as the seed for Bessent's private equity company",
      "cleaned_text": "the guys subverting trump and the usa work for trump bessent and navarro the tariff guys are just the fauci birx of this term bessent has always been a soros guy how did you not already know this his whole career was soros soros even as the seed for bessent s private equity company",
      "favorite_count": 4,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.3841400742530823,
      "original_lang": "en"
    },
    {
      "id": "1913305432451317899",
      "text": "The USA now states clearly COVID came from a laboratory leak. \nIt could be incendiary for bilateral relations with China. \nThe statement comes in the middle of a huge tariff tussle. \nIs it a negotiation chip or will it stay? https://t.co/icQSVuJy0U",
      "cleaned_text": "the usa now states clearly covid came from a laboratory leak it could be incendiary for bilateral relations with china the statement comes in the middle of a huge tariff tussle is it a negotiation chip or will it stay ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.7187761068344116,
      "original_lang": "en"
    },
    {
      "id": "1913301367843639598",
      "text": "As the USA vs China tariff war heats up, the world is learning a very important lesson about the clear distinction between an industrial economy and an overly financialised, abstract economy.\n\nNotes are being taken. https://t.co/pyJ8iQM2kl",
      "cleaned_text": "as the usa vs china tariff war heats up the world is learning a very important lesson about the clear distinction between an industrial economy and an overly financialised abstract economy notes are being taken ",
      "favorite_count": 302,
      "retweet_count": 118,
      "reply_count": 25,
      "sentiment": "positive",
      "sentiment_score": 0.3048272430896759,
      "original_lang": "en"
    },
    {
      "id": "1913300782327226688",
      "text": "Boeing jet returns to US from China amid tariff war | Reuters\n\n#Reuters #Boeing #China #USA  https://t.co/09f9Gz9zVR",
      "cleaned_text": "boeing jet returns to us from china amid tariff war reuters ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.15623335540294647,
      "original_lang": "en"
    },
    {
      "id": "1913268371103121732",
      "text": "The Canada/Mexico trade tariff tension isn't about Canada/Mexico (setting aside specific issues the USA has with the USMCA), it's about their relationship and infiltration/alignment with China.\n\nAlberta needs to decide whether it wants to align geopolitically with the USA or China, it's that simple.\n\nAn Alberta aligned with the USA structurally is a lot easier and makes way more sense than any China alignment. Markets for Alberta's products and existing low-cost infrastructure is best aligned with the USA.\n\nIf \"Canada\" is infiltrated with China and the election results in closer relations with China, then Alberta must take action to eliminate Ottawa and do what's in Alberta's interest, and that is to align with the USA.",
      "cleaned_text": "the canada mexico trade tariff tension isn t about canada mexico setting aside specific issues the usa has with the usmca it s about their relationship and infiltration alignment with china alberta needs to decide whether it wants to align geopolitically with the usa or china it s that simple an alberta aligned with the usa structurally is a lot easier and makes way more sense than any china alignment markets for alberta s products and existing low cost infrastructure is best aligned with the usa if canada is infiltrated with china and the election results in closer relations with china then alberta must take action to eliminate ottawa and do what s in alberta s interest and that is to align with the usa ",
      "favorite_count": 33,
      "retweet_count": 11,
      "reply_count": 5,
      "sentiment": "neutral",
      "sentiment_score": 0.0006769895553588867,
      "original_lang": "en"
    },
    {
      "id": "1913249535691776433",
      "text": "This Trade &amp; Tariff War between USA &amp; China is not stopping. Yes, there will be some compromises, however, both the powers will now look into diversifying their supply chains &amp; shoring \"lower &amp; middle power nations\" as their allies. Hence, bifurcation of global systems. https://t.co/FLxh2xv2Cg",
      "cleaned_text": "this trade amp tariff war between usa amp china is not stopping yes there will be some compromises however both the powers will now look into diversifying their supply chains amp shoring lower amp middle power nations as their allies hence bifurcation of global systems ",
      "favorite_count": 3,
      "retweet_count": 4,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.2776578366756439,
      "original_lang": "en"
    },
    {
      "id": "1913238900568436885",
      "text": "Tariff Armageddon? 💥 Trump's trade war is hitting hard. Can businesses survive by slashing imports?\n\n#TZA #MITI #ThisIsWhereGlobalStarts #MADANIIsWorking #tariff #usa #trump https://t.co/iwDaA7ZBsQ",
      "cleaned_text": "tariff armageddon trump s trade war is hitting hard can businesses survive by slashing imports ",
      "favorite_count": 58,
      "retweet_count": 16,
      "reply_count": 4,
      "sentiment": "negative",
      "sentiment_score": -0.8366112112998962,
      "original_lang": "en"
    },
    {
      "id": "1913238480043356455",
      "text": "It’s been one wacky week in the land of digital dough! From the USA's wild tariff tussle that’s got everyone buzzing  to all the jaw-dropping drama, it’s like a reality show but with more math and fewer roses! \n\nNow, it seems that all this chaos is making some crypto fans scratch their heads and wonder if their beloved Bitcoin is about to launch into the stratosphere or take a nosedive like a clumsy pigeon!  Who knew crypto could have so many plot twists? Grab your popcorn; this is getting good!",
      "cleaned_text": "it s been one wacky week in the land of digital dough from the usa s wild tariff tussle that s got everyone buzzing to all the jaw dropping drama it s like a reality show but with more math and fewer roses now it seems that all this chaos is making some crypto fans scratch their heads and wonder if their beloved bitcoin is about to launch into the stratosphere or take a nosedive like a clumsy pigeon who knew crypto could have so many plot twists grab your popcorn this is getting good ",
      "favorite_count": 397,
      "retweet_count": 125,
      "reply_count": 110,
      "sentiment": "negative",
      "sentiment_score": -0.7115371227264404,
      "original_lang": "en"
    },
    {
      "id": "1913231558003069128",
      "text": "y'all think USA vs CHINA war won't escalate \n\ni think China aka the sleeping giant got a bigger ego than 10 years ago, and they are getting cocky\n\ni do think tensions keep rising, Trade War won't stop overnight and tariff effects, specially the indirect effects will impact a lot.",
      "cleaned_text": "y all think usa vs china war won t escalate i think china aka the sleeping giant got a bigger ego than 10 years ago and they are getting cocky i do think tensions keep rising trade war won t stop overnight and tariff effects specially the indirect effects will impact a lot ",
      "favorite_count": 39,
      "retweet_count": 5,
      "reply_count": 15,
      "sentiment": "negative",
      "sentiment_score": -0.8221991658210754,
      "original_lang": "en"
    },
    {
      "id": "1913220192315855057",
      "text": "Is Algorand best positioned for Real World Assets? \n\nHad a great conversation with @marcvl from @AlgoFoundation \n\nTopics:\n-&gt; Tariff War Impact.\n-&gt; Made in USA coin and its future?\n-&gt; Blockchain Trilemma.\n-&gt; Why Algorand?\n\nFull Video👇 https://t.co/r0UWd52lTu",
      "cleaned_text": "is algorand best positioned for real world assets had a great conversation with from topics gt tariff war impact gt made in usa coin and its future gt blockchain trilemma gt why algorand full video ",
      "favorite_count": 167,
      "retweet_count": 39,
      "reply_count": 20,
      "sentiment": "positive",
      "sentiment_score": 0.39635729789733887,
      "original_lang": "en"
    },
    {
      "id": "1913218784468275604",
      "text": "@IvankaNews_ No she has as a EU agent to manipulate President Trump on Ukrain NATO issue and Tariff , she is a war monger and supported 25% EU Tariff on USA . West meaning Europe is Not US friend they ripped of USA",
      "cleaned_text": " no she has as a eu agent to manipulate president trump on ukrain nato issue and tariff she is a war monger and supported 25 eu tariff on usa west meaning europe is not us friend they ripped of usa",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8660768270492554,
      "original_lang": "en"
    },
    {
      "id": "1913216103142072717",
      "text": "Tariff and inflation woes have millennials thrifting more. Here's how to start. https://t.co/qxRiDdSY2M",
      "cleaned_text": "tariff and inflation woes have millennials thrifting more here s how to start ",
      "favorite_count": 7,
      "retweet_count": 7,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.7130804061889648,
      "original_lang": "en"
    },
    {
      "id": "1913204094850015575",
      "text": "@USAmbJapan 1 To deepen ties, remove the tariff immediately on Japan export to USA\n2 Start negotiation for compromise and collaboration",
      "cleaned_text": " 1 to deepen ties remove the tariff immediately on japan export to usa 2 start negotiation for compromise and collaboration",
      "favorite_count": 11,
      "retweet_count": 8,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": 0.04064516723155975,
      "original_lang": "en"
    },
    {
      "id": "1913203455793172827",
      "text": "hahaha: \"…[Who said China doesn't have an appreciation for political satire…?] [made in China …will USA impose MAGA the 185% tariff…?] 100,000 T-shirts …say \"Boycott China\"…\" how many more orders will China receive for these…?  🤩",
      "cleaned_text": "hahaha who said china doesn t have an appreciation for political satire made in china will usa impose maga the 185 tariff 100 000 t shirts say boycott china how many more orders will china receive for these ",
      "favorite_count": 1,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.528648853302002,
      "original_lang": "en"
    },
    {
      "id": "1913192944800055416",
      "text": "U.S., Japan still have 'gaps' on trade stances after White House talks - https://t.co/TkopNrBOan.  #NintendoSwitch. As far as most items go USA still has 10% tariff on Japan. Higher for cars and car parts.  https://t.co/X8RUfStDbL",
      "cleaned_text": "u s japan still have gaps on trade stances after white house talks as far as most items go usa still has 10 tariff on japan higher for cars and car parts ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.6057688593864441,
      "original_lang": "en"
    },
    {
      "id": "1913185740961575050",
      "text": "@rationalaussie The USA is the only free country left by virtue of the power of its Constitution. The rest of the West have egregiously fallen far behind, intently. \n\nThe US is now tying trade and tariff deals to free speech and so on. Thank God. Let this nightmare epoch end with a renaissance.",
      "cleaned_text": " the usa is the only free country left by virtue of the power of its constitution the rest of the west have egregiously fallen far behind intently the us is now tying trade and tariff deals to free speech and so on thank god let this nightmare epoch end with a renaissance ",
      "favorite_count": 19,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.658130943775177,
      "original_lang": "en"
    },
    {
      "id": "1913176717843177637",
      "text": "Betul ke, kalau kita pergi kedai makan, lepas tu order nasi goreng usa dengan nasi goreng cina, nanti kena bayar mahal sebab kena tariff?",
      "cleaned_text": "betul ke kalau kita pergi kedai makan lepas tu order nasi goreng usa dengan nasi goreng cina nanti kena bayar mahal sebab kena tariff ",
      "favorite_count": 30,
      "retweet_count": 6,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.5991347432136536,
      "original_lang": NaN
    },
    {
      "id": "1913173885060599865",
      "text": "Big win for Indian exporters?\n\n#Kitex 69% Export to USA (My Choice) \n#FazeThree 90% Export\n#PGIL 70% Export \n#IndoCount 94% Exports \n#GokaldasExports  90% Exports\n\n✅ Here’s what Trump’s 26% tariff on India means  for Textile Exporters:\n\n-India now cheaper vs Vietnam, Bangladesh, China in textiles\n\n-Vietnam faces a 46 percent tariff, Bangladesh 37 percent, Cambodia 49 percent, Pakistan 29 per cent  and China 245%\n\n-US buyers shifting orders to India\n\n-Textiles & toys seeing 90-95% capacity utilisation (up from 70%)\n\n-MSMEs flooded with inquiries\n\n-US = 28% of India’s $36B textile exports\n\n-China faces 245% tariff :India becomes top alternative\n\n♦Short-term challenges:\nUS slowdown a risk\n\n🟢Long-term Benefits:\nBig opportunity: Time to invest & scale\n\nKindly REPOST & SHARE",
      "cleaned_text": "big win for indian exporters 69 export to usa my choice 90 export 70 export 94 exports 90 exports here s what trump s 26 tariff on india means for textile exporters india now cheaper vs vietnam bangladesh china in textiles vietnam faces a 46 percent tariff bangladesh 37 percent cambodia 49 percent pakistan 29 per cent and china 245 us buyers shifting orders to india textiles toys seeing 90 95 capacity utilisation up from 70 msmes flooded with inquiries us 28 of india s 36b textile exports china faces 245 tariff india becomes top alternative short term challenges us slowdown a risk long term benefits big opportunity time to invest scale kindly repost share",
      "favorite_count": 299,
      "retweet_count": 39,
      "reply_count": 14,
      "sentiment": "positive",
      "sentiment_score": 0.13818220794200897,
      "original_lang": "en"
    },
    {
      "id": "1913169727616155898",
      "text": "@JA1758 @PeterSchiff @LucaVialli4 What is the target of trump's tariff negotiations?\n\nI assumed that 1) bringing manufacturing jobs back to USA, 2) filling the budget hole with tariffs and 3) reduce the trade deficit.\n\nSo what of these three goals are fulfilled by such \"deal\"?",
      "cleaned_text": " what is the target of trump s tariff negotiations i assumed that 1 bringing manufacturing jobs back to usa 2 filling the budget hole with tariffs and 3 reduce the trade deficit so what of these three goals are fulfilled by such deal ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.09526360034942627,
      "original_lang": "en"
    },
    {
      "id": "1913169609445753329",
      "text": "Delta Air Lines is awaiting delivery of 185 aircraft from French planemaker Airbus, but will refuse to pay additional tariff charges.\n\nSource: Business Traveler USA https://t.co/OqyXnvyxHY",
      "cleaned_text": "delta air lines is awaiting delivery of 185 aircraft from french planemaker airbus but will refuse to pay additional tariff charges source business traveler usa ",
      "favorite_count": 2,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.6455233693122864,
      "original_lang": "en"
    },
    {
      "id": "1913125205792223342",
      "text": "@dearborndenim @mincebill1967 Not for fucking much longer lol better get a usa manufacturer for that stretch shit. Tariff time, homeboy!",
      "cleaned_text": " not for fucking much longer lol better get a usa manufacturer for that stretch shit tariff time homeboy ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.5311799645423889,
      "original_lang": "en"
    },
    {
      "id": "1913120502404575288",
      "text": "A completely different take on Trump’s tariffs\n\nMichael Hudson – Trump’s Inverted View of America’s Tariff History\n\nhttps://t.co/QgWZlv3tJc\n\n#Economics #Tariffs #USA #Trump #Neoliberalism #Monopolies #debt #Workingclass #Geopolitics #Tax #History",
      "cleaned_text": "a completely different take on trump s tariffs michael hudson trump s inverted view of america s tariff history ",
      "favorite_count": 2,
      "retweet_count": 2,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.3854202330112457,
      "original_lang": "en"
    },
    {
      "id": "1913118206937477277",
      "text": "USA tariff plan https://t.co/DA8HZxgE87",
      "cleaned_text": "usa tariff plan ",
      "favorite_count": 182,
      "retweet_count": 4,
      "reply_count": 55,
      "sentiment": "negative",
      "sentiment_score": -0.12277346849441528,
      "original_lang": "en"
    },
    {
      "id": "1913116072485548392",
      "text": "USA China Tariff War: चीन पर नरम पड़े अमेरिका के तेवर? राष्ट्रपति Donald Trump ने कह दी बड़ी बात\n\n#USA #China #TariffWar #DonaldTrump \n\nhttps://t.co/FTrGPi13gS",
      "cleaned_text": "usa china tariff war च न पर नरम पड अम र क क त वर र ष ट रपत donald trump न कह द बड ब त ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.30377572774887085,
      "original_lang": "hi"
    },
    {
      "id": "1913112879181467902",
      "text": "Whether these #tariffs are a temporary negotiating tactic or a fundamental shift in #American #tradepolicy, #reciprocaltariffs are already reshaping global #commerce.\nhttps://t.co/2eurjmTIJ5 \n#trump #tariff #economy #trade #tradepolicy #exports #imports #internationaltrade #USA https://t.co/jDYt74xyux",
      "cleaned_text": "whether these are a temporary negotiating tactic or a fundamental shift in are already reshaping global ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 2,
      "sentiment": "neutral",
      "sentiment_score": -0.027871817350387573,
      "original_lang": "en"
    },
    {
      "id": "1913101515507585210",
      "text": "@TRUMP_ARMY_ @TuckerCarlson If Pierre Poilievre wants to become Governor he should back Our President's inspiring vision for Canada to join the USA ! Trump only wants to protect Canadians from tyranny and a tariff war they can't win! Canada 51st. Panama 52nd. Greenland 53rd. Gaza Riviera 54th. Mars 55th!",
      "cleaned_text": " if pierre poilievre wants to become governor he should back our president s inspiring vision for canada to join the usa trump only wants to protect canadians from tyranny and a tariff war they can t win canada 51st panama 52nd greenland 53rd gaza riviera 54th mars 55th ",
      "favorite_count": 1,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": 0.022993475198745728,
      "original_lang": "en"
    },
    {
      "id": "1913100702164861248",
      "text": "TRUMP: NO RUSH TO ANNOUNCE TRADE DEAL\n\nTRUMP: WILL END UP WITH SUBSTANTIAL NUMBER FOR BASELINE TARIFF\n\n#TrumpTariffs #TrumpRecession #Economy #USA #Trump https://t.co/AkORJYTChp",
      "cleaned_text": "trump no rush to announce trade deal trump will end up with substantial number for baseline tariff ",
      "favorite_count": 6,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.14075574278831482,
      "original_lang": "en"
    },
    {
      "id": "1913093119475597524",
      "text": "1/2 The U.S. carrot-and-stick approach is pragmatic but flawed. Incentives can encourage cooperation, but inconsistency weakens them. Coercion, like coups, brings serious unintended consequences.A more consistent, principled strategy—balancing diplomacy,\n#tariff #tariffwars #USA https://t.co/WmKPRAoo41",
      "cleaned_text": "1 2 the u s carrot and stick approach is pragmatic but flawed incentives can encourage cooperation but inconsistency weakens them coercion like coups brings serious unintended consequences a more consistent principled strategy balancing diplomacy ",
      "favorite_count": 7,
      "retweet_count": 2,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.42415356636047363,
      "original_lang": "en"
    },
    {
      "id": "1913087128101359630",
      "text": "@camangalarvind Tata motors ka 535  का भाव दुबारा नहीं आएगा \nएक रिपोर्ट के मुताबिक भारत, EU k बीच में व्यापार समझोता में भारत में आने वाली कारों के दाम कम हो जायेंगे , इससे tata motors कि जैगुआर कार सस्ती हो जाएगी, टाटा मोटर्स कि सेल बढ़ जाएगी जो USA  tariff कि वजह से कम हो सकती है",
      "cleaned_text": " tata motors ka 535 क भ व द ब र नह आएग एक र प र ट क म त ब क भ रत eu k ब च म व य प र समझ त म भ रत म आन व ल क र क द म कम ह ज य ग इसस tata motors क ज ग आर क र सस त ह ज एग ट ट म टर स क स ल बढ ज एग ज usa tariff क वजह स कम ह सकत ह ",
      "favorite_count": 2,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": 0.014514178037643433,
      "original_lang": "hi"
    },
    {
      "id": "1913068632365752621",
      "text": "How markets have fared since 2/4 “Liberation Day”\nTariff Hike announcement,\nWorst since then and current situation of USA and Asian markets.\n\nMarkets.     Worst.     Now\n\nASPI              -8.75%.   -2.5%\nNikkei.         -12.6%.    -2.8%\nHK.                 -13.8%.    -7.4%\nASX.              -7.6%.       -1.26%\nKospi.           -8.0%.      -.04%\nNifty.             -6.3%.      +1%\nShanghai.   -7.2%.       -1.8%\nDOW.             -10.3%.    -6.8%\nNasdaq.       -12.5%.    -6.6%\n\nMost of the markets dropped by 6-14% and now have recovered to 1-3% still down,\nNifty has recovered and Up 1%.\nOnly HK,Dow and Nasdaq are 6.5-7.5 range down.",
      "cleaned_text": "how markets have fared since 2 4 liberation day tariff hike announcement worst since then and current situation of usa and asian markets markets worst now aspi 8 75 2 5 nikkei 12 6 2 8 hk 13 8 7 4 asx 7 6 1 26 kospi 8 0 04 nifty 6 3 1 shanghai 7 2 1 8 dow 10 3 6 8 nasdaq 12 5 6 6 most of the markets dropped by 6 14 and now have recovered to 1 3 still down nifty has recovered and up 1 only hk dow and nasdaq are 6 5 7 5 range down ",
      "favorite_count": 12,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.2025771588087082,
      "original_lang": "en"
    },
    {
      "id": "1913060711057481773",
      "text": "UPDATE! (only USA)\nStarting April 23rd, there will be an increase in shipping to the USA (the tariff increase of USA to China begins May 2nd). \nOrders placed before April 19th may arrive tariff-free (apparently if your order arrives in US on May 2 or later, customs will charge you the tariff).\nI'll be changing the shipping price when I've the price information (if you make your purchase during those days, it'll be canceled if the tariff increase).\nWe don't know how long the increase will last; that depends on the US, but factories will be looking for ways to ship orders from the US (to avoid big increases).",
      "cleaned_text": "update only usa starting april 23rd there will be an increase in shipping to the usa the tariff increase of usa to china begins may 2nd orders placed before april 19th may arrive tariff free apparently if your order arrives in us on may 2 or later customs will charge you the tariff i ll be changing the shipping price when i ve the price information if you make your purchase during those days it ll be canceled if the tariff increase we don t know how long the increase will last that depends on the us but factories will be looking for ways to ship orders from the us to avoid big increases ",
      "favorite_count": 26,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.14210918545722961,
      "original_lang": "en"
    },
    {
      "id": "1913031066287571190",
      "text": "#Crypto Prices Steadily Rising ✨\n\nIf We Get:\n- Fed Rate Cut ✅\n- USA/China Tariff Deal ✅\n\nWe Might Get An Explosive Move Upwards 📈🌛",
      "cleaned_text": " prices steadily rising if we get fed rate cut usa china tariff deal we might get an explosive move upwards ",
      "favorite_count": 24,
      "retweet_count": 4,
      "reply_count": 3,
      "sentiment": "positive",
      "sentiment_score": 0.3185287415981293,
      "original_lang": "en"
    },
    {
      "id": "1913025804956742090",
      "text": "According to the debate\nWe’re in a \nHousing crisis\nHealthcare crisis\nFentanyl crisis \nAffordability crisis \nImmigration crisis\nMilitary crisis \nTrade crisis\nNational unity crisis \nTariff crisis China &amp; USA\nTHE LIBERALS are responsible for ALL of this\nConservatives are the change",
      "cleaned_text": "according to the debate we re in a housing crisis healthcare crisis fentanyl crisis affordability crisis immigration crisis military crisis trade crisis national unity crisis tariff crisis china amp usa the liberals are responsible for all of this conservatives are the change",
      "favorite_count": 129,
      "retweet_count": 49,
      "reply_count": 4,
      "sentiment": "negative",
      "sentiment_score": -0.5892258882522583,
      "original_lang": "en"
    },
    {
      "id": "1912995049895326064",
      "text": "@MargoMartin47 @GiorgiaMeloni @realDonaldTrump What she meant By \"West\" USA and EU is Miles apart ,  President Trump rightly said EU is reaping USA For a Long Time and US has lost billions in EU , the Tariff will be the right answer against EU",
      "cleaned_text": " what she meant by west usa and eu is miles apart president trump rightly said eu is reaping usa for a long time and us has lost billions in eu the tariff will be the right answer against eu",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.566711962223053,
      "original_lang": "en"
    },
    {
      "id": "1912990198696386808",
      "text": "Freedom Banker, Brett Oland, who is blowing the whistle on Mark Carney's power move AGAINST Canada. He exposes how Mark Carney is putting Canadians at risk and how this relates to the tariff and trade w@r with Donald Trump and the USA. Is Mark Carney is plotting with his European and London Bank of England masters to use Canada to make Europe rich again? We know he had to go to see Europe and Great Britain first. What are they plotting?\n\nOland explains how this is \"colonialism\" that will make Europe rich again and make Canadians poor suckers. If Mark Carney wins, his plot will benefit Mark Carney's Bank of England and European buddies but will shortchange Canadians bank accts as these globalist bankers laugh all the way to the bike shop in Bermuda and the Cayman Islands, taking MORE of our Canadian cash with them. We have the receipts.\n\nWe discuss what will happen with a Poilievre win vs a Carney win for Canadians and our bank accounts.",
      "cleaned_text": "freedom banker brett oland who is blowing the whistle on mark carney s power move against canada he exposes how mark carney is putting canadians at risk and how this relates to the tariff and trade w with donald trump and the usa is mark carney is plotting with his european and london bank of england masters to use canada to make europe rich again we know he had to go to see europe and great britain first what are they plotting oland explains how this is colonialism that will make europe rich again and make canadians poor suckers if mark carney wins his plot will benefit mark carney s bank of england and european buddies but will shortchange canadians bank accts as these globalist bankers laugh all the way to the bike shop in bermuda and the cayman islands taking more of our canadian cash with them we have the receipts we discuss what will happen with a poilievre win vs a carney win for canadians and our bank accounts ",
      "favorite_count": 8,
      "retweet_count": 7,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.5253918170928955,
      "original_lang": "en"
    },
    {
      "id": "1912980578435301515",
      "text": "Good News President Trump Is Talking With China 🇨🇳 &amp; Other Countries To Make The Deals , United We STAND , Let’s GO 🇺🇸 #DonaldTrump #Trump #Tariffs #Tariff #Markets #Fed #President #Potus #Usa #American #International #Crypto #Trade #Stocks #Bonds #Ratecuts #Bullrun #BullMarket https://t.co/gdqGsnmG37",
      "cleaned_text": "good news president trump is talking with china amp other countries to make the deals united we stand let s go ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.22419044375419617,
      "original_lang": "en"
    }
  ]
}