{
  "metadata": {
    "search_query": "WAQF Bill",
    "timestamp": "2025-04-07_09-57-51",
    "total_tweets": 118
  },
  "tweets": [
    {
      "id": "1909099341069078889",
      "text": "The global markets are crashing. So is the Indian market. \nBut India need not worry, after all the government passed the waqf Amendment bill in a marathon late night session in parliament on the day Trump tariffs were rolled out & it did not even utter the word tariff and its impact. \nShut your eyes to reality and chant sab changa si.",
      "cleaned_text": "the global markets are crashing so is the indian market but india need not worry after all the government passed the waqf amendment bill in a marathon late night session in parliament on the day trump tariffs were rolled out it did not even utter the word tariff and its impact shut your eyes to reality and chant sab changa si ",
      "favorite_count": 36,
      "retweet_count": 9,
      "reply_count": 9,
      "sentiment": "negative",
      "sentiment_score": -0.7039315700531006
    },
    {
      "id": "1909097493326856489",
      "text": "@RamshiromniS @grok @srisritulsiji सर्वसम्मति कैसे मान लेंगे जब bill के विरोध में भी मत पड़ते हैं ?\nपहले waqf bill संशोधन सन 1995 व सन 2013 को बीजेपी का समर्थन था संसद में, संसद में हुई बहस में अभी 2,4 दिन पहले हुई बहस में कई वक्ताओं ने यह बात कही है, संसद tv पर जाकर वीडियो देखिए,बजाय अंधभक्ति करने के ?",
      "cleaned_text": " सर वसम मत क स म न ल ग जब bill क व र ध म भ मत पड त ह पहल waqf bill स श धन सन 1995 व सन 2013 क ब ज प क समर थन थ स सद म स सद म ह ई बहस म अभ 2 4 द न पहल ह ई बहस म कई वक त ओ न यह ब त कह ह स सद tv पर ज कर व ड य द ख ए बज य अ धभक त करन क ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.06316833198070526
    },
    {
      "id": "1909097090342433139",
      "text": "🚨HUGE Support for the Waqf Amendment Bill in Shaheen Bagh!! 🔥✨\n\n— The All India Muslim Women Personal Law Board (AIMWPLB) has come forward and shown their FULL SUPPORT for the Bill! 🙌💪\n\n— After decades of silence and neglect, even members of the Muslim community are saying YES to the TRUTH — finally, justice is shining through! 🌟✅✊\n\nTRUTH WINS — no more hiding, no more fear! 👌❤️🔥",
      "cleaned_text": " huge support for the waqf amendment bill in shaheen bagh the all india muslim women personal law board aimwplb has come forward and shown their full support for the bill after decades of silence and neglect even members of the muslim community are saying yes to the truth finally justice is shining through truth wins no more hiding no more fear ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.19884705543518066
    },
    {
      "id": "1909093956794597607",
      "text": "🚨 MASSIVE Support for Waqf Amendment Bill in Shaheen Bagh 🔥\n\n— All India Muslim Women Personal Law Board (AIMWPLB) has also announced its SUPPORT to the Bill.\n\n— After decades of neglect, even some Muslims are backing the Bill - TRUTH wins, finally 👌 https://t.co/NfLGe2gcOa",
      "cleaned_text": " massive support for waqf amendment bill in shaheen bagh all india muslim women personal law board aimwplb has also announced its support to the bill after decades of neglect even some muslims are backing the bill truth wins finally ",
      "favorite_count": 631,
      "retweet_count": 133,
      "reply_count": 17,
      "sentiment": "positive",
      "sentiment_score": 0.22953593730926514
    },
    {
      "id": "1909092288359231934",
      "text": "@RamshiromniS @grok @srisritulsiji ऐसा किसने कहा?\nक्या waqf bill सर्व सम्मति से पास हुआ है,?\nमुझे तो आप जड़ मूर्ख लग रहे हो,आपको यही नहीं पता कि bill पास कराने के लिए सर्वसम्मति जरूरी नहीं होती,सदन में उपस्थित सदस्यों की एक निश्चित संख्या के समर्थन से bill पास हो जाता है?\nमैने अमर उजाला की खबर लगाई है,यह विधेयक1/2",
      "cleaned_text": " ऐस क सन कह क य waqf bill सर व सम मत स प स ह आ ह म झ त आप जड म र ख लग रह ह आपक यह नह पत क bill प स कर न क ल ए सर वसम मत जर र नह ह त सदन म उपस थ त सदस य क एक न श च त स ख य क समर थन स bill प स ह ज त ह म न अमर उज ल क खबर लग ई ह यह व ध यक1 2",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.05924484133720398
    },
    {
      "id": "1909092036051112327",
      "text": "A sitting MP asked Owaisi to do something against WAQF amendment bill.!!\n\nThese are the selfish leaders, who destroy the country in the name of appeasement.!! 🤬 https://t.co/v36F9jbMyY",
      "cleaned_text": "a sitting mp asked owaisi to do something against waqf amendment bill these are the selfish leaders who destroy the country in the name of appeasement ",
      "favorite_count": 20,
      "retweet_count": 9,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8680623769760132
    },
    {
      "id": "1909092004874551345",
      "text": "Waqf bill oppose krne wale #WaqfAmendmentBill https://t.co/qCvcdlvQR9",
      "cleaned_text": "waqf bill oppose krne wale ",
      "favorite_count": 10,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.10879361629486084
    },
    {
      "id": "1909091523288879570",
      "text": "#TheBreakfastShow with @radhika1705 and @divyawadhwa | Several Pleas Filed In Supreme Court Challenging Constitutional Validity Of Waqf Bill \n\n@nupurdogra and  @jsamdaniel report https://t.co/CixyFJckpw",
      "cleaned_text": " with and several pleas filed in supreme court challenging constitutional validity of waqf bill and report ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.2816704213619232
    },
    {
      "id": "1909091037898846606",
      "text": "After his stand on the Waqf bill, one thing is clear that the man is a hero in both politics and films https://t.co/9M9LHCkdIc",
      "cleaned_text": "after his stand on the waqf bill one thing is clear that the man is a hero in both politics and films ",
      "favorite_count": 10,
      "retweet_count": 2,
      "reply_count": 1,
      "sentiment": "positive",
      "sentiment_score": 0.5938777923583984
    },
    {
      "id": "1909090497634656427",
      "text": "Jungle Raj Continues in Manipur -\n\nRadical Muslim mob burns down house of BJP Minority Morcha President Asker Ali for supporting Waqf Amendment Bill. https://t.co/xFOXMDSDCa",
      "cleaned_text": "jungle raj continues in manipur radical muslim mob burns down house of bjp minority morcha president asker ali for supporting waqf amendment bill ",
      "favorite_count": 56,
      "retweet_count": 15,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.7568750381469727
    },
    {
      "id": "1909088029593006189",
      "text": "Wrote a short piece on the waqf amendment bill.\n\nhttps://t.co/eAvAxyYyHI",
      "cleaned_text": "wrote a short piece on the waqf amendment bill ",
      "favorite_count": 7,
      "retweet_count": 4,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": -0.005230650305747986
    },
    {
      "id": "1909086671464735181",
      "text": "Members of the Muslim community welcomed the Waqf Bill in Sultanpur, Madhya Pradesh. This video is NOT good for Liberals\nhttps://t.co/b4B4odJDHI",
      "cleaned_text": "members of the muslim community welcomed the waqf bill in sultanpur madhya pradesh this video is not good for liberals ",
      "favorite_count": 7,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.40096455812454224
    },
    {
      "id": "1909085503757877465",
      "text": "The Wait is Over !!\n\nBIHAR SNAP POLL data is ready!!\n\nNew Waqf Bill is rewriting political equations on ground.\n\nWho will form Govt in Bihar? \n\nBihar Snap Poll on all 243 seats today at 6 pm.\n\nFollow @deepdownanlyz for all updates and STAY TUNED !!",
      "cleaned_text": "the wait is over bihar snap poll data is ready new waqf bill is rewriting political equations on ground who will form govt in bihar bihar snap poll on all 243 seats today at 6 pm follow for all updates and stay tuned ",
      "favorite_count": 36,
      "retweet_count": 4,
      "reply_count": 1,
      "sentiment": "positive",
      "sentiment_score": 0.11540098488330841
    },
    {
      "id": "1909083845112328406",
      "text": "Waqf Bill becomes law amid protests. Watch this report. \n\n#WaqfBill #WaqfAmendmentBill #ITVideo #FirstUp https://t.co/QuUKDuUBDf",
      "cleaned_text": "waqf bill becomes law amid protests watch this report ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": 0.003558710217475891
    },
    {
      "id": "1909082796439543914",
      "text": "The house of Manipur BJP Minority Morcha president Mohd Asker Ali was set on fire by an irate radical mob on Sunday night allegedly for supporting the Waqf Amendment Bill.\n\nHe had to apologise via FB post &amp; withdraw support https://t.co/gEjHqFMGYm",
      "cleaned_text": "the house of manipur bjp minority morcha president mohd asker ali was set on fire by an irate radical mob on sunday night allegedly for supporting the waqf amendment bill he had to apologise via fb post amp withdraw support ",
      "favorite_count": 469,
      "retweet_count": 184,
      "reply_count": 18,
      "sentiment": "negative",
      "sentiment_score": -0.785388708114624
    },
    {
      "id": "1909081084014321873",
      "text": "Could they stop Waqf Amendment Bill to pass ???\nPappu and Pinky ran away. https://t.co/p2fNY4j7Xs",
      "cleaned_text": "could they stop waqf amendment bill to pass pappu and pinky ran away ",
      "favorite_count": 74,
      "retweet_count": 17,
      "reply_count": 15,
      "sentiment": "negative",
      "sentiment_score": -0.5690534114837646
    },
    {
      "id": "1909076922841149864",
      "text": "#TheBreakfastShow with @radhika1705 and @divyawadhwa | Several Pleas Filed In Supreme Court Challenging Constitutional Validity Of Waqf Bill \n\n@nupurdogra and @jsamdaniel report https://t.co/p9uhLumZS2",
      "cleaned_text": " with and several pleas filed in supreme court challenging constitutional validity of waqf bill and report ",
      "favorite_count": 3,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.2816704213619232
    },
    {
      "id": "1909075739556680170",
      "text": "माना जाता है कि उनकी सेहत ठीक नहीं है। लेकिन फिर भी वे Waqf  Bill Amendment के खिलाफ वोट देने के लिए रात 1 बजे संसद में वापस आईं \n\nयह संविधान के प्रति उनका समर्पण नहीं है। यह तुष्टिकरण और भ्रष्ट वक्फ बोर्ड की भूमि जिहाद के प्रति उनका समर्पण है। \n\nउनके बेटे के साथ भी ऐसा ही है! https://t.co/WdeieLsiR3",
      "cleaned_text": "म न ज त ह क उनक स हत ठ क नह ह ल क न फ र भ व waqf bill amendment क ख ल फ व ट द न क ल ए र त 1 बज स सद म व पस आई यह स व ध न क प रत उनक समर पण नह ह यह त ष ट करण और भ रष ट वक फ ब र ड क भ म ज ह द क प रत उनक समर पण ह उनक ब ट क स थ भ ऐस ह ह ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.09201401472091675
    },
    {
      "id": "1909065970053771738",
      "text": "Waqf Bill के खिलाफ Supreme Court पहुँचा All India Muslim Personal Law Board\n#WaqfBill #AIMPLB #Muslim #SupremeCourt \n@RajLaveena https://t.co/4lW1moJzn6",
      "cleaned_text": "waqf bill क ख ल फ supreme court पह च all india muslim personal law board ",
      "favorite_count": 6,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.08637475967407227
    },
    {
      "id": "1909062676778541290",
      "text": "#Bihar CM Nitish Kumar #Waqf_Bill ki Parliament me tayeed karne par, Musalmaan'on me Gham o Gussa aur Kolkata me kiya Ehtejaj. https://t.co/Bj7LYmjphK",
      "cleaned_text": " cm nitish kumar ki parliament me tayeed karne par musalmaan on me gham o gussa aur kolkata me kiya ehtejaj ",
      "favorite_count": 6,
      "retweet_count": 5,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": -0.01088494062423706
    },
    {
      "id": "1909059141995290829",
      "text": "Fresh Plea Filed In Supreme Court Challenging Constitutional Validity Of Waqf Bill  \n\n@nupurdogra reports https://t.co/bDEkqAvPGb",
      "cleaned_text": "fresh plea filed in supreme court challenging constitutional validity of waqf bill reports ",
      "favorite_count": 7,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.32549288868904114
    },
    {
      "id": "1909054907060994463",
      "text": "Waqf Amendment Bill: वक्फ बिल पर अंदर की बात समझिए, सबसे भरोसेमंद Report... https://t.co/hSkmB89Scw via @YouTube",
      "cleaned_text": "waqf amendment bill वक फ ब ल पर अ दर क ब त समझ ए सबस भर स म द report via ",
      "favorite_count": 3,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.0635073333978653
    },
    {
      "id": "1909050724912160831",
      "text": "Too Much Democracy under  Yogi Adityanath 😳\n\nToo much  love from  Narendra Modi for you Muslim community .\n\nBe assured this news won't be available on Godi Media \n\n\" Over 300 in UP’s ,Muzzafarnagar told to furnish Rs 2 lakh bond for ‘protesting’ against the Waqf Bill\" https://t.co/hjOPtB04GG",
      "cleaned_text": "too much democracy under yogi adityanath too much love from narendra modi for you muslim community be assured this news won t be available on godi media over 300 in up s muzzafarnagar told to furnish rs 2 lakh bond for protesting against the waqf bill ",
      "favorite_count": 14,
      "retweet_count": 11,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.19833245873451233
    },
    {
      "id": "1909049523923464635",
      "text": "BIG BREAKING \n\nTrends have started coming \n\nAfter supporting the Waqf Amendment Bill, many leaders have resigned from the RLD, JDU and LJP. \n\nThese leaders say that the party has broken the trust of millions of Muslims all over the country. https://t.co/0ZQDfNvAek",
      "cleaned_text": "big breaking trends have started coming after supporting the waqf amendment bill many leaders have resigned from the rld jdu and ljp these leaders say that the party has broken the trust of millions of muslims all over the country ",
      "favorite_count": 4,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.8469606637954712
    },
    {
      "id": "1909046552221413810",
      "text": "SIO DU students participated in a joint protest against the Waqf Amendment Bill.\n\nFrom campuses and streets to the court, we stand united in resistance and will not let this injustice pass in silence.\n#WaqfAmendmentBill\n#RejectWaqfBill https://t.co/fm9Dh4B2hj",
      "cleaned_text": "sio du students participated in a joint protest against the waqf amendment bill from campuses and streets to the court we stand united in resistance and will not let this injustice pass in silence ",
      "favorite_count": 4,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.37523379921913147
    },
    {
      "id": "1909041766415614420",
      "text": "🔸Ashraf community is in shock over WAQF bill\n\n😎",
      "cleaned_text": " ashraf community is in shock over waqf bill ",
      "favorite_count": 127,
      "retweet_count": 11,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.5768910646438599
    },
    {
      "id": "1909023690089550086",
      "text": "🔸WAQF Bill stats\n\n- 1.2Cr emails were sent to JPC\n- 75k letters were sent to JPC\n\nMeans 95% did not even bother to email\nMeans 99.99625% did not bother to send a letter\n\nऐसे चलेगा अम्मा?\n\n😎🚀",
      "cleaned_text": " waqf bill stats 1 2cr emails were sent to jpc 75k letters were sent to jpc means 95 did not even bother to email means 99 99625 did not bother to send a letter ऐस चल ग अम म ",
      "favorite_count": 105,
      "retweet_count": 30,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.31223881244659424
    },
    {
      "id": "1909003447455674749",
      "text": "That world belongs to US Indians …..  Not people who demanded for separation and mow eyes another one in good faith .  \n\nWaqf bill is kind of bill creating another pakistan in india \n\nThats how i see it No organization should control land . You want land donated should be done legally with papers . Show the papers land is yours if not land belong to real owners or GOVT .",
      "cleaned_text": "that world belongs to us indians not people who demanded for separation and mow eyes another one in good faith waqf bill is kind of bill creating another pakistan in india thats how i see it no organization should control land you want land donated should be done legally with papers show the papers land is yours if not land belong to real owners or govt ",
      "favorite_count": 11,
      "retweet_count": 1,
      "reply_count": 3,
      "sentiment": "negative",
      "sentiment_score": -0.17567428946495056
    },
    {
      "id": "1908995631441711250",
      "text": "More than 300 residents of Uttar Pradesh’s Muzaffarnagar district have been told to furnish a bond of Rs 2 lakh each after they allegedly wore black armbands to protest the Waqf Amendment Bill, The Times of India reported on Saturday.\n\nhttps://t.co/V9K4GtCxN2",
      "cleaned_text": "more than 300 residents of uttar pradesh s muzaffarnagar district have been told to furnish a bond of rs 2 lakh each after they allegedly wore black armbands to protest the waqf amendment bill the times of india reported on saturday ",
      "favorite_count": 1,
      "retweet_count": 3,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.39818263053894043
    },
    {
      "id": "1908983270014136489",
      "text": "Why are the muslims of UP NOT protesting on the passing of WAQF Bill?\nWhy are the muslims of West Bengal protesting over it?\nThis explains a lot about hate-Modi leaders triggering protests on fake stories.",
      "cleaned_text": "why are the muslims of up not protesting on the passing of waqf bill why are the muslims of west bengal protesting over it this explains a lot about hate modi leaders triggering protests on fake stories ",
      "favorite_count": 24,
      "retweet_count": 3,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8423286080360413
    },
    {
      "id": "1908976755810955353",
      "text": "Rahul Gandhi, Pinarayi Vijayan warn Waqf Bill, RSS article signal dangerous trend of targeting minorities, urging secular forces to unite\n\nRead more about it here:\nhttps://t.co/HhYErUVxbe https://t.co/6JcK7LWUio",
      "cleaned_text": "rahul gandhi pinarayi vijayan warn waqf bill rss article signal dangerous trend of targeting minorities urging secular forces to unite read more about it here ",
      "favorite_count": 24,
      "retweet_count": 3,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.6179652214050293
    },
    {
      "id": "1908974974699966975",
      "text": "Mafiveer RSS pulling down that Organiser piece claiming churches own more land than Waqf is peak slyness i.e. a cheap trick to turn Christians against Muslims over the Waqf Bill. Their Hindutva hate machine rolls on, ... https://t.co/7O82i8vZMN",
      "cleaned_text": "mafiveer rss pulling down that organiser piece claiming churches own more land than waqf is peak slyness i e a cheap trick to turn christians against muslims over the waqf bill their hindutva hate machine rolls on ",
      "favorite_count": 3,
      "retweet_count": 2,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.8007568120956421
    },
    {
      "id": "1908967987547087306",
      "text": "Waqf Bill Sparks Outrage in Manipur: BJP Leader’s Home Torched Amid Protests https://t.co/2mPSLflK37 #ManipurProtests #ReligiousFreedom \n#MeiteiPangalVoices #RepealWaqfBill",
      "cleaned_text": "waqf bill sparks outrage in manipur bjp leader s home torched amid protests ",
      "favorite_count": 8,
      "retweet_count": 7,
      "reply_count": 3,
      "sentiment": "negative",
      "sentiment_score": -0.7863337397575378
    },
    {
      "id": "1908967152859693366",
      "text": "Waqf Bill Sparks Outrage in Manipur: BJP Leader’s Home Torched Amid Protests https://t.co/6y0VtQgbag #WaqfBill2025 \n#ManipurProtests #ReligiousFreedom \n#MeiteiPangalVoices #RepealWaqfBill",
      "cleaned_text": "waqf bill sparks outrage in manipur bjp leader s home torched amid protests ",
      "favorite_count": 3,
      "retweet_count": 2,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.7863337397575378
    },
    {
      "id": "1908964626915611117",
      "text": "Indian Tarrorist 🚩\n\n#SRHvsGT Siraj Corruption Waqf Bill https://t.co/LpUOB7lMgo",
      "cleaned_text": "indian tarrorist siraj corruption waqf bill ",
      "favorite_count": 2,
      "retweet_count": 2,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.7024014592170715
    },
    {
      "id": "1908963334033985581",
      "text": "Indian Tarrorist 🚩\n\n#SRHvsGT Siraj Corruption Waqf Bill https://t.co/yHUqcvvJlK",
      "cleaned_text": "indian tarrorist siraj corruption waqf bill ",
      "favorite_count": 2,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.7024014592170715
    },
    {
      "id": "1908961707827073270",
      "text": "WE STAND AGAINST THE WAQF BILL\nمسلمانوں کے اوقاف پر حملہ ہرگز برداشت نہیں! https://t.co/T9SJB4cEO3",
      "cleaned_text": "we stand against the waqf bill مسلمانوں کے اوقاف پر حملہ ہرگز برداشت نہیں ",
      "favorite_count": 3,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8055943250656128
    },
    {
      "id": "1908961279227609486",
      "text": "Indian Tarrorist 🚩\n\n#SRHvsGT Siraj Corruption Waqf Bill https://t.co/HpAPmBNwQJ",
      "cleaned_text": "indian tarrorist siraj corruption waqf bill ",
      "favorite_count": 4,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.7024014592170715
    },
    {
      "id": "1908958655279722882",
      "text": "@thekaipullai Everything can be done with respect to section 12 but the companies get away by putting Cash in judges bungalow in lutyens.\n\nModi who claims to be a champion of removing old archaic laws and will sit till 3 a.m at midnight for Waqf Amendment bill gleefully ignores section 12.",
      "cleaned_text": " everything can be done with respect to section 12 but the companies get away by putting cash in judges bungalow in lutyens modi who claims to be a champion of removing old archaic laws and will sit till 3 a m at midnight for waqf amendment bill gleefully ignores section 12 ",
      "favorite_count": 17,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.4920159578323364
    },
    {
      "id": "1908958073122594912",
      "text": "The passage of the contentious Waqf Bill: Another Hindutva conspiracy against India's Muslims #OPINION by P. K. Niaz https://t.co/2ND2lk41Zo",
      "cleaned_text": "the passage of the contentious waqf bill another hindutva conspiracy against india s muslims by p k niaz ",
      "favorite_count": 6,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.6175602078437805
    },
    {
      "id": "1908950626752409884",
      "text": "@jpsin1 @Telamundo152890 By this exerise will come to know the names and faces who believe in secularism which is basic feature of constitution.\nThose who did not participate in freedom movement don't believe in secularism. So be it.\nIn LS there are only 24 Muslim MPs but 232 voted against the waqf bill.",
      "cleaned_text": " by this exerise will come to know the names and faces who believe in secularism which is basic feature of constitution those who did not participate in freedom movement don t believe in secularism so be it in ls there are only 24 muslim mps but 232 voted against the waqf bill ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 6,
      "sentiment": "negative",
      "sentiment_score": -0.4174301028251648
    },
    {
      "id": "1908950357935342037",
      "text": "The house of #Manipur BJP Minority Morcha president Mohd Asker Ali was set on fire by an irate mob on Sunday night allegedly for supporting the Waqf Amendment Bill. The incident happened at Lilong in Thoubal district.\n\nFacing backlash from his community, the Meitei-Pangal (Manipuri Muslim) leader later posted a video on Facebook apologizing for his stance and retracting his support.\n\n#WaqfAmendmentBill #WaqfBoard  #WaqfBill #IndiaTodayNE\n\nDetailed story - https://t.co/S3cbDiNmnO",
      "cleaned_text": "the house of bjp minority morcha president mohd asker ali was set on fire by an irate mob on sunday night allegedly for supporting the waqf amendment bill the incident happened at lilong in thoubal district facing backlash from his community the meitei pangal manipuri muslim leader later posted a video on facebook apologizing for his stance and retracting his support detailed story ",
      "favorite_count": 12,
      "retweet_count": 6,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.6281184554100037
    },
    {
      "id": "1908949892484964504",
      "text": "सवाल:- क्या ये भारत के भगवा आतंकवादी कभी सुधरेंगे?\n\nजवाब:- नहीं कभी नहीं सुधरेंगे\n\nअगर हमारी बातों पे यकीन नहीं है तो \n•देख लेना दीवाली में \n•देख लेना होली में \n•देख लेना राम नवमी के दिन\n\nये ज़रूर कही न कही उत्पाद करते हुवे नज़र आएंगे\n\n#SRHvsGT Siraj Corruption Waqf Bill https://t.co/RBTzxoamUT",
      "cleaned_text": "सव ल क य य भ रत क भगव आत कव द कभ स धर ग जव ब नह कभ नह स धर ग अगर हम र ब त प यक न नह ह त द ख ल न द व ल म द ख ल न ह ल म द ख ल न र म नवम क द न य ज र र कह न कह उत प द करत ह व नज र आए ग siraj corruption waqf bill ",
      "favorite_count": 2,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.06397250294685364
    },
    {
      "id": "1908949352568979846",
      "text": "#वक्फ_संशोधन अधिनियम किसी भी समुदाय के खिलाफ नहीं है मुस्लिम समुदाय \n भी समर्थन दिखा रही है @narendramodi @BJP4Odisha @BJPMinMorcha @JamalSiddiqui_ @KirenRijiju @MohanMOdisha @sikandarbjp77IN #WaqfAmendmentBill #WaqfBillAmendment #WAQF_Amendment_Bill #WaqfAmendmentBill2025 #Waqf https://t.co/OVhisFe32f",
      "cleaned_text": " फ_स श धन अध न यम क स भ सम द य क ख ल फ नह ह म स ल म सम द य भ समर थन द ख रह ह ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": -0.034225791692733765
    },
    {
      "id": "1908948873680150701",
      "text": "सवाल:- क्या ये भारत के भगवा आतंकवादी कभी सुधरेंगे?\n\nजवाब:- नहीं कभी नहीं सुधरेंगे\n\nअगर हमारी बातों पे यकीन नहीं है तो \n•देख लेना दीवाली में \n•देख लेना होली में \n•देख लेना राम नवमी के दिन\n\nये ज़रूर कही न कही उत्पाद करते हुवे नज़र आएंगे\n\n#SRHvsGT Siraj Corruption Waqf Bill https://t.co/BlwAiz2s0E",
      "cleaned_text": "सव ल क य य भ रत क भगव आत कव द कभ स धर ग जव ब नह कभ नह स धर ग अगर हम र ब त प यक न नह ह त द ख ल न द व ल म द ख ल न ह ल म द ख ल न र म नवम क द न य ज र र कह न कह उत प द करत ह व नज र आए ग siraj corruption waqf bill ",
      "favorite_count": 2,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.06397250294685364
    },
    {
      "id": "1908947927562703290",
      "text": "@AugadhBhudeva Hypocrisy of Congress. The Congress brought in the Waqf Board, then they amended the bill a couple of times, now when the BJP went on to amend the bill they find it unconstitutional.",
      "cleaned_text": " hypocrisy of congress the congress brought in the waqf board then they amended the bill a couple of times now when the bjp went on to amend the bill they find it unconstitutional ",
      "favorite_count": 1,
      "retweet_count": 2,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.9044542908668518
    },
    {
      "id": "1908947826551484444",
      "text": "सवाल:- क्या ये भारत के भगवा आतंकवादी कभी सुधरेंगे?\n\nजवाब:- नहीं कभी नहीं सुधरेंगे\n\nअगर हमारी बातों पे यकीन नहीं है तो \n•देख लेना दीवाली में \n•देख लेना होली में \n•देख लेना राम नवमी के दिन\n\nये ज़रूर कही न कही उत्पाद करते हुवे नज़र आएंगे\n\n#SRHvsGT Siraj Corruption Waqf Bill https://t.co/VwZukAMap4",
      "cleaned_text": "सव ल क य य भ रत क भगव आत कव द कभ स धर ग जव ब नह कभ नह स धर ग अगर हम र ब त प यक न नह ह त द ख ल न द व ल म द ख ल न ह ल म द ख ल न र म नवम क द न य ज र र कह न कह उत प द करत ह व नज र आए ग siraj corruption waqf bill ",
      "favorite_count": 2,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.06397250294685364
    },
    {
      "id": "1908945048273637840",
      "text": "सवाल:- क्या ये भारत के भगवा आतंकवादी कभी सुधरेंगे?\n\nजवाब:- नहीं कभी नहीं सुधरेंगे\n\nअगर हमारी बातों पे यकीन नहीं है तो \n•देख लेना दीवाली में \n•देख लेना होली में \n•देख लेना राम नवमी के दिन\n\nये ज़रूर कही न कही उत्पाद करते हुवे नज़र आएंगे\n\n#SRHvsGT Siraj Corruption Waqf Bill https://t.co/mdVDtgf9Ck",
      "cleaned_text": "सव ल क य य भ रत क भगव आत कव द कभ स धर ग जव ब नह कभ नह स धर ग अगर हम र ब त प यक न नह ह त द ख ल न द व ल म द ख ल न ह ल म द ख ल न र म नवम क द न य ज र र कह न कह उत प द करत ह व नज र आए ग siraj corruption waqf bill ",
      "favorite_count": 3,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.06397250294685364
    },
    {
      "id": "1908944966849638743",
      "text": "@ANI Why don't you make public the details of the 50 million emails that Muslims sent to the JPC in opposition to the Waqf Bill?\nThe bill for electoral bonds was also passed by Parliament with a majority, but the Supreme Court declared it unconstitutional\n1 \n#SayNoToWaqfBill\n#WaqfBill",
      "cleaned_text": " why don t you make public the details of the 50 million emails that muslims sent to the jpc in opposition to the waqf bill the bill for electoral bonds was also passed by parliament with a majority but the supreme court declared it unconstitutional 1 ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8545608520507812
    },
    {
      "id": "1908944966425915815",
      "text": "Bihar Politics Faces Bold Shift after Nitish Backs Waqf Bill 2025 #BiharNews #BiharPolitics\n\nhttps://t.co/x9UMMinI9W",
      "cleaned_text": "bihar politics faces bold shift after nitish backs waqf bill 2025 ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.05717223882675171
    },
    {
      "id": "1908943366844280902",
      "text": "WE STAND AGAINST THE WAQF BILL\nمسلمانوں کے اوقاف پر حملہ ہرگز برداشت نہیں!\n\nWaqf properties are a sacred trust, not for sale, not for compromise. Defending them is our religious, legal, and moral responsibility.\n\n— Grand Mufti of India\nMufti Asjad Raza Khan Qadiri (Hafidahullah) https://t.co/NorGzbkz3j",
      "cleaned_text": "we stand against the waqf bill مسلمانوں کے اوقاف پر حملہ ہرگز برداشت نہیں waqf properties are a sacred trust not for sale not for compromise defending them is our religious legal and moral responsibility grand mufti of india mufti asjad raza khan qadiri hafidahullah ",
      "favorite_count": 1,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.6170063018798828
    },
    {
      "id": "1908939641308495878",
      "text": "Just two days ago, the anti-Muslim Waqf Bill was passed in India, and today, the Hindutva extremists with saffron flags on top of a mosque. In Uttar Pradesh\n\nhttps://t.co/PBqE1gKMvv",
      "cleaned_text": "just two days ago the anti muslim waqf bill was passed in india and today the hindutva extremists with saffron flags on top of a mosque in uttar pradesh ",
      "favorite_count": 31,
      "retweet_count": 7,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.4481292963027954
    },
    {
      "id": "1908938380240449592",
      "text": "🚩Some published news regarding  the role of Hindu Janajagruti Samiti about the #WaqfAmendmentBill2025\n\n♦️Mumbai News: @HinduJagrutiOrg Seeks Further Amendments In Waqf Bill, Demands Protection Of Hindu-Owned lands\n\nhttps://t.co/bUKNMS8q9M\n\n♦️https://t.co/XPyzQ5KY57\n\n महाराष्ट्रातील किती मंदिरांवर वक्फ बोर्डाचा दावा?\n\n#WaqfAmendmentBill \n#WaqfBill",
      "cleaned_text": " some published news regarding the role of hindu janajagruti samiti about the mumbai news seeks further amendments in waqf bill demands protection of hindu owned lands मह र ष ट र त ल क त म द र वर वक फ ब र ड च द व ",
      "favorite_count": 30,
      "retweet_count": 25,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.05991639196872711
    },
    {
      "id": "1908938259943596051",
      "text": "Transparency without technology is just a buzzword. The 2025 Bill mandates geo-tagging of all Waqf properties, ensuring location, boundaries, and ownership records are out in the open—accessible to citizens, auditors, and courts alike.\n\nNo more invisible assets. In the age of AI, even accountability needs coordinates. #WaqfAmendmentBill",
      "cleaned_text": "transparency without technology is just a buzzword the 2025 bill mandates geo tagging of all waqf properties ensuring location boundaries and ownership records are out in the open accessible to citizens auditors and courts alike no more invisible assets in the age of ai even accountability needs coordinates ",
      "favorite_count": 147,
      "retweet_count": 21,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.16567400097846985
    },
    {
      "id": "1908938179907908090",
      "text": "VIDEO | “Waqf Bill was passed by Lok Sabha and Rajya Sabha. A stamp has been put on that now, but this issue will go to the Supreme Court. I hope SC will provide justice to those,” says TMC leader Shatrughan Sinha.\n\n(Full video available on PTI Videos - https://t.co/dv5TRARJn4) https://t.co/LDZkWnyfmo",
      "cleaned_text": "video waqf bill was passed by lok sabha and rajya sabha a stamp has been put on that now but this issue will go to the supreme court i hope sc will provide justice to those says tmc leader shatrughan sinha full video available on pti videos ",
      "favorite_count": 13,
      "retweet_count": 3,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": -0.004098832607269287
    },
    {
      "id": "1908936772039352529",
      "text": "#WATCH | Lucknow | On Waqf Amendment Bill, BJP MP Dinesh Sharma says, \"This Bill was supported by the country's backward classes, divorced and widowed women, homeless, Shia, Sunni, Ahmed section of Muslims... The politicians should learn from this that the Bill was for the empowerment of Muslims... This is the victory of all Indians... \"",
      "cleaned_text": " lucknow on waqf amendment bill bjp mp dinesh sharma says this bill was supported by the country s backward classes divorced and widowed women homeless shia sunni ahmed section of muslims the politicians should learn from this that the bill was for the empowerment of muslims this is the victory of all indians ",
      "favorite_count": 25,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": -0.005607694387435913
    },
    {
      "id": "1908935839456915683",
      "text": "Breaking:\n\nAn angry mob of Lilong set fire to the house of @BJPManipur Minority Morcha President, Mr. Askar Ali Mkm for insulting fellow community & supporting the recently passed Waqf (Amendment) Bill, 2025. \n\n@rashtrapatibhvn @INCIndia @INCMinority @INCAdivasi @the_hindu @power_corridors @thewire_in @PTI_News",
      "cleaned_text": "breaking an angry mob of lilong set fire to the house of minority morcha president mr askar ali mkm for insulting fellow community supporting the recently passed waqf amendment bill 2025 ",
      "favorite_count": 75,
      "retweet_count": 47,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8187186121940613
    },
    {
      "id": "1908934242442092981",
      "text": "Indian state-sponsored discriminatory policies & toxic politics is depriving Muslims of their legal rights. Recently passed Waqf (Amendment) Bill aims at changing ownership of properties worth billions of dollars donated by Muslims over centuries. BJP govt. must be held accountable to international forums for systematically discriminating against #Muslims.\n#Islamophobia\n#WaqfAmendmentBill #WaqfBill2025",
      "cleaned_text": "indian state sponsored discriminatory policies toxic politics is depriving muslims of their legal rights recently passed waqf amendment bill aims at changing ownership of properties worth billions of dollars donated by muslims over centuries bjp govt must be held accountable to international forums for systematically discriminating against ",
      "favorite_count": 41,
      "retweet_count": 21,
      "reply_count": 4,
      "sentiment": "negative",
      "sentiment_score": -0.8785566687583923
    },
    {
      "id": "1908932340447068528",
      "text": "To effectively raise voices against the Waqf Amendment Bill and address community concerns, @AIMPLB_Official should set up state and district-level committees. Grassroots connection is the need of the hour.\n\n#WaqfAmendmentBill\n#WaqfBoard",
      "cleaned_text": "to effectively raise voices against the waqf amendment bill and address community concerns should set up state and district level committees grassroots connection is the need of the hour ",
      "favorite_count": 6,
      "retweet_count": 3,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": 0.044601500034332275
    },
    {
      "id": "1908930192770277874",
      "text": "Waqf Bill ke khilaf Manipur mein jabardast pradarshan\n#WaqfBill  #RejectWaqfBill https://t.co/iscetCyL0c",
      "cleaned_text": "waqf bill ke khilaf manipur mein jabardast pradarshan ",
      "favorite_count": 21,
      "retweet_count": 6,
      "reply_count": 25,
      "sentiment": "positive",
      "sentiment_score": 0.1383964717388153
    },
    {
      "id": "1908928258550222940",
      "text": "Threatening citizens with Jallianwala Bagh for protesting the Waqf Bill? That’s not leadership it’s tyranny. The Constitution gives us the right to protest — don’t twist history to justify fear.\n#StandForDemocracy #WaqfBill #WeThePeople \n#failNeta @sanjaynirupam \n@CMOMaharashtra https://t.co/TNEOJLjZNN",
      "cleaned_text": "threatening citizens with jallianwala bagh for protesting the waqf bill that s not leadership it s tyranny the constitution gives us the right to protest don t twist history to justify fear ",
      "favorite_count": 10,
      "retweet_count": 2,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.8432014584541321
    },
    {
      "id": "1908927717791199356",
      "text": "Tejashwi yadav on waqf bill.\n\n#tejashwiyadav #tejashwi #waqfbill #waqf #iip #insightindiapress #news #bjp #modi #bihar https://t.co/ZUnsZ3iKzf",
      "cleaned_text": "tejashwi yadav on waqf bill ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.07003851234912872
    },
    {
      "id": "1908926606778790270",
      "text": "Exactly, India could've just gulaged your types and threw away the key. But why didn't they? Price of free speech baby. WAQF bill had 230+ naysayers, that alone should give you an answer. Stop crying about China, we ain't even running the same race.\nhttps://t.co/cqgtHNoSGM",
      "cleaned_text": "exactly india could ve just gulaged your types and threw away the key but why didn t they price of free speech baby waqf bill had 230 naysayers that alone should give you an answer stop crying about china we ain t even running the same race ",
      "favorite_count": 15,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8209360241889954
    },
    {
      "id": "1908926592228766013",
      "text": "The new Waqf Bill. In short, anything that benefits the Muslim community will be opposed by the political leadership of Muslims..\nhttps://t.co/h57sJCpFn9",
      "cleaned_text": "the new waqf bill in short anything that benefits the muslim community will be opposed by the political leadership of muslims ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.3803078830242157
    },
    {
      "id": "1908926287197921335",
      "text": "Muslims must furnish a 2 lakh rupee bond for peacefully protesting the Waqf bill\n\nRest of the world can dance on top of mosques with saffron flags as part of their annual celebrations",
      "cleaned_text": "muslims must furnish a 2 lakh rupee bond for peacefully protesting the waqf bill rest of the world can dance on top of mosques with saffron flags as part of their annual celebrations",
      "favorite_count": 4178,
      "retweet_count": 1379,
      "reply_count": 208,
      "sentiment": "negative",
      "sentiment_score": -0.08844372630119324
    },
    {
      "id": "1908925383673827478",
      "text": "Christians in Kerala are celebrating on the streets for the passing of the 2025 WAQF amendment bill!  \n400 acres of Munambam village in Ernakulam were  declared Waqf property by the land thieves and the Waqf amendment bill saved them and their families!!\nFrom @skamaraj32 \n#WaqfAmendmentBill",
      "cleaned_text": "christians in kerala are celebrating on the streets for the passing of the 2025 waqf amendment bill 400 acres of munambam village in ernakulam were declared waqf property by the land thieves and the waqf amendment bill saved them and their families from ",
      "favorite_count": 3,
      "retweet_count": 3,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.09689074754714966
    },
    {
      "id": "1908924514462822632",
      "text": "@ANI Sorry, the Congress is totally exposed in big 2025. Imagine Waqf claimed whole Christian village in kerala and lalu giving gyan to oppose the bill🤦‍♂️🤦‍♂️",
      "cleaned_text": " sorry the congress is totally exposed in big 2025 imagine waqf claimed whole christian village in kerala and lalu giving gyan to oppose the bill ",
      "favorite_count": 7,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8360021114349365
    },
    {
      "id": "1908924065215049886",
      "text": "#WATCH Asansol, West Bengal: On the approval of the Waqf (Amendment) Bill by President Draupadi Murmu, TMC MP Shatrughan Sinha says, \"Did the President have any other option? When the bill was passed by the Lok Sabha and Rajya Sabha, after that she just had to put a stamp on it, so the stamp has been put... Now the public will decide on this. People have gone to the Supreme Court regarding this matter... So this is the beginning of the matter, not the end... I hope that our people will get justice from the Supreme Court.\"",
      "cleaned_text": " asansol west bengal on the approval of the waqf amendment bill by president draupadi murmu tmc mp shatrughan sinha says did the president have any other option when the bill was passed by the lok sabha and rajya sabha after that she just had to put a stamp on it so the stamp has been put now the public will decide on this people have gone to the supreme court regarding this matter so this is the beginning of the matter not the end i hope that our people will get justice from the supreme court ",
      "favorite_count": 291,
      "retweet_count": 46,
      "reply_count": 86,
      "sentiment": "negative",
      "sentiment_score": -0.07953056693077087
    },
    {
      "id": "1908923973477298241",
      "text": "The Waqf (Amendment) Bill, 2025 isn’t about division.\nIt’s about definition—of rights, records, and responsibilities.\nFrom gender justice to digital transparency, this is reform that respects tradition and modern governance.\n#WaqfAmendmentBill https://t.co/1Ir40PaqJD",
      "cleaned_text": "the waqf amendment bill 2025 isn t about division it s about definition of rights records and responsibilities from gender justice to digital transparency this is reform that respects tradition and modern governance ",
      "favorite_count": 4,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.05545221269130707
    },
    {
      "id": "1908923954330575354",
      "text": "\"Sarkar toh CONgress party ka Karyakarta chalayega\"\n\n.@narendramodi Ji &amp; .@AmitShah Ji just showed this Arrogant Pidiot his REAL AUKAT by getting Waqf Amendment Bill passed. https://t.co/bFy3MH6QhU",
      "cleaned_text": " sarkar toh congress party ka karyakarta chalayega ji amp ji just showed this arrogant pidiot his real aukat by getting waqf amendment bill passed ",
      "favorite_count": 1367,
      "retweet_count": 372,
      "reply_count": 12,
      "sentiment": "negative",
      "sentiment_score": -0.10124802589416504
    },
    {
      "id": "1908923182024634663",
      "text": "Christians in Kerala are celebrating on the streets for the passing of the 2025 WAQF amendment bill!  \n400 acres of Munambam village in Ernakulam were  declared Waqf property by the land thieves and the Waqf amendment bill saved them and their families!!\nFrom @skamaraj32 \n#WaqfAmendmentBill",
      "cleaned_text": "christians in kerala are celebrating on the streets for the passing of the 2025 waqf amendment bill 400 acres of munambam village in ernakulam were declared waqf property by the land thieves and the waqf amendment bill saved them and their families from ",
      "favorite_count": 134,
      "retweet_count": 31,
      "reply_count": 3,
      "sentiment": "positive",
      "sentiment_score": 0.09689074754714966
    },
    {
      "id": "1908922444011741529",
      "text": "Muslim community welcomed the Waqf Amendment Bill. Shivraj Singh Chouhan ji \n\nSlap on Opposition 🤣🤣👇🏽 https://t.co/Q5R56Os6bW",
      "cleaned_text": "muslim community welcomed the waqf amendment bill shivraj singh chouhan ji slap on opposition ",
      "favorite_count": 7064,
      "retweet_count": 876,
      "reply_count": 20,
      "sentiment": "neutral",
      "sentiment_score": -0.01731935143470764
    },
    {
      "id": "1908922197197942890",
      "text": "Uttar Pradesh: After the passing of the Waqf Bill, a mob of #Hindutva zealots created havoc at a dargah in #Prayagraj.\n\nThis is BJP and Yogi/Modi's new India. \nThe whole world is watching Ram Raj of RSS. https://t.co/OHVRccBBiK",
      "cleaned_text": "uttar pradesh after the passing of the waqf bill a mob of zealots created havoc at a dargah in this is bjp and yogi modi s new india the whole world is watching ram raj of rss ",
      "favorite_count": 30,
      "retweet_count": 16,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.5213620662689209
    },
    {
      "id": "1908922038808387830",
      "text": "WE STAND AGAINST THE WAQF BILL\nمسلمانوں کے اوقاف پر حملہ ہرگز برداشت نہیں!\n\nWaqf properties are a sacred trust, not for sale, not for compromise. Defending them is our religious, legal, and moral responsibility.\n\n— Chief Islamic Justice (Qadi al Qudaat Fil Hind) & The Grand Mufti of India\nMufti Asjad Raza Khan Qadiri (Hafidahullah)\n\nJoin the Official WhatsApp Channel of Huzur Qaid-e Millat: https://t.co/CT9wB2F5C5",
      "cleaned_text": "we stand against the waqf bill مسلمانوں کے اوقاف پر حملہ ہرگز برداشت نہیں waqf properties are a sacred trust not for sale not for compromise defending them is our religious legal and moral responsibility chief islamic justice qadi al qudaat fil hind the grand mufti of india mufti asjad raza khan qadiri hafidahullah join the official whatsapp channel of huzur qaid e millat ",
      "favorite_count": 475,
      "retweet_count": 227,
      "reply_count": 15,
      "sentiment": "negative",
      "sentiment_score": -0.3339909315109253
    },
    {
      "id": "1908920949719626126",
      "text": "Let’s take a look at some of the top poetic moments from the Parliament during the debate on Waqf (Amendment) Bill,2025\n\n#Waqf #Shayari #parliament https://t.co/6onOOEyBPN",
      "cleaned_text": "let s take a look at some of the top poetic moments from the parliament during the debate on waqf amendment bill 2025 ",
      "favorite_count": 5,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.4716350734233856
    },
    {
      "id": "1908920940567687438",
      "text": "#WATCH | Members of the Muslim community met Union Agriculture Minister Shivraj Singh Chouhan in Sultanpur, Madhya Pradesh. Members of the Muslim community welcomed the Waqf (Amendment) Bill. Shivraj Singh Chouhan also participated in various programs in Raisen district. https://t.co/mPITfhckLQ",
      "cleaned_text": " members of the muslim community met union agriculture minister shivraj singh chouhan in sultanpur madhya pradesh members of the muslim community welcomed the waqf amendment bill shivraj singh chouhan also participated in various programs in raisen district ",
      "favorite_count": 1378,
      "retweet_count": 139,
      "reply_count": 5,
      "sentiment": "positive",
      "sentiment_score": 0.11988741159439087
    },
    {
      "id": "1908920922293010447",
      "text": "@therantinggola Dekho Waqf Bill ka effect shuru ho gaya hai\nRujhan aane shuru ho gaye hain https://t.co/ysj7H9Wog3",
      "cleaned_text": " dekho waqf bill ka effect shuru ho gaya hai rujhan aane shuru ho gaye hain ",
      "favorite_count": 13,
      "retweet_count": 7,
      "reply_count": 2,
      "sentiment": "neutral",
      "sentiment_score": -0.01561632752418518
    },
    {
      "id": "1908920766839546008",
      "text": "@JaikyYadav16 भाजपाई अंधभक्तों को तो मैदान में उतार दिया है पर उन्हें पता ही नहीं किस लिए आए है।\n\nकोई मोदी जी के समर्थन करने आया है\nकोई waqf bill का समर्थन करने आया\nकोई मंहगाई से परेशान है तो आया\nकोई बिजली बिल से परेशान तो आया\n\nइसमें से किसी को वक्फ बिल के बारे में\nकुछ पता भी नहीं है। https://t.co/gy671IsQxh",
      "cleaned_text": " भ जप ई अ धभक त क त म द न म उत र द य ह पर उन ह पत ह नह क स ल ए आए ह क ई म द ज क समर थन करन आय ह क ई waqf bill क समर थन करन आय क ई म हग ई स पर श न ह त आय क ई ब जल ब ल स पर श न त आय इसम स क स क वक फ ब ल क ब र म क छ पत भ नह ह ",
      "favorite_count": 3,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": -0.040477097034454346
    },
    {
      "id": "1908920597775609954",
      "text": "Say No To Waqf Bill https://t.co/v0FqZSN5PG",
      "cleaned_text": "say no to waqf bill ",
      "favorite_count": 6,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.6778650283813477
    },
    {
      "id": "1908920009524473905",
      "text": "Tu pehle madarsa ki jagah school ja aur English seekh. \n\nThrough demonetisation- we got Pakistan to stop terrorist attacks by controling black money. \n\nThrough waqf amazement bill now land mafia waqf cannot snatch our property and temples illegally. \n\nMuslims were responsible for genocide of Kashmiri pandits, now Hindus can relocate there and buy land- article 370. \n\nIndia is a Hindu rashtra and Hindus across the globe can apply for citizenship through CAA.",
      "cleaned_text": "tu pehle madarsa ki jagah school ja aur english seekh through demonetisation we got pakistan to stop terrorist attacks by controling black money through waqf amazement bill now land mafia waqf cannot snatch our property and temples illegally muslims were responsible for genocide of kashmiri pandits now hindus can relocate there and buy land article 370 india is a hindu rashtra and hindus across the globe can apply for citizenship through caa ",
      "favorite_count": 10,
      "retweet_count": 2,
      "reply_count": 3,
      "sentiment": "negative",
      "sentiment_score": -0.27266526222229004
    },
    {
      "id": "1908919849688174959",
      "text": "\"WAQF board not built a single school or hospital in India. We fully support WAQF Amendment bill\"\n\nZubair will call him Rental Muslim hired by BJP for speaking the truth. https://t.co/WlzBzYBqLt",
      "cleaned_text": " waqf board not built a single school or hospital in india we fully support waqf amendment bill zubair will call him rental muslim hired by bjp for speaking the truth ",
      "favorite_count": 39,
      "retweet_count": 17,
      "reply_count": 2,
      "sentiment": "neutral",
      "sentiment_score": -0.04055270552635193
    },
    {
      "id": "1908919761527844917",
      "text": "A unified national portal for waqf records is one of the Bill’s most forward-looking reforms. It will simplify access, improve tracking, and reduce mismanagement of religious endowments. This digital step supports better transparency and helps individuals, communities, and institutions understand the waqf system clearly. When combined with standardized waqf deeds and structured appeals, the portal creates a more open, user-friendly process. It marks a step toward modernization while keeping the waqf system rooted in its traditional purpose and spirit.\n#WaqfAmendmentBill",
      "cleaned_text": "a unified national portal for waqf records is one of the bill s most forward looking reforms it will simplify access improve tracking and reduce mismanagement of religious endowments this digital step supports better transparency and helps individuals communities and institutions understand the waqf system clearly when combined with standardized waqf deeds and structured appeals the portal creates a more open user friendly process it marks a step toward modernization while keeping the waqf system rooted in its traditional purpose and spirit ",
      "favorite_count": 5,
      "retweet_count": 5,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.2174093872308731
    },
    {
      "id": "1908919591889154316",
      "text": "Reject Waqf Bill 🏴🇮🇳 \n.\n@asadowaisi @AIMPLB_Official @aimim_national @Nayyerkazmi_\n\n#RejectWaqfBill #waqfamendmentbill2025 #WaqfBillAmendment #WaqfBill2025 #WaqfBoard #Owaisi #AsaduddinOwaisi #WaqfBill #IndiaAgainstWaqfBill https://t.co/HsMGvHVRWy",
      "cleaned_text": "reject waqf bill ",
      "favorite_count": 6,
      "retweet_count": 3,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.43598324060440063
    },
    {
      "id": "1908918812285555128",
      "text": "The Waqf (Amendment) Bill, 2025 is a game-changer for transparency and equality. For the first time, women—including those from Bohra and Aghakhani sects—get their rightful share in Waqf inheritance. Additionally, the amendment introduces a centralized digital portal for waqf records, ending decades of shadowy registrations. It reclaims wrongly claimed heritage sites, bars Waqf creation on tribal land, and restructures Waqf Boards to include MPs, judges, and even non-Muslims. This is not just reform—it’s reclamation. Reclamation of justice, of public land, and of the very idea that religious administration must also abide by democratic checks and balances.\n#WaqfAmendmentBill",
      "cleaned_text": "the waqf amendment bill 2025 is a game changer for transparency and equality for the first time women including those from bohra and aghakhani sects get their rightful share in waqf inheritance additionally the amendment introduces a centralized digital portal for waqf records ending decades of shadowy registrations it reclaims wrongly claimed heritage sites bars waqf creation on tribal land and restructures waqf boards to include mps judges and even non muslims this is not just reform it s reclamation reclamation of justice of public land and of the very idea that religious administration must also abide by democratic checks and balances ",
      "favorite_count": 169,
      "retweet_count": 55,
      "reply_count": 2,
      "sentiment": "neutral",
      "sentiment_score": -0.046465009450912476
    },
    {
      "id": "1908917560055148577",
      "text": "Intense Protest Against Waqf Amendment Bill Across Manipur https://t.co/hP0oDqrgVS https://t.co/wyXQ8gtXrd",
      "cleaned_text": "intense protest against waqf amendment bill across manipur ",
      "favorite_count": 25,
      "retweet_count": 3,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.1155569851398468
    },
    {
      "id": "1908917044747084104",
      "text": "Big Breaking - President Droupadi Murmu granted assent to the Waqf (Amendment) Bill, 2025, which had been passed by Parliament earlier in the week following intense debates in both Houses.\n\nKHABAR Aaj ki...\n06/04/2025 https://t.co/yept2cgnCT",
      "cleaned_text": "big breaking president droupadi murmu granted assent to the waqf amendment bill 2025 which had been passed by parliament earlier in the week following intense debates in both houses khabar aaj ki 06 04 2025 ",
      "favorite_count": 1,
      "retweet_count": 0,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.11838376522064209
    },
    {
      "id": "1908916134893801877",
      "text": "The BJP-backed Waqf Bill is a betrayal—seizing Waqf properties, undermining mosques, schools, and welfare centers.\nIt’s not reform; it’s state control over Muslim assets.\nFrom CAA-NRC to bulldozer politics—this is part of a larger anti-Muslim agenda. https://t.co/R3za6tYvbf",
      "cleaned_text": "the bjp backed waqf bill is a betrayal seizing waqf properties undermining mosques schools and welfare centers it s not reform it s state control over muslim assets from caa nrc to bulldozer politics this is part of a larger anti muslim agenda ",
      "favorite_count": 6,
      "retweet_count": 6,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.9074487686157227
    },
    {
      "id": "1908915813152673992",
      "text": "The Waqf (Amendment) Bill, 2025 isn’t just a law—it’s a reset. A reset from decades of opaque practices, discriminatory rules, and unchecked claims. It respects faith but refuses to allow faith-based overreach. It empowers minorities without marginalizing others. It brings structure where there was confusion and justice where there was imbalance. This is the kind of reform we need—rooted in truth, executed with fairness, and driven by equality. It's not anti-anyone; it's pro-everyone.\n#WaqfAmendmentBill",
      "cleaned_text": "the waqf amendment bill 2025 isn t just a law it s a reset a reset from decades of opaque practices discriminatory rules and unchecked claims it respects faith but refuses to allow faith based overreach it empowers minorities without marginalizing others it brings structure where there was confusion and justice where there was imbalance this is the kind of reform we need rooted in truth executed with fairness and driven by equality it s not anti anyone it s pro everyone ",
      "favorite_count": 129,
      "retweet_count": 30,
      "reply_count": 9,
      "sentiment": "negative",
      "sentiment_score": -0.35336557030677795
    },
    {
      "id": "1908914311571091654",
      "text": "Bihar Elections: Waqf Bill, Muslim Vote, and Nitish’s Political Mathematics\n\nRead:\nhttps://t.co/KkPXRyWh0A",
      "cleaned_text": "bihar elections waqf bill muslim vote and nitish s political mathematics read ",
      "favorite_count": 5,
      "retweet_count": 4,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.12065120041370392
    },
    {
      "id": "1908913618118156407",
      "text": "Enhancing legal recourse, the Waqf Amendment Bill 2025, extends the appeal period against Waqf Board orders from 60 to 90 days and permits appeals to be made in High Courts. #WaqfAmendmentBill https://t.co/ONnS3HhW14",
      "cleaned_text": "enhancing legal recourse the waqf amendment bill 2025 extends the appeal period against waqf board orders from 60 to 90 days and permits appeals to be made in high courts ",
      "favorite_count": 7,
      "retweet_count": 3,
      "reply_count": 1,
      "sentiment": "positive",
      "sentiment_score": 0.10778118669986725
    },
    {
      "id": "1908913441215066450",
      "text": "The 2025 Waqf Bill bridges the gap between old customs and today’s legal needs. With digital reforms, clear documentation, and extended appeal processes, the law embraces modern tools without losing its cultural foundation. It ensures that waqf properties continue to serve communities as originally intended—through structured, accountable management. These changes aim to prevent misuse and ensure sustainability. By combining heritage with technology and fairness, the Bill reflects a thoughtful evolution of an important religious and social institution.\n#WaqfAmendmentBill",
      "cleaned_text": "the 2025 waqf bill bridges the gap between old customs and today s legal needs with digital reforms clear documentation and extended appeal processes the law embraces modern tools without losing its cultural foundation it ensures that waqf properties continue to serve communities as originally intended through structured accountable management these changes aim to prevent misuse and ensure sustainability by combining heritage with technology and fairness the bill reflects a thoughtful evolution of an important religious and social institution ",
      "favorite_count": 94,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.1118822991847992
    },
    {
      "id": "1908912329435099601",
      "text": "What our pradhan mantri is doing :-\n1) Passing of waqf amendment bill \n2) Thailand &amp; Sri Lanka visit \n3) Inauguration of   pamban bridge https://t.co/3Q2RaePORV",
      "cleaned_text": "what our pradhan mantri is doing 1 passing of waqf amendment bill 2 thailand amp sri lanka visit 3 inauguration of pamban bridge ",
      "favorite_count": 3,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "neutral",
      "sentiment_score": -0.028065383434295654
    },
    {
      "id": "1908911666093314407",
      "text": "दिल्ली की निज़ामुद्दीन दरगाह पर\nWaqf Amendment Bill welcomed by Muslims...\n👌👌👌👌👌 https://t.co/bzSCd8NxyC",
      "cleaned_text": "द ल ल क न ज म द द न दरग ह पर waqf amendment bill welcomed by muslims ",
      "favorite_count": 6,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.1178213357925415
    },
    {
      "id": "1908911511545757941",
      "text": "@RituRathaur The amount of coverage on the waqf amendment bill on print and electronic media is unbelievable. The amount of celebration by Hindus on this is unbelievable. Modi ki bhakti mein Hindus are unable to differentiate what is good or bad for them",
      "cleaned_text": " the amount of coverage on the waqf amendment bill on print and electronic media is unbelievable the amount of celebration by hindus on this is unbelievable modi ki bhakti mein hindus are unable to differentiate what is good or bad for them",
      "favorite_count": 4,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.1976359784603119
    },
    {
      "id": "1908911196847427964",
      "text": "@mrigtrushna @BayAreaBiker If Nupur Sharma was thrown to safeguard the thousands Hindus working in Qatar, so be it.\n\nWe pass judgements like we never ever made a bad call. \n\nInstead of celebrating a moment of victory — Waqf Bill— we are hell bent on turning it into a baaraati ka jalaa hua phoopha moment.",
      "cleaned_text": " if nupur sharma was thrown to safeguard the thousands hindus working in qatar so be it we pass judgements like we never ever made a bad call instead of celebrating a moment of victory waqf bill we are hell bent on turning it into a baaraati ka jalaa hua phoopha moment ",
      "favorite_count": 3,
      "retweet_count": 2,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.27308356761932373
    },
    {
      "id": "1908910410649993535",
      "text": "The Waqf Bill is not retrospective; it has a statute of limitations: @tehseenp\n\nThe Congress government plays divisive politics: @crkesavan tells @PriyaBahal22 https://t.co/GHG7d5zbHT",
      "cleaned_text": "the waqf bill is not retrospective it has a statute of limitations the congress government plays divisive politics tells ",
      "favorite_count": 6,
      "retweet_count": 56,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.783306360244751
    },
    {
      "id": "1908909862333087766",
      "text": "@Ashok_Kashmir Suppose karo Kal pakistann or Bangladesh ki sarkar koi कानून laakar हिन्दुओं ke mandir and zameen ko सरकारी जमीन बता कर कब्जा कर ले तो bhakt क्या कहेंगे??\n\nYahan waqf bill लाकर Muslim properties ko कब्जा करने पर खुश होने वाले तब भी खुश होंगे??\n\n#WaqfAmendmentBill #WaqfBill",
      "cleaned_text": " suppose karo kal pakistann or bangladesh ki sarkar koi क न न laakar ह न द ओ ke mandir and zameen ko सरक र जम न बत कर कब ज कर ल त bhakt क य कह ग yahan waqf bill ल कर muslim properties ko कब ज करन पर ख श ह न व ल तब भ ख श ह ग ",
      "favorite_count": 3,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.08534255623817444
    },
    {
      "id": "1908909533403168988",
      "text": "In his speech, LK Advani said that 'Congress has no future'... and later, Congress formed the government in 2004: ＠tehseenp\n\nThe hypocrisy of the Congress party was exposed in the Waqf Bill. Why didn't Sonia Gandhi, Priyanka Gandhi, or Rahul Gandhi participate in the discussion?: ＠crkesavan tells ＠PriyaBahal22",
      "cleaned_text": "in his speech lk advani said that congress has no future and later congress formed the government in 2004 tehseenp the hypocrisy of the congress party was exposed in the waqf bill why didn t sonia gandhi priyanka gandhi or rahul gandhi participate in the discussion crkesavan tells priyabahal22",
      "favorite_count": 8,
      "retweet_count": 55,
      "reply_count": 4,
      "sentiment": "negative",
      "sentiment_score": -0.43442219495773315
    },
    {
      "id": "1908909503501807825",
      "text": "@amarDgreat @PoornimaNimo @PoonamB8874801 Who cares whether Rahul Gandhi was roaming around in Pyjamas or Diapers.\nAs usual Rahul Gandhi outside Parliament after Waqf debate touched all topics except Waqf.\nInside Parliament he was silent as he knew that nothing can stop the Waqf Amendment Bill.\n😜😂",
      "cleaned_text": " who cares whether rahul gandhi was roaming around in pyjamas or diapers as usual rahul gandhi outside parliament after waqf debate touched all topics except waqf inside parliament he was silent as he knew that nothing can stop the waqf amendment bill ",
      "favorite_count": 8,
      "retweet_count": 2,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.499297559261322
    },
    {
      "id": "1908908768739369030",
      "text": "@ajeetbharti Ye saala waqf amendment bill jab Rajya Sabha me discuss ho raha tha before passing tab aise chal ke jaa raha tha andar jaise parliament iske baap ka ghar ho.\n\n#ramnavmi2025",
      "cleaned_text": " ye saala waqf amendment bill jab rajya sabha me discuss ho raha tha before passing tab aise chal ke jaa raha tha andar jaise parliament iske baap ka ghar ho ",
      "favorite_count": 5,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": -0.046334534883499146
    },
    {
      "id": "1908908346909905067",
      "text": "Waqf Bill: नए बिल में '12 साल की लिमिट' वाला प्रावधान, जिससे वक्फ बोर्ड की मनमानी पर लगेगी लगाम | Exclusive Interview\n\n#SBVideo #WaqfAmendmentBill #WaqfBoard #WaqfBoardBill #RajyaSabha #PModi #NarendraModi #AmitShah #SachBedhadak #ExclusiveInterview @Viveksbarmeri https://t.co/MORiuSlRzT",
      "cleaned_text": "waqf bill नए ब ल म 12 स ल क ल म ट व ल प र वध न ज सस वक फ ब र ड क मनम न पर लग ग लग म exclusive interview ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": -0.010807722806930542
    },
    {
      "id": "1908907964821348582",
      "text": "@OnlyFrPSPK @YSRCParty Waqf bill support kooda both sides valla daggara bad ayyadu😂",
      "cleaned_text": " waqf bill support kooda both sides valla daggara bad ayyadu ",
      "favorite_count": 10,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.21139223873615265
    },
    {
      "id": "1908907584301449423",
      "text": "Pastor praveen meda posts kuda anni delete chesadu.. \nWAQF bill ki rajysabha lo support super party..",
      "cleaned_text": "pastor praveen meda posts kuda anni delete chesadu waqf bill ki rajysabha lo support super party ",
      "favorite_count": 122,
      "retweet_count": 48,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.16916003823280334
    },
    {
      "id": "1908906891658264959",
      "text": "Massive protests against Waqf Amendment Bill in Manipur. Notice the Bengali placards. \n\nThis is alarming. Check out this thread.\nhttps://t.co/Il5unr5waW https://t.co/cF435JiuFh",
      "cleaned_text": "massive protests against waqf amendment bill in manipur notice the bengali placards this is alarming check out this thread ",
      "favorite_count": 5,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.7494373321533203
    },
    {
      "id": "1908905923864670674",
      "text": "@RavinderKapur2 He repaid every tax payer of India by :\n\n1. Abrogation of Article 370\n2. Waqf bill amendment\n3. Ram Mandir rebuild\n\nEnough for a next term in 2029!",
      "cleaned_text": " he repaid every tax payer of india by 1 abrogation of article 370 2 waqf bill amendment 3 ram mandir rebuild enough for a next term in 2029 ",
      "favorite_count": 9,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.08910498023033142
    },
    {
      "id": "1908904242968170683",
      "text": "The Parliament of India has passed a law titled the Muslim Waqf (Amendment) Bill 2025. Upon analyzing the various provisions of this legislation, we have observed that it appears to undermine the rights of India’s minority Muslim community and attempts to foster discriminatory practices. India is a vast democratic nation. In such a large democratic state, it is the responsibility of the government to uphold its role as a guardian in protecting the religious rights of citizens of all faiths. We express our hope that the Government of India will reconsider this law in light of this principle. We believe that this step will play a historic role in maintaining regional communal harmony.\n—\nBangladesh Nationalist Party (BNP)\nApril 6, 2025\nPress conference by Mr. Salahuddin Ahmed, Member of the National Standing Committee of the BNP.\n#Bangladesh #BNP #SaveWaqf",
      "cleaned_text": "the parliament of india has passed a law titled the muslim waqf amendment bill 2025 upon analyzing the various provisions of this legislation we have observed that it appears to undermine the rights of india s minority muslim community and attempts to foster discriminatory practices india is a vast democratic nation in such a large democratic state it is the responsibility of the government to uphold its role as a guardian in protecting the religious rights of citizens of all faiths we express our hope that the government of india will reconsider this law in light of this principle we believe that this step will play a historic role in maintaining regional communal harmony bangladesh nationalist party bnp april 6 2025 press conference by mr salahuddin ahmed member of the national standing committee of the bnp ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": 0.01993754506111145
    },
    {
      "id": "1908902133618921568",
      "text": "The Myths broken by Factual Reality and implemented in Waqf Amendment Bill or Unified Waqf Management, Empowerment, Efficiency, and Development Act, 2025. #WaqfAmendmentBill https://t.co/I9fj85MyOi",
      "cleaned_text": "the myths broken by factual reality and implemented in waqf amendment bill or unified waqf management empowerment efficiency and development act 2025 ",
      "favorite_count": 3,
      "retweet_count": 3,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.08326838910579681
    },
    {
      "id": "1908901965662200250",
      "text": "Hindus got nothing from\n\nwaqf amendment bill\n\nCAA\n\nAbrogation of 370\n\nTriple Talaq\n\nAbsolutely nothing !!\n\nBut the psyop done by the propaganda machinery of BJP is phenomenal \n\nHindus can’t stop clapping on these masterstrokes 😂",
      "cleaned_text": "hindus got nothing from waqf amendment bill caa abrogation of 370 triple talaq absolutely nothing but the psyop done by the propaganda machinery of bjp is phenomenal hindus can t stop clapping on these masterstrokes ",
      "favorite_count": 175,
      "retweet_count": 112,
      "reply_count": 30,
      "sentiment": "negative",
      "sentiment_score": -0.5086477398872375
    },
    {
      "id": "1908901671683686666",
      "text": "The Myths broken by Factual Reality and implemented in Waqf Amendment Bill or Unified Waqf Management, Empowerment, Efficiency, and Development Act, 2025. #WaqfAmendmentBill https://t.co/aMl2EJpPKR",
      "cleaned_text": "the myths broken by factual reality and implemented in waqf amendment bill or unified waqf management empowerment efficiency and development act 2025 ",
      "favorite_count": 3,
      "retweet_count": 3,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.08326838910579681
    },
    {
      "id": "1908900743513243783",
      "text": "#WATCH | Siddharthnagar, UP: Waqf (Amendment) Bill gets President Droupadi Murmu's assent\n\nChairman of the JPC of Waqf (Amendment) Bill and BJP MP Jagdambika Pal says, \"Why are these people going instigating agitation? If they go to the Supreme Court, they will come to know that the Waqf law of 2013 and 1995 made by the Congress party was unconstitutional. This law was made after very detailed discussions. I went to all the states of the country continuously in 6 months and met 284 delegations...\"",
      "cleaned_text": " siddharthnagar up waqf amendment bill gets president droupadi murmu s assent chairman of the jpc of waqf amendment bill and bjp mp jagdambika pal says why are these people going instigating agitation if they go to the supreme court they will come to know that the waqf law of 2013 and 1995 made by the congress party was unconstitutional this law was made after very detailed discussions i went to all the states of the country continuously in 6 months and met 284 delegations ",
      "favorite_count": 38,
      "retweet_count": 10,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.3180024027824402
    },
    {
      "id": "1908899957869883731",
      "text": "Today I joined the black flag protest at Saidapet, opposing the Waqf Amendment Bill, passed by fascist Modi govt. \n\nThe protest was led by @INCTamilNadu President Thiru.@SPK_TNCC, MLA &amp; saw presence of former Union Finance Minister Thiru. @PChidambaram_IN.\n\n@RahulGandhi @mkstalin https://t.co/WVrmPIN4Em",
      "cleaned_text": "today i joined the black flag protest at saidapet opposing the waqf amendment bill passed by fascist modi govt the protest was led by president thiru mla amp saw presence of former union finance minister thiru ",
      "favorite_count": 4,
      "retweet_count": 1,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.09837266802787781
    },
    {
      "id": "1908899809081049245",
      "text": "The Waqf Amendment Bill 2025 introduces stricter accountability for Mutawalis, the caretakers of waqf properties. Now, failure to maintain proper accounts for a year can result in their removal. This ensures better financial management and curbs potential mismanagement, helping preserve the sanctity and purpose of waqf properties for the intended beneficiaries.\n#WaqfAmendmentBill",
      "cleaned_text": "the waqf amendment bill 2025 introduces stricter accountability for mutawalis the caretakers of waqf properties now failure to maintain proper accounts for a year can result in their removal this ensures better financial management and curbs potential mismanagement helping preserve the sanctity and purpose of waqf properties for the intended beneficiaries ",
      "favorite_count": 28,
      "retweet_count": 35,
      "reply_count": 1,
      "sentiment": "neutral",
      "sentiment_score": 0.0015839338302612305
    },
    {
      "id": "1908899805264293980",
      "text": "‘Waqf Bill needs to be understood properly. It’s going to be beneficial for all ', explains Minority Affairs Minister @KirenRijiju in Srinagar https://t.co/UVyQqcDNWh",
      "cleaned_text": " waqf bill needs to be understood properly it s going to be beneficial for all explains minority affairs minister in srinagar ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": 0.02974677085876465
    },
    {
      "id": "1908899262634643663",
      "text": "Strictly the Administrative Correction only. Waqf Amendment Bill or Unified Waqf Management, Empowerment, Efficiency, and Development Act, 2025. #WaqfAmendmentBill https://t.co/EqOYK5mdXr",
      "cleaned_text": "strictly the administrative correction only waqf amendment bill or unified waqf management empowerment efficiency and development act 2025 ",
      "favorite_count": 3,
      "retweet_count": 3,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": 0.03138945996761322
    },
    {
      "id": "1908898860950241613",
      "text": "@ekamsatyam11 @RajivR72759 @OfficeOfDGP 2013 waqf amendment bill Italian passed quietly",
      "cleaned_text": " 2013 waqf amendment bill italian passed quietly",
      "favorite_count": 2,
      "retweet_count": 0,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.056013643741607666
    },
    {
      "id": "1908896602401517628",
      "text": "The country's unemployed who buy petrol, dal, milk for Rs. 100 (or are unable to buy them) are happy that the Waqf bill has been passed. \nThese fools think this hatred towards Indian Muslims is deshbhakti.",
      "cleaned_text": "the country s unemployed who buy petrol dal milk for rs 100 or are unable to buy them are happy that the waqf bill has been passed these fools think this hatred towards indian muslims is deshbhakti ",
      "favorite_count": 477,
      "retweet_count": 119,
      "reply_count": 28,
      "sentiment": "negative",
      "sentiment_score": -0.7011242508888245
    },
    {
      "id": "1908896487784009740",
      "text": "It was a great meeting with Hon'ble Union Minister for Minority Affairs Shri @KirenRijiju Ji at Srinagar today. Thanked him for his words of praise for J&K Waqf Board in the Parliament. Discussed the Waqf Development Measures & the benefits of the Waqf Amendment Bill 2025. \n\n@RijijuOffice @PMOIndia @AmitShah @BJP4India @BJPSocialMedia_ @amitmalviya @ANI @BJP4JnK",
      "cleaned_text": "it was a great meeting with hon ble union minister for minority affairs shri ji at srinagar today thanked him for his words of praise for j k waqf board in the parliament discussed the waqf development measures the benefits of the waqf amendment bill 2025 ",
      "favorite_count": 489,
      "retweet_count": 458,
      "reply_count": 11,
      "sentiment": "positive",
      "sentiment_score": 0.4086430072784424
    },
    {
      "id": "1908896219532767478",
      "text": "Waqf Act* not bill anymore 😂",
      "cleaned_text": "waqf act not bill anymore ",
      "favorite_count": 9,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.5374605655670166
    }
  ]
}