{
  "metadata": {
    "search_query": "USA Tariff",
    "timestamp": "2025-04-08_13-05-03",
    "total_tweets": 154,
    "language_stats": [
      {
        "language": "English",
        "code": "en",
        "count": 149,
        "percentage": 96.8
      },
      {
        "language": "Hindi",
        "code": "hi",
        "count": 2,
        "percentage": 1.3
      }
    ]
  },
  "tweets": [
    {
      "id": "1909505063091159092",
      "text": "Apple’s iPhone export rush: Key points-\n•Apple reportedly flew 5planes full of iPhones from #India to the USA.\n•Goal:Beat #Trump new 10% reciprocal tariff.\n•Production shift from China to India is accelerating.\n• #TrumpTariffs policy:34% on China,26% on India.\n#NarendraModi https://t.co/KgK7DZjdml",
      "cleaned_text": "apple s iphone export rush key points apple reportedly flew 5planes full of iphones from to the usa goal beat new 10 reciprocal tariff production shift from china to india is accelerating policy 34 on china 26 on india ",
      "favorite_count": 5,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.20810358226299286,
      "original_lang": "en"
    },
    {
      "id": "1909501635472376203",
      "text": "Tariff reality check:\n- All 27 EU members have been hit with a 20% tariff, a tariff that none of them can individually renegotiate as this violates EU laws.\n- Brexit Britain can renegotiate terms with the USA and any other country it wants to.\n- Germany still in recession",
      "cleaned_text": "tariff reality check all 27 eu members have been hit with a 20 tariff a tariff that none of them can individually renegotiate as this violates eu laws brexit britain can renegotiate terms with the usa and any other country it wants to germany still in recession",
      "favorite_count": 42,
      "retweet_count": 8,
      "reply_count": 3,
      "sentiment": "negative",
      "sentiment_score": -0.85219806432724,
      "original_lang": "en"
    },
    {
      "id": "1909500633692225755",
      "text": "@truthminist @ChinaDaily @MediaUnlock @USNavy @USEmbAustralia The USA are only strong because they have allies.\n\nAustralians died for the USA after September 11. We import more USA goods than we export to the USA, still we got hit with a %10 tariff. What a way to treat a extremely loyal friend!!!!\n\nThe US will run out of allies at this rate",
      "cleaned_text": " the usa are only strong because they have allies australians died for the usa after september 11 we import more usa goods than we export to the usa still we got hit with a 10 tariff what a way to treat a extremely loyal friend the us will run out of allies at this rate",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.680971086025238,
      "original_lang": "en"
    },
    {
      "id": "1909494642716057708",
      "text": "@tizintest @nicksortor China trade 13% of their GDP with USA. Most of the product sold in US is made in China. Increase in tariff increase those products impact common American people not China. China may can ban #Tesla because no china cars sold in US. That will be 50% lose to #TSLA. China has cards.",
      "cleaned_text": " china trade 13 of their gdp with usa most of the product sold in us is made in china increase in tariff increase those products impact common american people not china china may can ban because no china cars sold in us that will be 50 lose to china has cards ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.43594110012054443,
      "original_lang": "en"
    },
    {
      "id": "1909488813564739884",
      "text": "@memorynguwi USA exports US$144bn to China while China exports US$582bn. I think it’s clear who is worse off in an escalated tariff war. Also, the world wants USA market which is open while China remains closed for manufactured goods around the world. The EU China fight is instructive",
      "cleaned_text": " usa exports us 144bn to china while china exports us 582bn i think it s clear who is worse off in an escalated tariff war also the world wants usa market which is open while china remains closed for manufactured goods around the world the eu china fight is instructive",
      "favorite_count": 7,
      "retweet_count": 2,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.8387115001678467,
      "original_lang": "en"
    },
    {
      "id": "1909484999239155861",
      "text": "\"USA is bringing in Billions of Dollars a week from the abusing countries\" says @realDonaldTrump\n\nBut its nonsense. As Tariff is paid by consumers, it's the American people who are paying taxes in consumption to their Govt. Tariff will just allow US Govt to control imports.",
      "cleaned_text": " usa is bringing in billions of dollars a week from the abusing countries says but its nonsense as tariff is paid by consumers it s the american people who are paying taxes in consumption to their govt tariff will just allow us govt to control imports ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.7843177914619446,
      "original_lang": "en"
    },
    {
      "id": "1909479579573445117",
      "text": "Framework is “pausing” sales of some laptop models in the USA… because of “tariffs”.\n\nThis is truly peculiar, and doesn’t pass the sniff test.\n\n1) The price can be adjusted on the imported product to compensate for the tariff.  That’s how it works and the math is incredibly simple.\n\n2) The USA is not the only country that imposes import tariffs on Taiwan.  In fact… *most* countries have tariffs with Taiwan.  (I’ve included a *very* partial list as a screenshot.)\n\n3) In fact, Framework already has been dealing with tariffs (many far more complex than the Taiwan to US import tariffs) for quite some time.  Which means this is nothing new for them.\n\n4) Framework is not ceasing *all* sales in the US.  Just specific models.  Which makes this look more like an excuse for some other reason.\n\nThis smells like a political stunt.\n\nFramework is a US company (San Francisco).  But they do their manufacturing in Taiwan.  If they built their computers in the USA, they would avoid import tariffs into the USA.  But they don’t and won’t.  Because Taiwan is cheap to build this stuff in.\n\nWorth noting that I’ve worked for multiple computer hardware companies (including at the executive level) where we had to deal with import tariffs (going multiple different directions).  I can speak on the subject of “building computers in one company and selling in another” with a reasonable level of authority.\n\nNearly every nation has tariffs with nearly every other nation.  Every one is different and many are in a constant state of flux.  Yes, tariffs can be annoying to calculate and properly document.  But it’s nothing a good spreadsheet can’t solve.\n\nIn short: This doesn’t smell right.  Is it a political stunt?  Or cover for a different motivation?",
      "cleaned_text": "framework is pausing sales of some laptop models in the usa because of tariffs this is truly peculiar and doesn t pass the sniff test 1 the price can be adjusted on the imported product to compensate for the tariff that s how it works and the math is incredibly simple 2 the usa is not the only country that imposes import tariffs on taiwan in fact most countries have tariffs with taiwan i ve included a very partial list as a screenshot 3 in fact framework already has been dealing with tariffs many far more complex than the taiwan to us import tariffs for quite some time which means this is nothing new for them 4 framework is not ceasing all sales in the us just specific models which makes this look more like an excuse for some other reason this smells like a political stunt framework is a us company san francisco but they do their manufacturing in taiwan if they built their computers in the usa they would avoid import tariffs into the usa but they don t and won t because taiwan is cheap to build this stuff in worth noting that i ve worked for multiple computer hardware companies including at the executive level where we had to deal with import tariffs going multiple different directions i can speak on the subject of building computers in one company and selling in another with a reasonable level of authority nearly every nation has tariffs with nearly every other nation every one is different and many are in a constant state of flux yes tariffs can be annoying to calculate and properly document but it s nothing a good spreadsheet can t solve in short this doesn t smell right is it a political stunt or cover for a different motivation ",
      "favorite_count": 55,
      "retweet_count": 6,
      "reply_count": 6,
      "sentiment": "negative",
      "sentiment_score": -0.23106257617473602,
      "original_lang": "en"
    },
    {
      "id": "1909477858298286225",
      "text": "@Ajay_Bagga If All the surplus dairy and agricultural products of USA , consumed by EU then USA will not dump their these products in India.\n\nSo that our agricultural economy could be saved from tariff effects.",
      "cleaned_text": " if all the surplus dairy and agricultural products of usa consumed by eu then usa will not dump their these products in india so that our agricultural economy could be saved from tariff effects ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.24266833066940308,
      "original_lang": "en"
    },
    {
      "id": "1909470970353434835",
      "text": "Post tariff wars Trumperica is going after \"unacceptable barriers\" to trade - you know shit like regulation which prevents shite in the food chain, or airbags in sister fucker trucks.\n\nSame USA which put up trade barriers to car makers like having to build their cars in USA.",
      "cleaned_text": "post tariff wars trumperica is going after unacceptable barriers to trade you know shit like regulation which prevents shite in the food chain or airbags in sister fucker trucks same usa which put up trade barriers to car makers like having to build their cars in usa ",
      "favorite_count": 5,
      "retweet_count": 2,
      "reply_count": 5,
      "sentiment": "negative",
      "sentiment_score": -0.8742887377738953,
      "original_lang": "en"
    },
    {
      "id": "1909462135924474223",
      "text": "China gave a strong response to Trump's tariff by imposing a 34% tariff on the USA but what kind of masterstroke is it of Modi to increase petrol prices, LPG gas prices &amp; electricity bills?\n\n#tarriffwar \n#TrumpTariffs",
      "cleaned_text": "china gave a strong response to trump s tariff by imposing a 34 tariff on the usa but what kind of masterstroke is it of modi to increase petrol prices lpg gas prices amp electricity bills ",
      "favorite_count": 2,
      "retweet_count": 2,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.6688272953033447,
      "original_lang": "en"
    },
    {
      "id": "1909449809120940160",
      "text": "@RoyLakshman @CNBC_Awaaz I support this move fully,only OMC will bear the cost. Retailers are exempt.\nAfter all u require money to off set concession to be given to USA and EU amid tariff war",
      "cleaned_text": " i support this move fully only omc will bear the cost retailers are exempt after all u require money to off set concession to be given to usa and eu amid tariff war",
      "favorite_count": 2,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.20805560052394867,
      "original_lang": "en"
    },
    {
      "id": "1909448125653107027",
      "text": "@Atulsingh_asan I support this move fully, only OMC will bear the cost. Retailers are exempt.\nAfter all u require money to off set concession to be given to USA and EU amid tariff war.\nपैसे कहाँ से आएंगे।\nBe practical",
      "cleaned_text": " i support this move fully only omc will bear the cost retailers are exempt after all u require money to off set concession to be given to usa and eu amid tariff war प स कह स आए ग be practical",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": 0.006037592887878418,
      "original_lang": "en"
    },
    {
      "id": "1909445129770840473",
      "text": "As expected USA tariff war started to disrupt the global economy. Stock markets bleeding, NSE &amp; BSE have some cushion, how long??  To tackle this Trump will have to devalue the $, even worse split $ to domestic &amp; international currencies, this move will change the world order.",
      "cleaned_text": "as expected usa tariff war started to disrupt the global economy stock markets bleeding nse amp bse have some cushion how long to tackle this trump will have to devalue the even worse split to domestic amp international currencies this move will change the world order ",
      "favorite_count": 28,
      "retweet_count": 6,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.5026041865348816,
      "original_lang": "en"
    },
    {
      "id": "1909441069550567681",
      "text": "America's new tariff's hurt developing countries which trade with the USA.\n\nThe consequence will likely be that most of these nations increase trade with China and decrease trade with the USA.\n\n#tariffs https://t.co/iam8VRcJWN",
      "cleaned_text": "america s new tariff s hurt developing countries which trade with the usa the consequence will likely be that most of these nations increase trade with china and decrease trade with the usa ",
      "favorite_count": 75,
      "retweet_count": 23,
      "reply_count": 9,
      "sentiment": "negative",
      "sentiment_score": -0.8963311910629272,
      "original_lang": "en"
    },
    {
      "id": "1909435616623722883",
      "text": "@catturd2 I think that tariff's have been awful, because, until now, they've all worked against the USA. And, I think, though this has not been spoken, that zero tariffs might be DJT's goal.",
      "cleaned_text": " i think that tariff s have been awful because until now they ve all worked against the usa and i think though this has not been spoken that zero tariffs might be djt s goal ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.9127123951911926,
      "original_lang": "en"
    },
    {
      "id": "1909433596055519422",
      "text": "The USA Gov had PREVIOUSLY placed a 20% Tariff on China's exports, THEN Trump added a 34% Tariff on top of that (54% Total) and is now threatening to add another 50% Tariff (which would equal an absurd 104%). Whose crunching those numbers in the White House, Elmer Fudd? https://t.co/QKlIH4WxST",
      "cleaned_text": "the usa gov had previously placed a 20 tariff on china s exports then trump added a 34 tariff on top of that 54 total and is now threatening to add another 50 tariff which would equal an absurd 104 whose crunching those numbers in the white house elmer fudd ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.748050332069397,
      "original_lang": "en"
    },
    {
      "id": "1909433460122321223",
      "text": "USA keep whacking $CHYNA with tariff until we wanna vomit blood lah They think they damn smart, put big big tax make our stuff like gold price, make phone, shoe, everything lah, then they come kaopei with tariff Like school buay see China face not happy, must slap tariff so petty",
      "cleaned_text": "usa keep whacking chyna with tariff until we wanna vomit blood lah they think they damn smart put big big tax make our stuff like gold price make phone shoe everything lah then they come kaopei with tariff like school buay see china face not happy must slap tariff so petty",
      "favorite_count": 3,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.6875783205032349,
      "original_lang": "en"
    },
    {
      "id": "1909431887384150327",
      "text": "@sandipsabharwal @HardeepSPuri I support this move only OMC will bear the cost. Retailers are exempt.\nAfter all u require money to off set concession to be given to USA and EU amid tariff war",
      "cleaned_text": " i support this move only omc will bear the cost retailers are exempt after all u require money to off set concession to be given to usa and eu amid tariff war",
      "favorite_count": 2,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.2023695409297943,
      "original_lang": "en"
    },
    {
      "id": "1909431259828568130",
      "text": "Anson’s lithium projects in Utah, USA considered to benefit from tariff increases introduced by President Trump. Price tracking indicates that spot prices for lithium in the USA are already 35% higher that the China spot price. This could increase further due to the recently announced increase in tariffs. The new tariffs will apply to CAM produced in China (potentially as much as 74%) and to South Korea (24%). US tariffs on China have been increasing since 2018. At the end of the Biden administration the tariff on most products was around 20% & after inauguration President Trump added another 20% on top of those rates. On April 3rd President Trump applied a new additional “reciprocal tariff” of 34%. That brought the total tariff on most goods to a total of 74%.",
      "cleaned_text": "anson s lithium projects in utah usa considered to benefit from tariff increases introduced by president trump price tracking indicates that spot prices for lithium in the usa are already 35 higher that the china spot price this could increase further due to the recently announced increase in tariffs the new tariffs will apply to cam produced in china potentially as much as 74 and to south korea 24 us tariffs on china have been increasing since 2018 at the end of the biden administration the tariff on most products was around 20 after inauguration president trump added another 20 on top of those rates on april 3rd president trump applied a new additional reciprocal tariff of 34 that brought the total tariff on most goods to a total of 74 ",
      "favorite_count": 40,
      "retweet_count": 6,
      "reply_count": 1,
      "sentiment": "neutral",
      "sentiment_score": 0.019507020711898804,
      "original_lang": "en"
    },
    {
      "id": "1909429358525096165",
      "text": "🚨A great piece on President Trump's America First tariff policy!\n\nDemocrats, RINOs, and the MSM talking heads are rooting for the American economy to tank but, surprise! Countries are now lining up to make deals with the USA! It's a good day for U.S. workers &amp; their families.🇺🇲",
      "cleaned_text": " a great piece on president trump s america first tariff policy democrats rinos and the msm talking heads are rooting for the american economy to tank but surprise countries are now lining up to make deals with the usa it s a good day for u s workers amp their families ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "positive",
      "sentiment_score": 0.5020785331726074,
      "original_lang": "en"
    },
    {
      "id": "1909422782238409102",
      "text": "@RonFilipkowski Taiwan might join China on the tariff fight with USA. What is Taiwan’s biggest export to USA? TSMC. Without advanced chips made by TSMC America’s techs will be paralyzed. \n\nIn a weird twist of fate Trump just might bring Taiwan and China together.",
      "cleaned_text": " taiwan might join china on the tariff fight with usa what is taiwan s biggest export to usa tsmc without advanced chips made by tsmc america s techs will be paralyzed in a weird twist of fate trump just might bring taiwan and china together ",
      "favorite_count": 5,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.5592273473739624,
      "original_lang": "en"
    },
    {
      "id": "1909420761225277574",
      "text": "\"I am USA citizen and have lost the money in the 401K plan. I distributed the vote on you President Donald and you must end the tariff.\"\n\n\"I am USA citizen and have lost the money in the 401K plan. I distributed the vote on you President Donald and you must end the tariff.\" https://t.co/mcMbhBziDX",
      "cleaned_text": " i am usa citizen and have lost the money in the 401k plan i distributed the vote on you president donald and you must end the tariff i am usa citizen and have lost the money in the 401k plan i distributed the vote on you president donald and you must end the tariff ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.5475585460662842,
      "original_lang": "en"
    },
    {
      "id": "1909416193141923881",
      "text": "History of Trade Tariffs: \n\nUSA 🇺🇸 vs. China 🇨🇳\n\nA quick rundown of tariff changes between these economic giants:\n\n•Pre-2001:\n◦🇺🇸 USA: Applied MFN tariffs (avg. 3-4%) on Chinese goods under GATT.\n◦🇨🇳 China: Imposed tariffs averaging 15-20% on U.S. goods.\n•2001 (China Joins WTO):\n◦🇺🇸 USA: Reduced tariffs to avg. 2.7% on Chinese goods.\n◦🇨🇳 China: Lowered tariffs to avg. 8-10% on U.S. goods over time.\n•2018 (Trump Trade War Begins):\n◦🇺🇸 USA: Imposed 25% tariffs on $34B of Chinese goods (July 6), then $16B (Aug 23).\n◦🇨🇳 China: Matched with 25% tariffs on $34B (July 6), then $16B (Aug 23) of U.S. goods.\n•2019:\n◦🇺🇸 USA: Raised tariffs to 25% on $200B of Chinese goods (May), avg. reached 20%.\n◦🇨🇳 China: Imposed tariffs up to 25% on $110B of U.S. goods, avg. hit 21%.\n•2020 (Phase One Deal):\n◦🇺🇸 USA: Reduced tariffs on $120B from 15% to 7.5%, kept 25% on $250B.\n◦🇨🇳 China: Kept avg. tariffs at 21% on U.S. goods, offered exemptions.\n•2021-2024 (Biden Era):\n◦🇺🇸 USA: Maintained Trump-era tariffs; avg. 19-20% on Chinese goods.\n◦🇨🇳 China: Held avg. tariffs at 20-21% on U.S. goods.\n•2025 (Liberation Day):\n◦🇺🇸 USA: Imposed 10% tariff on all Chinese goods (April 5), avg. now 42.1%.\n◦🇨🇳 China: Added 10-15% tariffs on U.S. goods (April 10), avg. reached 34%.\n\n📊 Takeaway: Tariffs escalated from low levels (2-10%) to a high-stakes battle, with the U.S. at 42.1% and China at 34% by 2025.",
      "cleaned_text": "history of trade tariffs usa vs china a quick rundown of tariff changes between these economic giants pre 2001 usa applied mfn tariffs avg 3 4 on chinese goods under gatt china imposed tariffs averaging 15 20 on u s goods 2001 china joins wto usa reduced tariffs to avg 2 7 on chinese goods china lowered tariffs to avg 8 10 on u s goods over time 2018 trump trade war begins usa imposed 25 tariffs on 34b of chinese goods july 6 then 16b aug 23 china matched with 25 tariffs on 34b july 6 then 16b aug 23 of u s goods 2019 usa raised tariffs to 25 on 200b of chinese goods may avg reached 20 china imposed tariffs up to 25 on 110b of u s goods avg hit 21 2020 phase one deal usa reduced tariffs on 120b from 15 to 7 5 kept 25 on 250b china kept avg tariffs at 21 on u s goods offered exemptions 2021 2024 biden era usa maintained trump era tariffs avg 19 20 on chinese goods china held avg tariffs at 20 21 on u s goods 2025 liberation day usa imposed 10 tariff on all chinese goods april 5 avg now 42 1 china added 10 15 tariffs on u s goods april 10 avg reached 34 takeaway tariffs escalated from low levels 2 10 to a high stakes battle with the u s at 42 1 and china at 34 by 2025 ",
      "favorite_count": 6,
      "retweet_count": 0,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.10629451274871826,
      "original_lang": "en"
    },
    {
      "id": "1909415423570849840",
      "text": "@JDunlap1974 Think about how many “Made in China” stickers we’ve seen. I wonder how many “Made in the USA stickers are on products in China”?  Guess who wins this game of tariff chicken?",
      "cleaned_text": " think about how many made in china stickers we ve seen i wonder how many made in the usa stickers are on products in china guess who wins this game of tariff chicken ",
      "favorite_count": 0,
      "retweet_count": 0,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": 0.01859705150127411,
      "original_lang": "en"
    },
    {
      "id": "1909411520934822135",
      "text": "Right before Nov election, everyone hedged, skew was high, there was a “wall of worry”, but market gap up big;\n\nOn “Liberation Day”, everyone expect 10% tariff, no one hedged, skew was drifting down, we got biggest sell off since Covid crash. \n\nIt’s a tough market for short term players.",
      "cleaned_text": "right before nov election everyone hedged skew was high there was a wall of worry but market gap up big on liberation day everyone expect 10 tariff no one hedged skew was drifting down we got biggest sell off since covid crash it s a tough market for short term players ",
      "favorite_count": 15,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.25167033076286316,
      "original_lang": "en"
    },
    {
      "id": "1909410922533417371",
      "text": "'Trump's tariff war'\nAs of April 8, 2025, the United States population represents approximately 4.22% of the total world population.\n\nMy question: Why should the rest of the world worry about USA?\nTime to set up new trade options that don't include USA.",
      "cleaned_text": " trump s tariff war as of april 8 2025 the united states population represents approximately 4 22 of the total world population my question why should the rest of the world worry about usa time to set up new trade options that don t include usa ",
      "favorite_count": 6,
      "retweet_count": 3,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.5119766592979431,
      "original_lang": "en"
    },
    {
      "id": "1909409258698883393",
      "text": "Covering the Trump tariff strategy on 🇺🇸 America's Mayor Live 🇺🇸 with Mayor @RudyGiuliani!\n\nCountries are now lining up to remove their trade barriers! https://t.co/KF0eYm3NLG",
      "cleaned_text": "covering the trump tariff strategy on america s mayor live with mayor countries are now lining up to remove their trade barriers ",
      "favorite_count": 12,
      "retweet_count": 2,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.07426829636096954,
      "original_lang": "en"
    },
    {
      "id": "1909403886450098296",
      "text": "@WatcherGuru us-china trade drama alert. china won't budge on trump's tariff threat. without rollback of its 34% hike today, april 8, 2025, the us plans a 50% boost tomorrow. expected total: 104% on chinese goods. classic tariff standoff. #TradeWar #china #usa",
      "cleaned_text": " us china trade drama alert china won t budge on trump s tariff threat without rollback of its 34 hike today april 8 2025 the us plans a 50 boost tomorrow expected total 104 on chinese goods classic tariff standoff ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.11767727136611938,
      "original_lang": "en"
    },
    {
      "id": "1909403120314044677",
      "text": "Good morning!\n\nJapan's Nikkei index has surged by 6%.\n\nAll other countries, except USA, are likely to benefit from tariff indirectly. The moral of story is that acting selfishly often leads to greater losses, whether it by an individual or a nation.\n\n🇮🇳 Grab This Opportunity!",
      "cleaned_text": "good morning japan s nikkei index has surged by 6 all other countries except usa are likely to benefit from tariff indirectly the moral of story is that acting selfishly often leads to greater losses whether it by an individual or a nation grab this opportunity ",
      "favorite_count": 58,
      "retweet_count": 9,
      "reply_count": 6,
      "sentiment": "negative",
      "sentiment_score": -0.11494940519332886,
      "original_lang": "en"
    },
    {
      "id": "1909394421789212737",
      "text": "USA and Argentina are zero tariff nations 🙌🙌",
      "cleaned_text": "usa and argentina are zero tariff nations ",
      "favorite_count": 52,
      "retweet_count": 7,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.27754098176956177,
      "original_lang": "en"
    },
    {
      "id": "1909393467622801585",
      "text": "#Tariff\n#ReciprocalTariff\n#USA\n#MalaysiaMadani\n\n“SILAP DATA, SILAP KIRA, MAKA SILAP KEPUTUSAN”\n\nNota ringkas saya 8/4/25 mengenai isu terpenting yang terkini &amp; sedang menggoncang seluruh ekonomi dunia. Kejadian serupa pada thn 1930’an membawa kpd Perang Dunia ke-2. Jauhkanlah. https://t.co/jUSDuBV4W0",
      "cleaned_text": " silap data silap kira maka silap keputusan nota ringkas saya 8 4 25 mengenai isu terpenting yang terkini amp sedang menggoncang seluruh ekonomi dunia kejadian serupa pada thn 1930 an membawa kpd perang dunia ke 2 jauhkanlah ",
      "favorite_count": 16,
      "retweet_count": 6,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.6600247621536255,
      "original_lang": NaN
    },
    {
      "id": "1909393303830671492",
      "text": "@fabworks_guy We are a family owned silicone compounder and fabricator in Texas. \n\nNo tariff related price increases on what we proudly build in the USA!",
      "cleaned_text": " we are a family owned silicone compounder and fabricator in texas no tariff related price increases on what we proudly build in the usa ",
      "favorite_count": 3,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.24118810892105103,
      "original_lang": "en"
    },
    {
      "id": "1909391995208188341",
      "text": "@IvanAtHome Tingin ko pabor pa nga sa atin yan mataas na tarif para sa kapitbansa natin, imagine kung lumipat sa pinas yungga manufacturer sa Vietnam sa taas ng tariff sa kanila ng USA. Pag sa pinas sila safe sila kasi PH is important to the USA sa pacific.",
      "cleaned_text": " tingin ko pabor pa nga sa atin yan mataas na tarif para sa kapitbansa natin imagine kung lumipat sa pinas yungga manufacturer sa vietnam sa taas ng tariff sa kanila ng usa pag sa pinas sila safe sila kasi ph is important to the usa sa pacific ",
      "favorite_count": 0,
      "retweet_count": 0,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.21441833674907684,
      "original_lang": NaN
    },
    {
      "id": "1909389493133795718",
      "text": "@MAGALieTracker GOLLY, TRUMP LIES AS USUAL! THE ECONOMY UNDER  DEMOCRATIC PRESIDENT JOE BIDEN WAS THE GREATEST ECONOMY THE USA EVER HAD AS EVEN FOX NEWS REPORTED! THE ECONOMY IS IN AN ECONOMIC DEPRESSION, STOCK MARKET CRASH BECAUSE OF THE REPUBLICAN TAX AND SPEND TARIFF POLICY!!!",
      "cleaned_text": " golly trump lies as usual the economy under democratic president joe biden was the greatest economy the usa ever had as even fox news reported the economy is in an economic depression stock market crash because of the republican tax and spend tariff policy ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8256638050079346,
      "original_lang": "en"
    },
    {
      "id": "1909386596442685692",
      "text": "Hoya ( see Homan some Mexican) So let’s play this mind game. Factories do set up on the USA. Another issue they would be assembling foreign produced parts. This tariff policy is a shocker.",
      "cleaned_text": "hoya see homan some mexican so let s play this mind game factories do set up on the usa another issue they would be assembling foreign produced parts this tariff policy is a shocker ",
      "favorite_count": 11,
      "retweet_count": 3,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.7705414295196533,
      "original_lang": "en"
    },
    {
      "id": "1909379764902834623",
      "text": "Everyone max bidding Crypto today must be retarded or know something the rest of us don't. \n\nTrump said today: If China doesn't remove their 34% retaliatory tariff on USA by tomorrow, He will smack them with another 50% effective April 9th. China won't give up that easily, they like pain. \n\nI am wondering are degens assuming the lows are in or what is the game plan here? \n\nBuy high sell low is not an strategy\n\n#Bitcoin",
      "cleaned_text": "everyone max bidding crypto today must be retarded or know something the rest of us don t trump said today if china doesn t remove their 34 retaliatory tariff on usa by tomorrow he will smack them with another 50 effective april 9th china won t give up that easily they like pain i am wondering are degens assuming the lows are in or what is the game plan here buy high sell low is not an strategy ",
      "favorite_count": 211,
      "retweet_count": 34,
      "reply_count": 11,
      "sentiment": "negative",
      "sentiment_score": -0.8724454045295715,
      "original_lang": "en"
    },
    {
      "id": "1909372169278406990",
      "text": "@thexcapitalist Tariff is the right thing to do for US, which  previous presidents (except the same dude) avoided due to the same risks that we are witnessing today.  The approach is too much and too quick however, IMO.  After renegotiations, and in the long term, USA and its companies win!",
      "cleaned_text": " tariff is the right thing to do for us which previous presidents except the same dude avoided due to the same risks that we are witnessing today the approach is too much and too quick however imo after renegotiations and in the long term usa and its companies win ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.17539286613464355,
      "original_lang": "en"
    },
    {
      "id": "1909371080097096025",
      "text": "The battles are just beginning.\n\nThe tariff war between US and China will last the longest.\n\nXi Jin Ping has the upper hand here. And he will milk it til the end.\n\nThe USA is hyper dependent on Chinese goods.\n\nEven with Tariffs, we'll still need their stuff. It'll take years to become independent of them.\n\nXi knows this. Xi will not fold. He will watch our temporary collapse and laugh his way to the bank.\n\nOther countries will fold quick. But China won't.",
      "cleaned_text": "the battles are just beginning the tariff war between us and china will last the longest xi jin ping has the upper hand here and he will milk it til the end the usa is hyper dependent on chinese goods even with tariffs we ll still need their stuff it ll take years to become independent of them xi knows this xi will not fold he will watch our temporary collapse and laugh his way to the bank other countries will fold quick but china won t ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.20755919814109802,
      "original_lang": "en"
    },
    {
      "id": "1909369979968893219",
      "text": "🇺🇸❌🇨🇳‼️China will not give in to pressure and will firmly defend its legal rights, the Chinese embassy in the US said after Trump's new threats on tariffs - Media\n\n#Trump #Tariff #tariffs #TariffWar #World #US #USA #BreakingNews‌ #breakingnews #BREAKING_NEWS #BREAKINGNEWS #China",
      "cleaned_text": " china will not give in to pressure and will firmly defend its legal rights the chinese embassy in the us said after trump s new threats on tariffs media ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.3120781481266022,
      "original_lang": "en"
    },
    {
      "id": "1909369130387489202",
      "text": "@IngrahamAngle Do you have a reason why? Tariff every country- even those with less than 2% or even those with NO PEOPLE OR TRADE? Yikes. Teenager hackers are running the USA- and all they want is money and girls",
      "cleaned_text": " do you have a reason why tariff every country even those with less than 2 or even those with no people or trade yikes teenager hackers are running the usa and all they want is money and girls",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.8926684260368347,
      "original_lang": "en"
    },
    {
      "id": "1909367400887468079",
      "text": "@JosBtrigga Self-educate. Why would you think Milton Friedman is only talking about the USA cannot tariff? Think a little? @POTUS always ends up being right and strategic. @elonmusk https://t.co/niKpvvamm4",
      "cleaned_text": " self educate why would you think milton friedman is only talking about the usa cannot tariff think a little always ends up being right and strategic ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.5522908568382263,
      "original_lang": "en"
    },
    {
      "id": "1909366977635770878",
      "text": "@berger_bo @atrupar The average tariff rate for all products traded between the USA and EU in both directions was about 3.7% before 2025. The EU applied ~3.95% on US goods, while the US applied ~3.5% on EU goods, based on 2023 trade values (€347B US to EU, €503B EU to US). https://t.co/eAzQ4h3sdK https://t.co/B28oYW8sHC",
      "cleaned_text": " the average tariff rate for all products traded between the usa and eu in both directions was about 3 7 before 2025 the eu applied 3 95 on us goods while the us applied 3 5 on eu goods based on 2023 trade values 347b us to eu 503b eu to us ",
      "favorite_count": 5,
      "retweet_count": 3,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.08609461039304733,
      "original_lang": "en"
    },
    {
      "id": "1909366052993016038",
      "text": "@RpsAgainstTrump Trump is creating a centrally controlled USSR style tariff government \n\nIt’s over for the USA unless Trump is removed fast",
      "cleaned_text": " trump is creating a centrally controlled ussr style tariff government it s over for the usa unless trump is removed fast",
      "favorite_count": 24,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8457121849060059,
      "original_lang": "en"
    },
    {
      "id": "1909365180804329916",
      "text": "USA Vs China Tariff War| Beijing Responds: ‘Tariff Blackmail’ Will Not Work\n\nThe Chinese government wasted no time in issuing a sharp response. The Global Times, a state-backed newspaper often seen as a mouthpiece\n\nMama T at OGM News 👇🏾\n\nhttps://t.co/xnLnDMIXZf https://t.co/TB3Lh0mBjE",
      "cleaned_text": "usa vs china tariff war beijing responds tariff blackmail will not work the chinese government wasted no time in issuing a sharp response the global times a state backed newspaper often seen as a mouthpiece mama t at ogm news ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8386769890785217,
      "original_lang": "en"
    },
    {
      "id": "1909364429382156505",
      "text": "@catturd2 @RandPaul why is it okay for the USA consumer to swallow tariffs but not okay for the other countries to swallow the same tariff? America last much?",
      "cleaned_text": " why is it okay for the usa consumer to swallow tariffs but not okay for the other countries to swallow the same tariff america last much ",
      "favorite_count": 43,
      "retweet_count": 10,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8735835552215576,
      "original_lang": "en"
    },
    {
      "id": "1909363904377180507",
      "text": "@ChuckGrassley 🖕🚽🐀\nBREAKING: NBC reports that the Senate bill to limit a President’s tariff power now has 7 Republican sponsors. \n🔴 Grassley\n🔴 Moran\n🔴 Murkowski\n🔴 McConnell\n🔴 Tillis\n🔴 Young\n🔴 Collins",
      "cleaned_text": " breaking nbc reports that the senate bill to limit a president s tariff power now has 7 republican sponsors grassley moran murkowski mcconnell tillis young collins",
      "favorite_count": 7,
      "retweet_count": 2,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.10993671417236328,
      "original_lang": "en"
    },
    {
      "id": "1909362154139943286",
      "text": "@retrotink2 @tatolitotoro @TheHauskarl He blocked me too after attacking me for localization work which I was good/effective at!\n\nI thought he was a champion of USA workers??? 😂\n\nI did not disrespect him in any way, I'm just really sad about losing @shoptemu/@AliExpress_EN prices to a crazy 50% tax/tariff!!! https://t.co/iDlN4Gy79o",
      "cleaned_text": " he blocked me too after attacking me for localization work which i was good effective at i thought he was a champion of usa workers i did not disrespect him in any way i m just really sad about losing prices to a crazy 50 tax tariff ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 3,
      "sentiment": "negative",
      "sentiment_score": -0.9404047727584839,
      "original_lang": "en"
    },
    {
      "id": "1909361607957684412",
      "text": "American citizens for over 50 years presidential administrations/Congress enacted legislation letting corporations leave AMERICA, ALLOW ALL FOREIGN NATIONS FRIEND/FOE \"TARIFF or BLOCK ALL USA MADE PRODUCTS\" etc. sat back on their ASSES doing nothing to level the FAIR-TRADE FIELD!",
      "cleaned_text": "american citizens for over 50 years presidential administrations congress enacted legislation letting corporations leave america allow all foreign nations friend foe tariff or block all usa made products etc sat back on their asses doing nothing to level the fair trade field ",
      "favorite_count": 1,
      "retweet_count": 0,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8004918098449707,
      "original_lang": "en"
    },
    {
      "id": "1909360839674445994",
      "text": "@DerrickEvans4WV Sweet Caroline...sing it! Its baseball tariff season...lets go 9 inning game...who has the best pitch? I say USA! 🇺🇸 USA! USA!",
      "cleaned_text": " sweet caroline sing it its baseball tariff season lets go 9 inning game who has the best pitch i say usa usa usa ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.38229432702064514,
      "original_lang": "en"
    },
    {
      "id": "1909360675102536096",
      "text": "@TinaLeungPoetry @GlobeEyeNews Why bow to a bully? USA can’t win the fair competition, that is why they are increase the tariff",
      "cleaned_text": " why bow to a bully usa can t win the fair competition that is why they are increase the tariff",
      "favorite_count": 93,
      "retweet_count": 1,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.9115879535675049,
      "original_lang": "en"
    },
    {
      "id": "1909358240380731822",
      "text": "No, I want these people deciding USA tariff policy because that’s what the constitution says should happen. https://t.co/MfU0Gk8knd",
      "cleaned_text": "no i want these people deciding usa tariff policy because that s what the constitution says should happen ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.06530269980430603,
      "original_lang": "en"
    },
    {
      "id": "1909358090614358100",
      "text": "Multiple recent polls show the president's favorability slipping below 50%. Many voters say they disagree with his aggressive tariff plan. https://t.co/t4Fedqg0cJ",
      "cleaned_text": "multiple recent polls show the president s favorability slipping below 50 many voters say they disagree with his aggressive tariff plan ",
      "favorite_count": 3,
      "retweet_count": 2,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.3114500641822815,
      "original_lang": "en"
    },
    {
      "id": "1909355416430981499",
      "text": "Don Bacon and Rand Paul want these people deciding USA tariff policies instead of President Trump. https://t.co/rUCpVE6ckh",
      "cleaned_text": "don bacon and rand paul want these people deciding usa tariff policies instead of president trump ",
      "favorite_count": 4197,
      "retweet_count": 1346,
      "reply_count": 700,
      "sentiment": "negative",
      "sentiment_score": -0.3695356845855713,
      "original_lang": "en"
    },
    {
      "id": "1909354123452891295",
      "text": "Nigel Farage after forcing brexit on Britain eventually admitted Brexit has failed. He said it wasn’t done properly bc we didn’t do a USA deal.\n\nHe called Trump’s brutal tariff regime “genius”.\n\nNow, Farage is backing away because even he sees the chaos: global trade turmoil, spiralling inflation, and recession warnings. \n\nTurns out wrecking the rules has real-world consequences.\n\nBritain needs serious strategy, not slogans and stunts.\n#SaveBritishFarming \n\nhttps://t.co/qLbZZKZiUN",
      "cleaned_text": "nigel farage after forcing brexit on britain eventually admitted brexit has failed he said it wasn t done properly bc we didn t do a usa deal he called trump s brutal tariff regime genius now farage is backing away because even he sees the chaos global trade turmoil spiralling inflation and recession warnings turns out wrecking the rules has real world consequences britain needs serious strategy not slogans and stunts ",
      "favorite_count": 57,
      "retweet_count": 33,
      "reply_count": 11,
      "sentiment": "negative",
      "sentiment_score": -0.8410173654556274,
      "original_lang": "en"
    },
    {
      "id": "1909351315223818613",
      "text": "@GovernorShapiro Josh is a crooked bastard ripping of PA residents. His State PA Liquor stores added 10% tariff to a wine, that is 100% grown, made and packaged in the USA. He is is just a corrupt politician.",
      "cleaned_text": " josh is a crooked bastard ripping of pa residents his state pa liquor stores added 10 tariff to a wine that is 100 grown made and packaged in the usa he is is just a corrupt politician ",
      "favorite_count": 11,
      "retweet_count": 4,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8984985947608948,
      "original_lang": "en"
    },
    {
      "id": "1909349989513675019",
      "text": "Treasury Secretary, Scott Bessent states that close to 70 Countries have now requested Tariff discussions with the Trump Administration. Are you tired of WINNING yet? 👏🏻🇺🇸 https://t.co/ofp62aCGpb",
      "cleaned_text": "treasury secretary scott bessent states that close to 70 countries have now requested tariff discussions with the trump administration are you tired of winning yet ",
      "favorite_count": 25,
      "retweet_count": 2,
      "reply_count": 3,
      "sentiment": "negative",
      "sentiment_score": -0.7883005142211914,
      "original_lang": "en"
    },
    {
      "id": "1909349867224547595",
      "text": "putting all foreign countries under a blanket 100% and above tariff levels will be the fastest way to stop any and all trade into the USA \n\nseems to be a mistake letting tantrum be the one to implement foreign policy imo",
      "cleaned_text": "putting all foreign countries under a blanket 100 and above tariff levels will be the fastest way to stop any and all trade into the usa seems to be a mistake letting tantrum be the one to implement foreign policy imo",
      "favorite_count": 3,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8890047073364258,
      "original_lang": "en"
    },
    {
      "id": "1909349668892422425",
      "text": "@_wake_up_USA That's not the same as setting the tariff to $0 on both sides though.",
      "cleaned_text": " that s not the same as setting the tariff to 0 on both sides though ",
      "favorite_count": 3,
      "retweet_count": 3,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.5192075967788696,
      "original_lang": "en"
    },
    {
      "id": "1909348473939673147",
      "text": "Tariffs are a bargaining tool. US tariffs were never meant to be permanent. However, Canada has permanent tariffs against the USA &amp; they’re huge, CA tariffs punish US people, the US farmers &amp; US consumers. CA needs to look at the tariff numbers &amp; lower them to zero. It’s Simple.",
      "cleaned_text": "tariffs are a bargaining tool us tariffs were never meant to be permanent however canada has permanent tariffs against the usa amp they re huge ca tariffs punish us people the us farmers amp us consumers ca needs to look at the tariff numbers amp lower them to zero it s simple ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.794011116027832,
      "original_lang": "en"
    },
    {
      "id": "1909348308696678621",
      "text": "#BREAKING #China #USA China has stated that it will not succumb to pressure or threats following a vow from U.S. President Donald Trump to impose an additional 50% tariff on Chinese goods unless Beijing retracts its planned countermeasures.\nhttps://t.co/5b6PcNQsru",
      "cleaned_text": " china has stated that it will not succumb to pressure or threats following a vow from u s president donald trump to impose an additional 50 tariff on chinese goods unless beijing retracts its planned countermeasures ",
      "favorite_count": 6,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.4692835807800293,
      "original_lang": "en"
    },
    {
      "id": "1909344866661790037",
      "text": "@Jake_Randall_YT Of course, even if Vietnam went full zero tariff and NTB on the USA (assuming US does as well, which it won't as one of the worst trade protectionist and subsidy offenders), $4k GDP per capita still isn't going to drive purchases of F150s from Dearborn or Teslas from Texas.",
      "cleaned_text": " of course even if vietnam went full zero tariff and ntb on the usa assuming us does as well which it won t as one of the worst trade protectionist and subsidy offenders 4k gdp per capita still isn t going to drive purchases of f150s from dearborn or teslas from texas ",
      "favorite_count": 23,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.868023693561554,
      "original_lang": "en"
    },
    {
      "id": "1909344697870409880",
      "text": "💥 Trump put a 34% import tariff on China.  China responded by placing a 34% tariff on the USA. Now Trump says if they don't remove their tariff, he will add an additional 50% tariff on China (84% total).\n\nAn 84% tariff on all Chinese imports would plunge the U.S. into economic crisis. Prices on essential goods would surge overnight, igniting uncontrollable inflation and squeezing American households to the breaking point. \n\nCritical supply chains would seize up, forcing factories to shut down and triggering mass layoffs across manufacturing, retail, and logistics. \n\nConsumer spending would collapse, dragging the country into a deep, prolonged recession. \n\nChina’s retaliation would cripple U.S. exports, especially in agriculture and tech, escalating into a full-blown trade war. \n\nGlobal markets would fracture, the U.S. would face international isolation, and economic panic would spread as jobs vanish, shelves empty, and families struggle to survive a new era of economic devastation and geopolitical upheaval.",
      "cleaned_text": " trump put a 34 import tariff on china china responded by placing a 34 tariff on the usa now trump says if they don t remove their tariff he will add an additional 50 tariff on china 84 total an 84 tariff on all chinese imports would plunge the u s into economic crisis prices on essential goods would surge overnight igniting uncontrollable inflation and squeezing american households to the breaking point critical supply chains would seize up forcing factories to shut down and triggering mass layoffs across manufacturing retail and logistics consumer spending would collapse dragging the country into a deep prolonged recession china s retaliation would cripple u s exports especially in agriculture and tech escalating into a full blown trade war global markets would fracture the u s would face international isolation and economic panic would spread as jobs vanish shelves empty and families struggle to survive a new era of economic devastation and geopolitical upheaval ",
      "favorite_count": 10,
      "retweet_count": 7,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.29183363914489746,
      "original_lang": "en"
    },
    {
      "id": "1909338826189000735",
      "text": "@fordnation You sold Ontario out for the liberal party. 600,000 jobs and growing lost because you wouldn’t make a 0 tariff trade deal for Ontario with the USA.",
      "cleaned_text": " you sold ontario out for the liberal party 600 000 jobs and growing lost because you wouldn t make a 0 tariff trade deal for ontario with the usa ",
      "favorite_count": 6,
      "retweet_count": 3,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8518881797790527,
      "original_lang": "en"
    },
    {
      "id": "1909332145283170410",
      "text": "@ConfettiPixie \"25% tariff for YOU, France! 40% tariff for YOU, UK. 50% tariff for YOU, USA.\n...\nHEY - HOW DARE YOU IMPOSE TARIFFS ON US, USA!\" https://t.co/Vj9pSPWYjO",
      "cleaned_text": " 25 tariff for you france 40 tariff for you uk 50 tariff for you usa hey how dare you impose tariffs on us usa ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.6208944916725159,
      "original_lang": "en"
    },
    {
      "id": "1909330156235215325",
      "text": "@RightWingCope This is the perfect tariff example because there is only one company who manufactures the Switch 2. There is absolutely no benefit to moving production to the USA. If you want a Switch, you will pay the price for it, tariffs included.",
      "cleaned_text": " this is the perfect tariff example because there is only one company who manufactures the switch 2 there is absolutely no benefit to moving production to the usa if you want a switch you will pay the price for it tariffs included ",
      "favorite_count": 11,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.18036872148513794,
      "original_lang": "en"
    },
    {
      "id": "1909326879141904536",
      "text": "@DrewPavlou Audi has stopped exporting to USA.\nLada ready to pick up the slack with their finest engineering tariff free! https://t.co/ihAQR1ERDt",
      "cleaned_text": " audi has stopped exporting to usa lada ready to pick up the slack with their finest engineering tariff free ",
      "favorite_count": 24,
      "retweet_count": 4,
      "reply_count": 3,
      "sentiment": "negative",
      "sentiment_score": -0.2221946269273758,
      "original_lang": "en"
    },
    {
      "id": "1909326361019531588",
      "text": "$FNGR $ZJYL $DJT $GBUX $GTII $DBMM $MMTLP so even Thialand understands the importance of Stopping #shortselling #counterfeitshares USA Crickets instead we see fake news of Tariff Pauses to quickly make some money on the puts and calls as they post fake rumours.",
      "cleaned_text": " fngr zjyl djt gbux gtii dbmm mmtlp so even thialand understands the importance of stopping usa crickets instead we see fake news of tariff pauses to quickly make some money on the puts and calls as they post fake rumours ",
      "favorite_count": 43,
      "retweet_count": 13,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.4198354482650757,
      "original_lang": "en"
    },
    {
      "id": "1909325063977120230",
      "text": "@Rightanglenews Ok tariff india so they make them in USA which is the point of all of this????",
      "cleaned_text": " ok tariff india so they make them in usa which is the point of all of this ",
      "favorite_count": 61,
      "retweet_count": 1,
      "reply_count": 27,
      "sentiment": "negative",
      "sentiment_score": -0.20700639486312866,
      "original_lang": "en"
    },
    {
      "id": "1909324742953517547",
      "text": "After being shot and nearly killed, why would anyone expect President Trump to be afraid of a little tariff war? https://t.co/z7Epk8D3zK",
      "cleaned_text": "after being shot and nearly killed why would anyone expect president trump to be afraid of a little tariff war ",
      "favorite_count": 30,
      "retweet_count": 3,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.8910173773765564,
      "original_lang": "en"
    },
    {
      "id": "1909319288034672792",
      "text": "@TrumpDailyPosts Disgusting @Apple wants to circumvent the china tariff and begin production in India! We need to start penalizing American companies that refuse to do business in America!",
      "cleaned_text": " disgusting wants to circumvent the china tariff and begin production in india we need to start penalizing american companies that refuse to do business in america ",
      "favorite_count": 10,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.9253324270248413,
      "original_lang": "en"
    },
    {
      "id": "1909319060405600356",
      "text": "Like by now they’re charging us “Stock market Crash Levy” and “USA 10% tariff levy”",
      "cleaned_text": "like by now they re charging us stock market crash levy and usa 10 tariff levy ",
      "favorite_count": 266,
      "retweet_count": 46,
      "reply_count": 6,
      "sentiment": "negative",
      "sentiment_score": -0.46410953998565674,
      "original_lang": "en"
    },
    {
      "id": "1909318008326992207",
      "text": "@allenanalysis I know, I don't understand how the so called \"BEST finance ppl in the world\" can tariff an island of penquins or an island w/ only imports from USA and when they have no exports! Why the US tariff some of the poorest nations in the world and why tariff nations at war like Israel? https://t.co/pdsvPa0Dd3",
      "cleaned_text": " i know i don t understand how the so called best finance ppl in the world can tariff an island of penquins or an island w only imports from usa and when they have no exports why the us tariff some of the poorest nations in the world and why tariff nations at war like israel ",
      "favorite_count": 8,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8650822043418884,
      "original_lang": "en"
    },
    {
      "id": "1909317635080102318",
      "text": "The U.S.-China trade war is heating up—China’s 34% tariff counters Trump’s 54%, and now a 50% hike looms by April 8. This cycle risks our supply of essentials like medicine and tech. It’s time to act! Let’s turn abandoned malls into U.S. manufacturing hubs to secure our future—jobs, pride, and independence. Join the #BuyAmerican movement and share your ideas to make it happen!  https://t.co/yrIxs83xw4",
      "cleaned_text": "the u s china trade war is heating up china s 34 tariff counters trump s 54 and now a 50 hike looms by april 8 this cycle risks our supply of essentials like medicine and tech it s time to act let s turn abandoned malls into u s manufacturing hubs to secure our future jobs pride and independence join the movement and share your ideas to make it happen ",
      "favorite_count": 4,
      "retweet_count": 4,
      "reply_count": 1,
      "sentiment": "neutral",
      "sentiment_score": 0.03436914086341858,
      "original_lang": "en"
    },
    {
      "id": "1909312897768993043",
      "text": "BREAKING: In an unprecedented moment, #FoxNews Maria Bartiromo speaks reality, finally admitting to viewers that #Trump's tariff policies will lead to a deep American recession. \nThis is not what Trump voters wanted!\n\nhttps://t.co/i8YJU2Oy5l \n#TrumpRecession #TrumpTarrifs #MAGA",
      "cleaned_text": "breaking in an unprecedented moment maria bartiromo speaks reality finally admitting to viewers that s tariff policies will lead to a deep american recession this is not what trump voters wanted ",
      "favorite_count": 1,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": -0.04966682195663452,
      "original_lang": "en"
    },
    {
      "id": "1909312595011469690",
      "text": "Ja, es gibt historische Beispiele, wo Industriezölle Länder gestärkt haben. Die USA im 19. Jh. nutzten Zölle wie den Tariff Act von 1789, um ihre Industrie zu fördern, was zum schnellen Wachstum beitrug. Deutschland ab 1879 schützte mit Zöllen seine Stahlindustrie und wurde europäischer Marktführer. Japan nach dem 2. Weltkrieg unterstützte mit Zöllen seinen Wirtschaftsaufschwung, etwa in Stahl und Elektronik. Der Effekt ist jedoch umstritten, da andere Faktoren wie Technologie und Ressourcen auch entscheidend waren. https://t.co/BFoTHXcJ8D",
      "cleaned_text": "ja es gibt historische beispiele wo industriezölle länder gestärkt haben die usa im 19 jh nutzten zölle wie den tariff act von 1789 um ihre industrie zu fördern was zum schnellen wachstum beitrug deutschland ab 1879 schützte mit zöllen seine stahlindustrie und wurde europäischer marktführer japan nach dem 2 weltkrieg unterstützte mit zöllen seinen wirtschaftsaufschwung etwa in stahl und elektronik der effekt ist jedoch umstritten da andere faktoren wie technologie und ressourcen auch entscheidend waren ",
      "favorite_count": 35,
      "retweet_count": 4,
      "reply_count": 6,
      "sentiment": "negative",
      "sentiment_score": -0.135329470038414,
      "original_lang": NaN
    },
    {
      "id": "1909309907087556902",
      "text": "@BowesChay Never trust this german nazi lady and her gestapo methods. Peter Navarro, Trumps senior adviser on trade, already called it zero tariff cheating and misdirection.",
      "cleaned_text": " never trust this german nazi lady and her gestapo methods peter navarro trumps senior adviser on trade already called it zero tariff cheating and misdirection ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8974957466125488,
      "original_lang": "en"
    },
    {
      "id": "1909309598978429203",
      "text": "Analysts say Thailand may not actually suffer 890 billion baht in damages from the US's 36% tariff hike, as Thailand is a transit point for Chinese goods to the US.\n\n https://t.co/IlFv6Gmi6e\n\n#Thailand #China #USA #TradeWar #AnimalverseSocial #SocialFi",
      "cleaned_text": "analysts say thailand may not actually suffer 890 billion baht in damages from the us s 36 tariff hike as thailand is a transit point for chinese goods to the us ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.43422460556030273,
      "original_lang": "en"
    },
    {
      "id": "1909309405113598107",
      "text": "I don't think China will not \"cave\" in just yet.\nChow Chow Party cannot afford to loose \"face\" in front of the Chinese people.\n\nChow Chow Party will try to do this:\n1. Try and get Vietnam, Malaysia, Thailand, South Korea, and Mexico to do Zero Tariff deals with USA. These countries are nothing but extensions of Chow Chow factories.\n2. Next - Drop the Yuan value.\n3. Next - Dump about 15 to 20% US bonds it holds.\n4. Then Dump excess production into GCC trading hubs.\n5. Then Dump the rest of the excess production into Africa and South America (excluding Argentina).\n\nThe plan hinges on US agreeing to Zero Tariffs with Chow Chow Satellites.\n\nP.S. Chow Chow will also offer a ₹ - ¥ \"Trade Deal\" to India",
      "cleaned_text": "i don t think china will not cave in just yet chow chow party cannot afford to loose face in front of the chinese people chow chow party will try to do this 1 try and get vietnam malaysia thailand south korea and mexico to do zero tariff deals with usa these countries are nothing but extensions of chow chow factories 2 next drop the yuan value 3 next dump about 15 to 20 us bonds it holds 4 then dump excess production into gcc trading hubs 5 then dump the rest of the excess production into africa and south america excluding argentina the plan hinges on us agreeing to zero tariffs with chow chow satellites p s chow chow will also offer a trade deal to india",
      "favorite_count": 20,
      "retweet_count": 3,
      "reply_count": 3,
      "sentiment": "negative",
      "sentiment_score": -0.4875452220439911,
      "original_lang": "en"
    },
    {
      "id": "1909309007854014974",
      "text": "@RapidResponse47 @POTUS Canada put 25% tariffs on the USA and they didn’t raise our tariff 😂",
      "cleaned_text": " canada put 25 tariffs on the usa and they didn t raise our tariff ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.7113776206970215,
      "original_lang": "en"
    },
    {
      "id": "1909308582257926245",
      "text": "@meezolpj Tit for tat escalates. Now an additional 50% tariff from the #USA, if #China doesn’t withdraw its 34% retaliatory tariff.\n\nWill spiral further unless effective trade strategy.\n\nLike a delicious #curry, policies needs the perfect splash of #ghee to make it tasty &amp; satisfying. 😋",
      "cleaned_text": " tit for tat escalates now an additional 50 tariff from the if doesn t withdraw its 34 retaliatory tariff will spiral further unless effective trade strategy like a delicious policies needs the perfect splash of to make it tasty amp satisfying ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 6,
      "sentiment": "neutral",
      "sentiment_score": 0.04370403289794922,
      "original_lang": "en"
    },
    {
      "id": "1909307162838413590",
      "text": "25% tariff on cars?\nDon't worry, buy Musk's Tesla.\n\nWant to Make in the USA, but worried about high wages?\nDon't worry, buy Musk's robots.",
      "cleaned_text": "25 tariff on cars don t worry buy musk s tesla want to make in the usa but worried about high wages don t worry buy musk s robots ",
      "favorite_count": 36,
      "retweet_count": 5,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.18977779150009155,
      "original_lang": "en"
    },
    {
      "id": "1909305611038187753",
      "text": "Underlying this tariff situation is the following problem: China is poised to move into tech R&D/product design, which, combined with their manufacturing dominance, would reduce the USA to an unsustainable pure consumerism. \n\nThis would position China as the next global hegemon. The problem, however, is that everyone's money from Sweden to Singapore to the UAE is tied up in the market for US Treasuries, which is the only market on the planet big enough to handle sovereign wealth & similar scale investments. \n\nSo if the US economy goes under, all this money will be lost, or will have to moved elsewhere. But where to put it? China is not an option, as the CCP can confiscate all your wealth. Even the Chinese themselves park their money in US & Canadian real estate for this reason. Europe is dependent on the USA. Russia is too corrupt, Indian is too corrupt & too chaotic. \n\nThere is no successor to the USA. So the failure of the US economy is really the failure of globalization, which is best understood as Anglo global rule. No one want this. \n\nWhat we're seeing with these tariffs is, I suspect, an attempt to chart a new course in a world in which globalization's internal contradictions are much more active & apparent.",
      "cleaned_text": "underlying this tariff situation is the following problem china is poised to move into tech r d product design which combined with their manufacturing dominance would reduce the usa to an unsustainable pure consumerism this would position china as the next global hegemon the problem however is that everyone s money from sweden to singapore to the uae is tied up in the market for us treasuries which is the only market on the planet big enough to handle sovereign wealth similar scale investments so if the us economy goes under all this money will be lost or will have to moved elsewhere but where to put it china is not an option as the ccp can confiscate all your wealth even the chinese themselves park their money in us canadian real estate for this reason europe is dependent on the usa russia is too corrupt indian is too corrupt too chaotic there is no successor to the usa so the failure of the us economy is really the failure of globalization which is best understood as anglo global rule no one want this what we re seeing with these tariffs is i suspect an attempt to chart a new course in a world in which globalization s internal contradictions are much more active apparent ",
      "favorite_count": 143,
      "retweet_count": 8,
      "reply_count": 9,
      "sentiment": "negative",
      "sentiment_score": -0.36456984281539917,
      "original_lang": "en"
    },
    {
      "id": "1909304583387590817",
      "text": "Have the usa forgotten about Mitt Romney ? And also forgotten what he said about Trump's tariff hammer ? Yeah well, now they have to feel what it means. #TrumpRecession #TrumpisaNationalDisgrace #TrumpRecession #TrumpMarketCrash",
      "cleaned_text": "have the usa forgotten about mitt romney and also forgotten what he said about trump s tariff hammer yeah well now they have to feel what it means ",
      "favorite_count": 47,
      "retweet_count": 19,
      "reply_count": 3,
      "sentiment": "negative",
      "sentiment_score": -0.7739875912666321,
      "original_lang": "en"
    },
    {
      "id": "1909303654948929608",
      "text": "🚨 JUST IN: 🇪🇺 EU proposes a 25% TARIFF on US goods! 🇺🇸\n\n⚠️ Trade tensions are heating up FAST — could this spark a full-blown trade war? 🔥\n\n#Trump #TradeWar #EU #USA #Tariffs #GlobalMarkets https://t.co/9g2d9RDQZp",
      "cleaned_text": " just in eu proposes a 25 tariff on us goods trade tensions are heating up fast could this spark a full blown trade war ",
      "favorite_count": 17,
      "retweet_count": 4,
      "reply_count": 4,
      "sentiment": "negative",
      "sentiment_score": -0.05703648924827576,
      "original_lang": "en"
    },
    {
      "id": "1909303415269700011",
      "text": "@timesofindia Trump tariff and the future of globalisation. Interesting times ahead \n#tariffwar #TrumpTariffs #USA #GDP #Trump #IndianEconomy #Nifty500 #Shares #GlobalEconomy #TradeWar #Globalisation #China #EU #Modi #DonaldTrump #tariffs #Export #recession #niftycrash\nhttps://t.co/GAB3UCFBpk",
      "cleaned_text": " trump tariff and the future of globalisation interesting times ahead ",
      "favorite_count": 2,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.640010416507721,
      "original_lang": "en"
    },
    {
      "id": "1909301411139014682",
      "text": "@vonderleyen Smart of you Ursula - to listen to Trump!\n\nTrump will make at deal!\n\nUSA only want 50% tariffs on all German cars! 😂\nAnd 75% tariff on all products from Novo Nordisk!",
      "cleaned_text": " smart of you ursula to listen to trump trump will make at deal usa only want 50 tariffs on all german cars and 75 tariff on all products from novo nordisk ",
      "favorite_count": 4,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.23328568041324615,
      "original_lang": "en"
    },
    {
      "id": "1909300012611518476",
      "text": "And second, that this power comes from the availability of substitute goods that are made (or could be made) in the USA.\n\nIt's *possible* for there to be a market economy in which buyers can force sellers to eat tariff costs. \n\n17/",
      "cleaned_text": "and second that this power comes from the availability of substitute goods that are made or could be made in the usa it s possible for there to be a market economy in which buyers can force sellers to eat tariff costs 17 ",
      "favorite_count": 22,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "positive",
      "sentiment_score": 0.39123162627220154,
      "original_lang": "en"
    },
    {
      "id": "1909298571679007032",
      "text": "@CasonCarbaughGa I listened to him. He's talking about if we experience higher tariff rates for longer and don't see increased investment in the USA or reductions in taxes across corporate, social security, tips, and overtime. \n\nOf which I am NOT worried about.",
      "cleaned_text": " i listened to him he s talking about if we experience higher tariff rates for longer and don t see increased investment in the usa or reductions in taxes across corporate social security tips and overtime of which i am not worried about ",
      "favorite_count": 3,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.5128089785575867,
      "original_lang": "en"
    },
    {
      "id": "1909298229444751646",
      "text": "(1/x) Tariff Thoughts ⛴️📦🚚\n\nWhy is Trump levying high tariffs? 🏗️🏭\n- to rebalance USA trade currently in deep deficit from half a century of offshoring mfg to lower cost nations.\n- to fix the US P&L, currently plagued with exceedingly higher spend and interest payments than revenue\n- maaaaaybe to force fed’s hand to reduce interest rates so that we can refi massive outstanding debt balance at lower interest payments. Tbd on this",
      "cleaned_text": " 1 x tariff thoughts why is trump levying high tariffs to rebalance usa trade currently in deep deficit from half a century of offshoring mfg to lower cost nations to fix the us p l currently plagued with exceedingly higher spend and interest payments than revenue maaaaaybe to force fed s hand to reduce interest rates so that we can refi massive outstanding debt balance at lower interest payments tbd on this",
      "favorite_count": 174,
      "retweet_count": 27,
      "reply_count": 26,
      "sentiment": "negative",
      "sentiment_score": -0.17132055759429932,
      "original_lang": "en"
    },
    {
      "id": "1909297988456902770",
      "text": "@elonmusk People worked for piddly squat to make the pencil. Then their countries decided to tariff the crap out of the USA so those people could continue to work for crap wages, but their governments could take in money so that they could continue to work for piddly squat.",
      "cleaned_text": " people worked for piddly squat to make the pencil then their countries decided to tariff the crap out of the usa so those people could continue to work for crap wages but their governments could take in money so that they could continue to work for piddly squat ",
      "favorite_count": 3,
      "retweet_count": 1,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.6196222305297852,
      "original_lang": "en"
    },
    {
      "id": "1909293513683972417",
      "text": "@ProfiticusM @WhiteHouse It should be a variable tariff with something like a 10% maximum... the over 50% tariffs , unless it's some good reason are a hurdle &amp; big one Maximus: \n\nHowever for years $AAPL's built up facilities in USA:  $AAPL will be fine:  They got @tim_cook he is the best",
      "cleaned_text": " it should be a variable tariff with something like a 10 maximum the over 50 tariffs unless it s some good reason are a hurdle amp big one maximus however for years aapl s built up facilities in usa aapl will be fine they got he is the best",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "positive",
      "sentiment_score": 0.11183729767799377,
      "original_lang": "en"
    },
    {
      "id": "1909292941870260426",
      "text": "0 Tariff 100% Democrat Funded🎿🏂💰💰💰💰",
      "cleaned_text": "0 tariff 100 democrat funded ",
      "favorite_count": 4,
      "retweet_count": 2,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.21308618783950806,
      "original_lang": "en"
    },
    {
      "id": "1909289886949294164",
      "text": "USA exports to China had 7 or 10% tariff two weeks ago, now 34% and soon 50%. US dollar reserve currency status will be a thing of the past by the end of the year at this pace.",
      "cleaned_text": "usa exports to china had 7 or 10 tariff two weeks ago now 34 and soon 50 us dollar reserve currency status will be a thing of the past by the end of the year at this pace ",
      "favorite_count": 4,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": 0.03876328468322754,
      "original_lang": "en"
    },
    {
      "id": "1909289749413511466",
      "text": "#TariffWar 🚨\nIn 2023, 🇺🇸 exported $3.07T ($2.05T goods, $1.03T services).\nTop trade partners: 🇨🇦🇲🇽🇨🇳🇩🇪🇯🇵\nIs #Tariff pressure about to hammer U.S. exports?\n#USA #TradeBalance #ExportImportByUSA https://t.co/WGvOSW1l1A",
      "cleaned_text": " in 2023 exported 3 07t 2 05t goods 1 03t services top trade partners is pressure about to hammer u s exports ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.3021892309188843,
      "original_lang": "en"
    },
    {
      "id": "1909288433828401157",
      "text": "And the circus of ADDITIONAL TARIFF can be imposed by both the US and China. And the ultimate sufferers will be US consumers. As the manufacturing hub is in China not in USA. And it will take years and years to build the manufacturing infrastructure in the USA. And then the Manpower for those small jobs like stiching shoes or packaging of different products. Is the USA ready for it?",
      "cleaned_text": "and the circus of additional tariff can be imposed by both the us and china and the ultimate sufferers will be us consumers as the manufacturing hub is in china not in usa and it will take years and years to build the manufacturing infrastructure in the usa and then the manpower for those small jobs like stiching shoes or packaging of different products is the usa ready for it ",
      "favorite_count": 3,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.3082317113876343,
      "original_lang": "en"
    },
    {
      "id": "1909288076616290383",
      "text": "#tariff #tariffs #china #trade #tradewar #markets #investing #news #usa #investment #investors #investor #invest #trump #donaldtrump #economy #tax #tariffman #usbusiness #werindia #usbased #currency #us #xijinping #stock #forex #stockmarkets #stockmark \n https://t.co/LjeaBGtkoy",
      "cleaned_text": " ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": -0.029572218656539917,
      "original_lang": "en"
    },
    {
      "id": "1909286811987501315",
      "text": "Folks don't understand that Xi won't back down , and that 50% new Tariff increase is like war, they will up that 50% back to USA, so disaster.  $SPY $IWM $QQQ   We going way lower",
      "cleaned_text": "folks don t understand that xi won t back down and that 50 new tariff increase is like war they will up that 50 back to usa so disaster spy iwm qqq we going way lower",
      "favorite_count": 6,
      "retweet_count": 1,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.8155897259712219,
      "original_lang": "en"
    },
    {
      "id": "1909285762958323796",
      "text": "@instablog9ja Chaina increase tariff to 70-80% on USA! What about Trump and USA people 🤔",
      "cleaned_text": " chaina increase tariff to 70 80 on usa what about trump and usa people ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.398509681224823,
      "original_lang": "en"
    },
    {
      "id": "1909285501351194918",
      "text": "@CoryBMorgan One thing this has exposed is how many countries tariff the crap out of the USA, seems like it’s high time for an adjustment imo",
      "cleaned_text": " one thing this has exposed is how many countries tariff the crap out of the usa seems like it s high time for an adjustment imo",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8050757050514221,
      "original_lang": "en"
    },
    {
      "id": "1909283543915647471",
      "text": "The total import of USA in 2024 were around $4,000 billion ($4 trillion).\nPakistan's total export to the USA were $5 billion.\nNot sure, why they even considered us in their tariff war.\n😃",
      "cleaned_text": "the total import of usa in 2024 were around 4 000 billion 4 trillion pakistan s total export to the usa were 5 billion not sure why they even considered us in their tariff war ",
      "favorite_count": 404,
      "retweet_count": 30,
      "reply_count": 46,
      "sentiment": "negative",
      "sentiment_score": -0.5275952219963074,
      "original_lang": "en"
    },
    {
      "id": "1909283148178809212",
      "text": "This is the math and the truth behind modern day slavery and why America is actually unstoppable moving forward.  https://t.co/BMt3AjkQt1 #usa #economy #slavery #tariff @elonmusk https://t.co/BIRLkuRok0",
      "cleaned_text": "this is the math and the truth behind modern day slavery and why america is actually unstoppable moving forward ",
      "favorite_count": 2,
      "retweet_count": 0,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.6115789413452148,
      "original_lang": "en"
    },
    {
      "id": "1909283112191918270",
      "text": "The cabinet can stop this with the 25th amendment. 🚨\n\nCongress can stop this by revoking his ability to tariff. 🚨",
      "cleaned_text": "the cabinet can stop this with the 25th amendment congress can stop this by revoking his ability to tariff ",
      "favorite_count": 39,
      "retweet_count": 10,
      "reply_count": 7,
      "sentiment": "negative",
      "sentiment_score": -0.2837026119232178,
      "original_lang": "en"
    },
    {
      "id": "1909282274358550549",
      "text": "guys help me out\n\ndoes a 104% tariff on one of my largest trading partners help my manufacturing industry",
      "cleaned_text": "guys help me out does a 104 tariff on one of my largest trading partners help my manufacturing industry",
      "favorite_count": 1978,
      "retweet_count": 110,
      "reply_count": 16,
      "sentiment": "negative",
      "sentiment_score": -0.16360872983932495,
      "original_lang": "en"
    },
    {
      "id": "1909281659515813984",
      "text": "@Jingjing_Li @TrumpDailyPosts I think it's the other way round. China 🇨🇳 has been bullying the USA and with Trump, USA 🇺🇸 is now pushing back.\n\nChina should go for 0% tariff to compete on equal ground. China is currently #1 manufacturer in the world but yet afraid to compete equally.\n\n🍿 🍿 🍿 🍿 🍿",
      "cleaned_text": " i think it s the other way round china has been bullying the usa and with trump usa is now pushing back china should go for 0 tariff to compete on equal ground china is currently manufacturer in the world but yet afraid to compete equally ",
      "favorite_count": 76,
      "retweet_count": 4,
      "reply_count": 24,
      "sentiment": "negative",
      "sentiment_score": -0.818393349647522,
      "original_lang": "en"
    },
    {
      "id": "1909281126247747651",
      "text": "@JackPosobiec The Tariff experts that were Border experts last week are making things worse! They need to calm down and shut up! They’re making Trump look like he doesn’t know what he’s doing!",
      "cleaned_text": " the tariff experts that were border experts last week are making things worse they need to calm down and shut up they re making trump look like he doesn t know what he s doing ",
      "favorite_count": 6,
      "retweet_count": 2,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.9334657192230225,
      "original_lang": "en"
    },
    {
      "id": "1909280834995253706",
      "text": "The tariff wars can get drastically worse.\n\nUSA holds a lot of the cards outside of China but as a producing nation and one with Taiwan that produces most of the worlds semi conductors - this is one of the worlds most valued modern day resources.\n\nChina can pressure or disrupt Taiwan’s shipping with military.\n\nThis leads us to the great semi conductor war…",
      "cleaned_text": "the tariff wars can get drastically worse usa holds a lot of the cards outside of china but as a producing nation and one with taiwan that produces most of the worlds semi conductors this is one of the worlds most valued modern day resources china can pressure or disrupt taiwan s shipping with military this leads us to the great semi conductor war ",
      "favorite_count": 21,
      "retweet_count": 2,
      "reply_count": 7,
      "sentiment": "negative",
      "sentiment_score": -0.5639455318450928,
      "original_lang": "en"
    },
    {
      "id": "1909275928393298247",
      "text": "This is what is so insane about tariff discussion. We’ve seen the model of how you can successfully build or reshore a manufacturing base again and again and again. But in the USA 40 years of business community propaganda convinced everyone this doesn’t work/is socialism!",
      "cleaned_text": "this is what is so insane about tariff discussion we ve seen the model of how you can successfully build or reshore a manufacturing base again and again and again but in the usa 40 years of business community propaganda convinced everyone this doesn t work is socialism ",
      "favorite_count": 310,
      "retweet_count": 35,
      "reply_count": 11,
      "sentiment": "negative",
      "sentiment_score": -0.8713873028755188,
      "original_lang": "en"
    },
    {
      "id": "1909275553720381839",
      "text": "@ArmedPatriot45 Well, as a matter of fact…\n\n💵George Washington, who signed the Tariff Act of 1789\n\n💵 Abraham Lincoln raised tariffs during the Civil War\n\n💵 Barack Obama, who imposed tariffs on China",
      "cleaned_text": " well as a matter of fact george washington who signed the tariff act of 1789 abraham lincoln raised tariffs during the civil war barack obama who imposed tariffs on china",
      "favorite_count": 5,
      "retweet_count": 4,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.3453834652900696,
      "original_lang": "en"
    },
    {
      "id": "1909275473831428238",
      "text": "🇺🇸 TARIFFS BREAKING 🚀 : TRUMP CLAIMS IF CHINA DOESN'T REMOVE 34% TARIFFS BY APRIL 8 USA WILL HIT CHINA WITH AN ADDITIONAL 50% TARIFF STRAIGHT AWAY STARTING FROM APRIL 9TH 2025. https://t.co/lCD1V3wo5E",
      "cleaned_text": " tariffs breaking trump claims if china doesn t remove 34 tariffs by april 8 usa will hit china with an additional 50 tariff straight away starting from april 9th 2025 ",
      "favorite_count": 3,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.399188369512558,
      "original_lang": "en"
    },
    {
      "id": "1909275254070862013",
      "text": "@charliekirk11 So Ursula goes after Elon's suggestion &amp; thus creates a rift between Trump &amp; Musk…\n\nCunning…\n\nBecause Trump would make money from tariffs, complain about all the injustices in the world &amp; get investments in the USA…\nWith a 0/0 it's 1-0 to Musk\nNo tariff revenue \nNo investments",
      "cleaned_text": " so ursula goes after elon s suggestion amp thus creates a rift between trump amp musk cunning because trump would make money from tariffs complain about all the injustices in the world amp get investments in the usa with a 0 0 it s 1 0 to musk no tariff revenue no investments",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.6317281126976013,
      "original_lang": "en"
    },
    {
      "id": "1909274967327318498",
      "text": "The UK Has prepared the following resources in relation to the new tariff imposed by the USA.\n \nhttps://t.co/8KbsMkfSGv\n \nGuide to exporting https://t.co/RVU8fUTWcj\n \nThey are seeking a response to the new USA tariffs to their business in the near future:\nhttps://t.co/eYQSiyj3hB",
      "cleaned_text": "the uk has prepared the following resources in relation to the new tariff imposed by the usa guide to exporting they are seeking a response to the new usa tariffs to their business in the near future ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.13709399104118347,
      "original_lang": "en"
    },
    {
      "id": "1909272306805055805",
      "text": "Last Friday Rega was visited by journalists from @BBCLookEast  and was featured in the lunchtime news today, discussing the impact of the 10% tariff on our export business. With 23% of our export business valuing £2.5million per year going to the USA, the 20% EU tariff would have been catastrophic, and would have likely ended Rega in the USA. Rega are one of the few manufacturers who build and design everything here in the UK using  predominantly UK sourced parts. Watch here: https://t.co/o8sOHZFeNZ\n\n#tariff #trump #ukmanufacturing #madeinbritain #rega #BBC #BBClookeast @SoundOrg",
      "cleaned_text": "last friday rega was visited by journalists from and was featured in the lunchtime news today discussing the impact of the 10 tariff on our export business with 23 of our export business valuing 2 5million per year going to the usa the 20 eu tariff would have been catastrophic and would have likely ended rega in the usa rega are one of the few manufacturers who build and design everything here in the uk using predominantly uk sourced parts watch here ",
      "favorite_count": 21,
      "retweet_count": 2,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.33364105224609375,
      "original_lang": "en"
    },
    {
      "id": "1909271204201971750",
      "text": "U.S. stocks struggled for a third day Monday after President Donald Trump and his administration doubled down on his aggressive, sweeping tariff plan that has rattled markets.https://t.co/HdYhoD3i8I https://t.co/CVVgGvKGg6",
      "cleaned_text": "u s stocks struggled for a third day monday after president donald trump and his administration doubled down on his aggressive sweeping tariff plan that has rattled markets ",
      "favorite_count": 5,
      "retweet_count": 6,
      "reply_count": 6,
      "sentiment": "negative",
      "sentiment_score": -0.908581018447876,
      "original_lang": "en"
    },
    {
      "id": "1909270212244902083",
      "text": "@elonmusk Elon is softening up the base to accept some balance of outcome.  Some manufacturing is coming back, along with better deals between countries that tariff the USA. I'm thinking this is by design.  You're not making Nikes in the US.",
      "cleaned_text": " elon is softening up the base to accept some balance of outcome some manufacturing is coming back along with better deals between countries that tariff the usa i m thinking this is by design you re not making nikes in the us ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.1680472493171692,
      "original_lang": "en"
    },
    {
      "id": "1909270122419671312",
      "text": "@bennyjohnson The tariff war makes it even worse when we still import more than we export. Do the math. We send our businesses overseas for cheaper labor and now crying that we are taken advantage of. From the time they were saying, made in the USA, should have started long ago.",
      "cleaned_text": " the tariff war makes it even worse when we still import more than we export do the math we send our businesses overseas for cheaper labor and now crying that we are taken advantage of from the time they were saying made in the usa should have started long ago ",
      "favorite_count": 4,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.9153614640235901,
      "original_lang": "en"
    },
    {
      "id": "1909268937176731970",
      "text": "China will retaliate. If the USA charges a 104% tariff tomorrow, expect China to reciprocate.\n\nNo side is going to gain from a trade war - but China has the capacity to pump up its economy through colossal stimulus packages, while the US continues to be saddled with debts.",
      "cleaned_text": "china will retaliate if the usa charges a 104 tariff tomorrow expect china to reciprocate no side is going to gain from a trade war but china has the capacity to pump up its economy through colossal stimulus packages while the us continues to be saddled with debts ",
      "favorite_count": 20,
      "retweet_count": 2,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.7491326332092285,
      "original_lang": "en"
    },
    {
      "id": "1909268859976118708",
      "text": "🚨 #BREAKING : Trump says U.S. will impose additional 50% tariff on China from Wednesday if retaliatory measure isn't pulled\n\n📊 #Poll : Do you agree with that 🤔 \n\n#DonaldTrump #stockmarketcrash #USA #China #TradeWar #TariffWar",
      "cleaned_text": " trump says u s will impose additional 50 tariff on china from wednesday if retaliatory measure isn t pulled do you agree with that ",
      "favorite_count": 6,
      "retweet_count": 3,
      "reply_count": 6,
      "sentiment": "negative",
      "sentiment_score": -0.33338063955307007,
      "original_lang": "en"
    },
    {
      "id": "1909268415379882321",
      "text": "Eeek....50% Tariff for China from USA on April 9th, 2025. if they do not withdraw retaliative measures tomorrow. https://t.co/UGi8VtI7ZG",
      "cleaned_text": "eeek 50 tariff for china from usa on april 9th 2025 if they do not withdraw retaliative measures tomorrow ",
      "favorite_count": 3,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.641936719417572,
      "original_lang": "en"
    },
    {
      "id": "1909266607702155635",
      "text": "@allenanalysis He has a 90% tariff on Vietnam &amp; 97% on Cambodia.  Why in the Hell would he make trade “deficits” with smaller, poorer countries part of any tariff equation? They could never purchase the same amount of goods from the USA.",
      "cleaned_text": " he has a 90 tariff on vietnam amp 97 on cambodia why in the hell would he make trade deficits with smaller poorer countries part of any tariff equation they could never purchase the same amount of goods from the usa ",
      "favorite_count": 394,
      "retweet_count": 33,
      "reply_count": 22,
      "sentiment": "negative",
      "sentiment_score": -0.8282182216644287,
      "original_lang": "en"
    },
    {
      "id": "1909266145275682957",
      "text": "people are stupid especially trump supporters. after 34% tariff, it makes no sense/profit for chinese companies to sell goods to USA. lol",
      "cleaned_text": "people are stupid especially trump supporters after 34 tariff it makes no sense profit for chinese companies to sell goods to usa lol",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.9217953681945801,
      "original_lang": "en"
    },
    {
      "id": "1909265948999066047",
      "text": "BREAKING: 🇺🇸🇨🇳 President Trump threatens additional 50% tariff on China if it does not withdraw its 34% tariff increase.\n\n#usa #China #Crypto #TheWhiteLotus #stockmarketcrash #bist100 #TrumpTariffs #ドラマ秘密 https://t.co/2rZVS3SVns",
      "cleaned_text": "breaking president trump threatens additional 50 tariff on china if it does not withdraw its 34 tariff increase ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8346678018569946,
      "original_lang": "en"
    },
    {
      "id": "1909265938148442414",
      "text": "@CollinRugg Tariff rates between the USA and Europe!\nRed  == EU\nBlue == USA https://t.co/eLYUyfqLzm",
      "cleaned_text": " tariff rates between the usa and europe red eu blue usa ",
      "favorite_count": 4,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.12935343384742737,
      "original_lang": "en"
    },
    {
      "id": "1909265332524417131",
      "text": "On Truth Social, President Trump has threatened China with another 50% tariffs on April 9th unless they remove their 34% tariff on US goods. https://t.co/9zgi8skOoF",
      "cleaned_text": "on truth social president trump has threatened china with another 50 tariffs on april 9th unless they remove their 34 tariff on us goods ",
      "favorite_count": 13,
      "retweet_count": 4,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.8917099237442017,
      "original_lang": "en"
    },
    {
      "id": "1909265101070225773",
      "text": "@InfinitaleComic @Luis_GVN Trump has announced a 46% tariff on vietnam\n\nAnd the increase problem is not the actual prices is the incoming increase you are about to receive and why the reserve of the switch2 has been delayed on USA",
      "cleaned_text": " trump has announced a 46 tariff on vietnam and the increase problem is not the actual prices is the incoming increase you are about to receive and why the reserve of the switch2 has been delayed on usa",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.8050218224525452,
      "original_lang": "en"
    },
    {
      "id": "1909264697460953251",
      "text": "Even if you offer Trump zero tariff, he’ll look at the trade balance between EU &amp; USA at the end of the year and still see trade deficit. He calculate tariff based on trade balance right? He’ll still make a lot of noise. What are you gonna do then? Offer him negative tariff rate?",
      "cleaned_text": "even if you offer trump zero tariff he ll look at the trade balance between eu amp usa at the end of the year and still see trade deficit he calculate tariff based on trade balance right he ll still make a lot of noise what are you gonna do then offer him negative tariff rate ",
      "favorite_count": 8,
      "retweet_count": 7,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.3675400912761688,
      "original_lang": "en"
    },
    {
      "id": "1909264225723199675",
      "text": "Trump: USA to place additional 50% tariff on China if they do not withdraw their retaliatory tariffs by April 9th deadline \n\n#MacroEdge",
      "cleaned_text": "trump usa to place additional 50 tariff on china if they do not withdraw their retaliatory tariffs by april 9th deadline ",
      "favorite_count": 109,
      "retweet_count": 9,
      "reply_count": 10,
      "sentiment": "negative",
      "sentiment_score": -0.6846677660942078,
      "original_lang": "en"
    },
    {
      "id": "1909263824131412186",
      "text": "Car A is built in USA &amp; costs the same as Car B built in Japan.\n\nDJT puts a 25% tariff on Car B which then cost $10K more than Car A. Do U think Car A won't raise its price? Say $7K?\n\nDJT says he \"couldn't care less\" about the cost of cars.\nBut Voters Care. #DemVoice1 #DemsUnited https://t.co/auJY033b3P",
      "cleaned_text": "car a is built in usa amp costs the same as car b built in japan djt puts a 25 tariff on car b which then cost 10k more than car a do u think car a won t raise its price say 7k djt says he couldn t care less about the cost of cars but voters care ",
      "favorite_count": 48,
      "retweet_count": 42,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.566413402557373,
      "original_lang": "en"
    },
    {
      "id": "1909263763318174110",
      "text": "🚨 Breaking: EU Drops Zero Tariff Bombshell: Could This Save the Markets?\n\nIn a bold move to de-escalate rising trade tensions, European Commission President @vonderleyen announced the European Union’s offer of a “zero-for-zero” tariff arrangement with the United States. This proposal aims to eliminate tariffs on industrial goods between the two economic powerhouses, fostering a more open and fair trading environment.\n\nThe backdrop to this development is the recent imposition of sweeping tariffs by the U.S., including a 20% levy on imports from the EU, set to take effect this week. These measures have sent shockwaves through global markets, with the S&P 500 experiencing major volatility. Investors are watching every move like hawks.\n\nVon der Leyen emphasized the EU’s preference for negotiation over confrontation, stating, “Europe is always ready for a good deal.” However, she also made it clear that the EU is prepared to implement countermeasures if necessary, underscoring the bloc’s commitment to protecting its economic interests.\n\nAdding to the buzz, @elonmusk jumped into the conversation, backing the elimination of tariffs between the U.S. and Europe. Speaking at a political event in Italy, Musk called for the creation of a free trade zone, highlighting the massive benefits for both economies. You can bet his words are moving markets!\n\nDespite these diplomatic signals, the immediate market response has been turbulent. The @SP500 briefly entered bear market territory, reflecting investor anxiety over the escalating trade conflict. Analysts are warning of recession risks if this high-stakes standoff drags on.\n\nThe coming days are critical. The EU’s proposal offers a potential pathway to de-escalation, but it remains to be seen how @POTUS and the administration will respond. Business leaders, policymakers, and everyday Americans alike are watching closely, hopeful for a resolution that stabilizes markets and promotes economic growth for both sides of the Atlantic.\n\nStay tuned for updates @GetUpUSA — this is far from over.\n\n#TradeWars #Tariffs #EU #US #Economy #ElonMusk #FreeTrade #SP500 #MarketNews #GlobalEconomy #BreakingNews #ZeroTariffs #FinancialNews #VonDerLeyen #Trump #WhiteHouse \n@alx @GetUpUSA @AllNewsMedia, @POTUS, @America, @Reuters, @AP, @nytimes, @BBCNews, @CNN, @FoxNews, @NBCNews, @ABC, @CBSNews",
      "cleaned_text": " breaking eu drops zero tariff bombshell could this save the markets in a bold move to de escalate rising trade tensions european commission president announced the european union s offer of a zero for zero tariff arrangement with the united states this proposal aims to eliminate tariffs on industrial goods between the two economic powerhouses fostering a more open and fair trading environment the backdrop to this development is the recent imposition of sweeping tariffs by the u s including a 20 levy on imports from the eu set to take effect this week these measures have sent shockwaves through global markets with the s p 500 experiencing major volatility investors are watching every move like hawks von der leyen emphasized the eu s preference for negotiation over confrontation stating europe is always ready for a good deal however she also made it clear that the eu is prepared to implement countermeasures if necessary underscoring the bloc s commitment to protecting its economic interests adding to the buzz jumped into the conversation backing the elimination of tariffs between the u s and europe speaking at a political event in italy musk called for the creation of a free trade zone highlighting the massive benefits for both economies you can bet his words are moving markets despite these diplomatic signals the immediate market response has been turbulent the briefly entered bear market territory reflecting investor anxiety over the escalating trade conflict analysts are warning of recession risks if this high stakes standoff drags on the coming days are critical the eu s proposal offers a potential pathway to de escalation but it remains to be seen how and the administration will respond business leaders policymakers and everyday americans alike are watching closely hopeful for a resolution that stabilizes markets and promotes economic growth for both sides of the atlantic stay tuned for updates this is far from over ",
      "favorite_count": 5,
      "retweet_count": 2,
      "reply_count": 1,
      "sentiment": "neutral",
      "sentiment_score": 0.04795566201210022,
      "original_lang": "en"
    },
    {
      "id": "1909262395974807828",
      "text": "USA द्वारा भारत पर 26% tariff लगाने पर इसका क्या असर होगा - \n\n⚡ रुपया कमजोर हो सकता है अधिक आयात का मतलब है अमेरिकी डॉलर की अधिक मांग, जिससे रुपया कमजोर होगा। \n\n⚡ Import महंगा हो जाएगा\n\n⚡ आत्मनिर्भर भारत को नुकसान हो सकता है: यदि अमेरिका भारत पर अमेरिकी सामान खरीदने का दबाव डालता है तो भारत की आत्मनिर्भरता की कोशिश धीमी पड़ सकती है। \n\n⚡ विदेशी निवेश पर प्रभाव: अमेरिकी कंपनियां उच्च टैरिफ से बचने के लिए भारत में स्थानीय उत्पादन पर जोर दे सकती हैं, जिससे FDI को बढ़ावा मिलेगा।",
      "cleaned_text": "usa द व र भ रत पर 26 tariff लग न पर इसक क य असर ह ग र पय कमज र ह सकत ह अध क आय त क मतलब ह अम र क ड लर क अध क म ग ज सस र पय कमज र ह ग import मह ग ह ज एग आत मन र भर भ रत क न कस न ह सकत ह यद अम र क भ रत पर अम र क स म न खर दन क दब व ड लत ह त भ रत क आत मन र भरत क क श श ध म पड सकत ह व द श न व श पर प रभ व अम र क क पन य उच च ट र फ स बचन क ल ए भ रत म स थ न य उत प दन पर ज र द सकत ह ज सस fdi क बढ व म ल ग ",
      "favorite_count": 23,
      "retweet_count": 3,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": -0.01885274052619934,
      "original_lang": "hi"
    },
    {
      "id": "1909262220229218444",
      "text": "Sourced smarter. Made in the USA. \nStay tariff-free and stress-free with USA-made products that simplify sourcing and strengthen your brand. No surprises—just solid, dependable solutions.\nExplore the full collection now on marketplace.\n\nhttps://t.co/NnkxGrB4Vu\n\n#TariffFree https://t.co/CbMZW1woAV",
      "cleaned_text": "sourced smarter made in the usa stay tariff free and stress free with usa made products that simplify sourcing and strengthen your brand no surprises just solid dependable solutions explore the full collection now on marketplace ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.5996239185333252,
      "original_lang": "en"
    },
    {
      "id": "1909261462658253045",
      "text": "@BehizyTweets @realDonaldTrump JUST SAYING ❗\nMEXICO SHOULD HAVE A 100%\nTARIFF FOR CAUSING DAMAGE TO THE USA THAT NOT EVEN CHINA CAN DO❗\nTAKE THE RIO GRANDE RIVER PLEASE❗\nTHAT ALONE, WILL BE EQUIVALENT TO TAKING MEXICO AND MAKE THEM PAY FOR ANY WATER THEY WANT FROM THAT RIVER❗",
      "cleaned_text": " just saying mexico should have a 100 tariff for causing damage to the usa that not even china can do take the rio grande river please that alone will be equivalent to taking mexico and make them pay for any water they want from that river ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8037226796150208,
      "original_lang": "en"
    },
    {
      "id": "1909256408786428105",
      "text": "if his aim is the reasonable “reciprocal tariff” idea.  NOTE THAT BEFORE HE WENT “NUCLEAR”,  NOT ONE MAJOR TRADING PARTNER,  NOT ONE MAJOR ALLY, WAS WILLING TO SERIOUSLY DISCUSS ANY CHANGE FROM THE LOPSIDED TARIFFS THAT DISADVANTAGED THE USA.   \n7)",
      "cleaned_text": "if his aim is the reasonable reciprocal tariff idea note that before he went nuclear not one major trading partner not one major ally was willing to seriously discuss any change from the lopsided tariffs that disadvantaged the usa 7 ",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.8154511451721191,
      "original_lang": "en"
    },
    {
      "id": "1909254410506555476",
      "text": "@musk_news13 Yes you can do.\nRevolutionary Changes already starts. \nNot only USA but all over the world tariff rate will be reduce also.\nWithin 3 months every country will be bound to reduce their high tariff rate. \nPeople of the world will get relief.\nLot of thanks for your tariff policy.",
      "cleaned_text": " yes you can do revolutionary changes already starts not only usa but all over the world tariff rate will be reduce also within 3 months every country will be bound to reduce their high tariff rate people of the world will get relief lot of thanks for your tariff policy ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.30384689569473267,
      "original_lang": "en"
    },
    {
      "id": "1909254163948535897",
      "text": "JUST IN | 🚨 Rumors that NEC Director Hassett said President Trump is considering a 90-day tariff break are NOT true. Hassett responded to the question as follows:\n\n🗣️ “You know the president is going to decide what the president is going to decide...”\n\n#TrumpTariffs | #Tariffs https://t.co/FOdV4l7qD0",
      "cleaned_text": "just in rumors that nec director hassett said president trump is considering a 90 day tariff break are not true hassett responded to the question as follows you know the president is going to decide what the president is going to decide ",
      "favorite_count": 7,
      "retweet_count": 5,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.46418166160583496,
      "original_lang": "en"
    },
    {
      "id": "1909253928262234487",
      "text": "@CanadianKobzar ❗️Trump considering 90-day tariff suspension for all countries except China , says Hassett\n\nSubscribe to Insider \n\nOthers should continue imposing tariffs on the USA because he's like putin trying to play for time regroup and attack the world economy again don't be fooled",
      "cleaned_text": " trump considering 90 day tariff suspension for all countries except china says hassett subscribe to insider others should continue imposing tariffs on the usa because he s like putin trying to play for time regroup and attack the world economy again don t be fooled",
      "favorite_count": 3,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.7491019368171692,
      "original_lang": "en"
    },
    {
      "id": "1909253502993318328",
      "text": "❗️Trump considering 90-day tariff suspension for all countries except China , says Hassett\n\nSubscribe to Insider | Submit \n\n continue imposing tariffs on the USA because he's like putin trying to play for time regroup and attack the world economy again don't be fooled",
      "cleaned_text": " trump considering 90 day tariff suspension for all countries except china says hassett subscribe to insider submit continue imposing tariffs on the usa because he s like putin trying to play for time regroup and attack the world economy again don t be fooled",
      "favorite_count": 1,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.7053390741348267,
      "original_lang": "en"
    },
    {
      "id": "1909251702995165542",
      "text": "As we continue to scale our twitter analytics to new non-english communities starting with Chinese, I realize how @pendle_fi  has a strong mindshare among Chinese CT. \nTranslations shows main trendy keywords are Tariff, USA. \n\nFind this very interesting. \n\nStay tuned for more coming to @_dexuai soon.",
      "cleaned_text": "as we continue to scale our twitter analytics to new non english communities starting with chinese i realize how has a strong mindshare among chinese ct translations shows main trendy keywords are tariff usa find this very interesting stay tuned for more coming to soon ",
      "favorite_count": 33,
      "retweet_count": 4,
      "reply_count": 10,
      "sentiment": "positive",
      "sentiment_score": 0.4406474828720093,
      "original_lang": "en"
    },
    {
      "id": "1909251587077193827",
      "text": "BREAKING: People posting Hasset (Director National Economic Council) indicated that President Trump is considering a 90-day tariff pause for all countries except China.\n\nUSA markets recovered from lows. \n\n#DOWJONES  #NASDAQ #stockmarketcrash",
      "cleaned_text": "breaking people posting hasset director national economic council indicated that president trump is considering a 90 day tariff pause for all countries except china usa markets recovered from lows ",
      "favorite_count": 18,
      "retweet_count": 2,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.3417140543460846,
      "original_lang": "en"
    },
    {
      "id": "1909251394290204922",
      "text": "ICYMI: The Scotts took a deep dive into President Trump's tariff agenda and the rationale behind his trade action plans https://t.co/MTJ3N3tacN",
      "cleaned_text": "icymi the scotts took a deep dive into president trump s tariff agenda and the rationale behind his trade action plans ",
      "favorite_count": 2,
      "retweet_count": 1,
      "reply_count": 0,
      "sentiment": "neutral",
      "sentiment_score": 0.003550887107849121,
      "original_lang": "en"
    },
    {
      "id": "1909251253588156769",
      "text": "“We approve, support, welcome, and cheer President Trump's tariff policy.  For too long, our small communities and towns have been decimated by the loss of industry. We must revive our local communities and industry. We say, BRING IT ON, President Trump!”\n\nListen to America’s Mondays With Mary Flynn O'Neill Podcast for more comments from our fellow Americans as to whether they approve of President Trump’s tariff policy, if they believe tariffs will bring manufacturing back to our country, and if they expect tariffs to bring down prices in the long term. \n\nListen here: https://t.co/vBl7A244Gp",
      "cleaned_text": " we approve support welcome and cheer president trump s tariff policy for too long our small communities and towns have been decimated by the loss of industry we must revive our local communities and industry we say bring it on president trump listen to america s mondays with mary flynn o neill podcast for more comments from our fellow americans as to whether they approve of president trump s tariff policy if they believe tariffs will bring manufacturing back to our country and if they expect tariffs to bring down prices in the long term listen here ",
      "favorite_count": 9,
      "retweet_count": 3,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.21025222539901733,
      "original_lang": "en"
    },
    {
      "id": "1909251118498226223",
      "text": "It didn't take long for the EU to give in to President Trump's tariff increases.\n\nhttps://t.co/39LzPL2zxW",
      "cleaned_text": "it didn t take long for the eu to give in to president trump s tariff increases ",
      "favorite_count": 132,
      "retweet_count": 20,
      "reply_count": 22,
      "sentiment": "negative",
      "sentiment_score": -0.4684973955154419,
      "original_lang": "en"
    },
    {
      "id": "1909249728866353559",
      "text": "@marvinmusk Good in the past 2 months. Now, no good for you. Tariff suppress the US politically and economically. If you stay around people hate you thinking you help the “cowboy” to destroy USA. Get back to yourself, an high skilled engineer, an intelligent entrepreneur, a pure hearted man.",
      "cleaned_text": " good in the past 2 months now no good for you tariff suppress the us politically and economically if you stay around people hate you thinking you help the cowboy to destroy usa get back to yourself an high skilled engineer an intelligent entrepreneur a pure hearted man ",
      "favorite_count": 2,
      "retweet_count": 0,
      "reply_count": 0,
      "sentiment": "negative",
      "sentiment_score": -0.8718273639678955,
      "original_lang": "en"
    },
    {
      "id": "1909249481109053580",
      "text": "Again – no tariffs at all shouldn't be the goal of a tariff strategy.\n\nThe goal is to make it less profitable to import foreign goods rather than just making it in the USA.\n\nEveryone is competing for American consumers.",
      "cleaned_text": "again no tariffs at all shouldn t be the goal of a tariff strategy the goal is to make it less profitable to import foreign goods rather than just making it in the usa everyone is competing for american consumers ",
      "favorite_count": 39,
      "retweet_count": 1,
      "reply_count": 3,
      "sentiment": "negative",
      "sentiment_score": -0.3589869737625122,
      "original_lang": "en"
    },
    {
      "id": "1909249120088318126",
      "text": "The EU has offered Zero for Zero tariffs to the US in response to Trump's recipricol tariff rates, shoud the USA take this deal?",
      "cleaned_text": "the eu has offered zero for zero tariffs to the us in response to trump s recipricol tariff rates shoud the usa take this deal ",
      "favorite_count": 10,
      "retweet_count": 2,
      "reply_count": 3,
      "sentiment": "negative",
      "sentiment_score": -0.43836212158203125,
      "original_lang": "en"
    },
    {
      "id": "1909248220888244532",
      "text": "Trump's wisdom: \n\nThe USA total trade deficit: $917 billion from the world.\n\nHe announced tariff war ....and the result:\n9 trillion loss in the USA stock markets! 🤯\n\nTo save $917 billion he has already blown up $9 trillion",
      "cleaned_text": "trump s wisdom the usa total trade deficit 917 billion from the world he announced tariff war and the result 9 trillion loss in the usa stock markets to save 917 billion he has already blown up 9 trillion",
      "favorite_count": 169,
      "retweet_count": 66,
      "reply_count": 21,
      "sentiment": "negative",
      "sentiment_score": -0.2496052086353302,
      "original_lang": "en"
    },
    {
      "id": "1909246356545282389",
      "text": "So, Intellectual Property is managed by the WTO in the form of TRIPS agreements. But Trump has blown up the tariff space and made the WTO worthless when it involves the USA. So I guess that none of the signatories to TRIPS have to worry about enforcing US IP anymore?",
      "cleaned_text": "so intellectual property is managed by the wto in the form of trips agreements but trump has blown up the tariff space and made the wto worthless when it involves the usa so i guess that none of the signatories to trips have to worry about enforcing us ip anymore ",
      "favorite_count": 7,
      "retweet_count": 6,
      "reply_count": 3,
      "sentiment": "negative",
      "sentiment_score": -0.75086909532547,
      "original_lang": "en"
    },
    {
      "id": "1909245628556927431",
      "text": "EU says they are willing to go with a zero for zero tariff with the USA. Hold the line! https://t.co/ds2vqZZnbJ",
      "cleaned_text": "eu says they are willing to go with a zero for zero tariff with the usa hold the line ",
      "favorite_count": 116,
      "retweet_count": 20,
      "reply_count": 14,
      "sentiment": "positive",
      "sentiment_score": 0.1990351676940918,
      "original_lang": "en"
    },
    {
      "id": "1909244355430199574",
      "text": "Join in at 8 pm \n\nWILL USA ATTACK IRAN? \n\nWill also discuss the Trump Tariff mayhem and opportunity for India. \nhttps://t.co/DofYZ2qzRI via @YouTube",
      "cleaned_text": "join in at 8 pm will usa attack iran will also discuss the trump tariff mayhem and opportunity for india via ",
      "favorite_count": 5,
      "retweet_count": 2,
      "reply_count": 1,
      "sentiment": "neutral",
      "sentiment_score": -0.028189361095428467,
      "original_lang": "en"
    },
    {
      "id": "1909243225061064755",
      "text": "बांग्लादेश ने अमेरिका से 3 महीने तक टैरिफ रोकने का अनुरोध कियाः यूनुस सरकार \n\n#Bangladesh #USA #Tariff #TradeRelations #Bharatsamachar https://t.co/8inGnR0os2",
      "cleaned_text": "ब ग ल द श न अम र क स 3 मह न तक ट र फ र कन क अन र ध क य य न स सरक र ",
      "favorite_count": 6,
      "retweet_count": 2,
      "reply_count": 0,
      "sentiment": "positive",
      "sentiment_score": 0.06461487710475922,
      "original_lang": "hi"
    },
    {
      "id": "1909242671614599168",
      "text": "So then every country that has placed a tariff on America has been an act of war?\n\nBuffett inadvertently supports Trump tariffs.",
      "cleaned_text": "so then every country that has placed a tariff on america has been an act of war buffett inadvertently supports trump tariffs ",
      "favorite_count": 19,
      "retweet_count": 4,
      "reply_count": 3,
      "sentiment": "negative",
      "sentiment_score": -0.8620389699935913,
      "original_lang": "en"
    },
    {
      "id": "1909241146619932930",
      "text": "If you are referring to the over quota tariffs, you have them too\n\nThe USA has over quota tariffs on Canada & other countries which was first initiated under Smoot Hawley Tariff Act in the 1930’s. \n\nThe United States applies over-quota tariffs, also known as tariff-rate quotas (TRQs), to certain imported goods when they exceed a predetermined quota allowed at a lower or zero tariff rate. These tariffs protect domestic producers by making excess imports cost-prohibitive. \n\n### Dairy Products\nThe U.S. imposes significant over-quota tariffs on dairy to shield its producers. \n- **Cheese**: Rates vary by type:\n  - Cheddar: 12% to 16.8% over-quota, but some specialty cheeses (e.g., Swiss) can hit $1.70/kg or higher specific duties, effectively 20-30% depending on price.\n  - Blue-veined (e.g., Roquefort): Up to 35% or $2.11/kg.\n  - Other cheeses: Often 10-25%, with specific duties (e.g., $1.05-$2.27/kg) adding cost.\n- **Butter**: 10% to 30.9%, or specific rates like $1.541/kg, which can exceed 50% ad valorem equivalent for low-cost imports.\n- **Milk Powder (Nonfat Dry Milk)**: Around 3.9% to 25%, with specific duties (e.g., $0.775/kg) boosting effective rates.\n- **Fluid Milk/Cream**: Up to 77.2% or $0.657/liter, though rarely triggered due to low import volumes.\n\nQuotas are small—e.g., 5.4 million kg for cheddar annually—and over-quota rates apply once exceeded. For context, U.S. dairy imports were $4.1 billion in 2023, mostly within-quota from partners like the EU and New Zealand.\n\n### Sugar\nSugar TRQs are a cornerstone of U.S. agricultural policy:\n- **Raw Cane Sugar**: Over-quota tariff is about 33.87 cents/kg (roughly 150-200% ad valorem, depending on world prices), compared to 1.4606 cents/kg within-quota.\n- **Refined Sugar**: Up to 35.74 cents/kg over-quota (over 100% equivalent), vs. 3.6606 cents/kg within-quota.\n\nThe USDA sets quotas annually (e.g., 1.117 million metric tons for raw sugar in 2023), with over-quota rates deterring excess imports. Mexico, under USMCA, has quota-free access up to a negotiated limit, but beyond that, these rates apply.\n\n### Beef\nBeef TRQs target imports from non-FTA partners (e.g., outside USMCA, Australia, etc.):\n- **Fresh/Chilled/Frozen Beef**: 26.4% over-quota, vs. 4-10% within-quota or free from FTA countries like Canada.\n- Quota: Around 696,000 metric tons annually, with countries like Argentina facing over-quota rates if they exceed allocations.\n\n### Peanuts\nPeanuts have some of the highest U.S. over-quota tariffs:\n- **Shelled Peanuts**: 131.8% over-quota, vs. 6.6 cents/kg within-quota.\n- **Peanut Butter**: Up to 163.8% over-quota.\n- Quota: About 20,000 metric tons, protecting U.S. growers in states like Georgia.\n\n### Cotton and Tobacco\n- **Cotton**: Over-quota rates can reach 31.4 cents/kg (roughly 36% equivalent), vs. 1.5 cents/kg within-quota. Quota is around 41,000 metric tons.\n- **Tobacco**: Up to 350% over-quota (e.g., $4.62/kg), vs. 37.5 cents/kg within-quota, though imports are niche.\n\n### Other Goods\n- **Chocolate/Cocoa Products**: 15-20% over-quota, with specific duties (e.g., $0.52/kg).\n- **Tuna (Canned)**: 12.5% over-quota, vs. 6% within-quota.\n\n### Mechanism and Context\n- **How TRQs Work**: The U.S. Trade Representative (USTR) and USDA allocate quotas, often through trade agreements (e.g., WTO, USMCA). Within-quota imports get preferential rates (often 0% from FTA partners like Canada), while over-quota imports face the “most-favored-nation” (MFN) rate or higher specific duties from the Harmonized Tariff Schedule (HTS).\n- **Administration**: The U.S. Customs Service tracks imports, applying over-quota rates when thresholds are crossed. \n- **Trade Agreements**: USMCA eliminates over-quota tariffs for Canada and Mexico on most goods (e.g., dairy up to 50,000 tons for Canada), but non-FTA countries (e.g., Brazil, India) face them.\n\nIn summary, U.S. over-quota tariffs range from 10% (dairy) to 350% (tobacco), with peanuts (163.8%) and sugar (150-200%) among the highest",
      "cleaned_text": "if you are referring to the over quota tariffs you have them too the usa has over quota tariffs on canada other countries which was first initiated under smoot hawley tariff act in the 1930 s the united states applies over quota tariffs also known as tariff rate quotas trqs to certain imported goods when they exceed a predetermined quota allowed at a lower or zero tariff rate these tariffs protect domestic producers by making excess imports cost prohibitive dairy products the u s imposes significant over quota tariffs on dairy to shield its producers cheese rates vary by type cheddar 12 to 16 8 over quota but some specialty cheeses e g swiss can hit 1 70 kg or higher specific duties effectively 20 30 depending on price blue veined e g roquefort up to 35 or 2 11 kg other cheeses often 10 25 with specific duties e g 1 05 2 27 kg adding cost butter 10 to 30 9 or specific rates like 1 541 kg which can exceed 50 ad valorem equivalent for low cost imports milk powder nonfat dry milk around 3 9 to 25 with specific duties e g 0 775 kg boosting effective rates fluid milk cream up to 77 2 or 0 657 liter though rarely triggered due to low import volumes quotas are small e g 5 4 million kg for cheddar annually and over quota rates apply once exceeded for context u s dairy imports were 4 1 billion in 2023 mostly within quota from partners like the eu and new zealand sugar sugar trqs are a cornerstone of u s agricultural policy raw cane sugar over quota tariff is about 33 87 cents kg roughly 150 200 ad valorem depending on world prices compared to 1 4606 cents kg within quota refined sugar up to 35 74 cents kg over quota over 100 equivalent vs 3 6606 cents kg within quota the usda sets quotas annually e g 1 117 million metric tons for raw sugar in 2023 with over quota rates deterring excess imports mexico under usmca has quota free access up to a negotiated limit but beyond that these rates apply beef beef trqs target imports from non fta partners e g outside usmca australia etc fresh chilled frozen beef 26 4 over quota vs 4 10 within quota or free from fta countries like canada quota around 696 000 metric tons annually with countries like argentina facing over quota rates if they exceed allocations peanuts peanuts have some of the highest u s over quota tariffs shelled peanuts 131 8 over quota vs 6 6 cents kg within quota peanut butter up to 163 8 over quota quota about 20 000 metric tons protecting u s growers in states like georgia cotton and tobacco cotton over quota rates can reach 31 4 cents kg roughly 36 equivalent vs 1 5 cents kg within quota quota is around 41 000 metric tons tobacco up to 350 over quota e g 4 62 kg vs 37 5 cents kg within quota though imports are niche other goods chocolate cocoa products 15 20 over quota with specific duties e g 0 52 kg tuna canned 12 5 over quota vs 6 within quota mechanism and context how trqs work the u s trade representative ustr and usda allocate quotas often through trade agreements e g wto usmca within quota imports get preferential rates often 0 from fta partners like canada while over quota imports face the most favored nation mfn rate or higher specific duties from the harmonized tariff schedule hts administration the u s customs service tracks imports applying over quota rates when thresholds are crossed trade agreements usmca eliminates over quota tariffs for canada and mexico on most goods e g dairy up to 50 000 tons for canada but non fta countries e g brazil india face them in summary u s over quota tariffs range from 10 dairy to 350 tobacco with peanuts 163 8 and sugar 150 200 among the highest",
      "favorite_count": 4,
      "retweet_count": 1,
      "reply_count": 1,
      "sentiment": "negative",
      "sentiment_score": -0.25348758697509766,
      "original_lang": "en"
    },
    {
      "id": "1909239590239510899",
      "text": "@disclosetv Offer it for everything. \n\nYou want the full protection of the USA yet want to charge us a tariff for everything? Most of Europe gets way more time off of work than Americans do. \n\nLazy continent for the most part \n\nCharging us tariffs so you can try to break the USD",
      "cleaned_text": " offer it for everything you want the full protection of the usa yet want to charge us a tariff for everything most of europe gets way more time off of work than americans do lazy continent for the most part charging us tariffs so you can try to break the usd",
      "favorite_count": 263,
      "retweet_count": 25,
      "reply_count": 11,
      "sentiment": "negative",
      "sentiment_score": -0.8738173842430115,
      "original_lang": "en"
    },
    {
      "id": "1909239199879880810",
      "text": "BREAKING: US stocks plunge for the third straight day as recession fears grow following Trump's aggressive tariff plan.\n https://t.co/HHb9PxbsY6",
      "cleaned_text": "breaking us stocks plunge for the third straight day as recession fears grow following trump s aggressive tariff plan ",
      "favorite_count": 17,
      "retweet_count": 7,
      "reply_count": 12,
      "sentiment": "negative",
      "sentiment_score": -0.40462350845336914,
      "original_lang": "en"
    },
    {
      "id": "1909237945178931487",
      "text": "VDL is laying trap as European Auto would flood USA as its better quality in zero tariff regime.",
      "cleaned_text": "vdl is laying trap as european auto would flood usa as its better quality in zero tariff regime ",
      "favorite_count": 12,
      "retweet_count": 1,
      "reply_count": 2,
      "sentiment": "negative",
      "sentiment_score": -0.3564727008342743,
      "original_lang": "en"
    }
  ]
}