{
  "timestamp": "20250407_150225",
  "query": "IPL 2024",
  "count": 2,
  "translations": [
    {
      "original_text": "IPL-16,  धोनी अब वो फिनिशर नहीं रहे जो कभी अकेले मैच पलट देते थे\n\nचेन्नई की लगातार हार में, उनका गिरता प्रदर्शन भी बड़ा कारण बनता जा रहा है\n\nवक्त है या तो खुद को बदलने का,या फिर टीम के लिए बड़ा फैसला लेने का,,,,\nऋतुराज गायकवाड शिवम दुबे यह ऐसे प्लेयर थे जिन्होंने आईपीएल 2024 में कोहराम मचा रखा था लेकिन इस बार गायकवाड को पता नहीं क्या हो गया है \n\nलगातार हो रही हर पर चेन्नई को आत्म मंथन करना होगा वरना ऐसा ना हो कि बहुत देर हो जाए,,,,,\n#CSKvDC\n#MSDhoni",
      "translated_text": "IPL-16, Dhoni is no longer a finisher who used to overtake the match alone\n\nIn the constant defeat of Chennai, his falling performance is also becoming a major reason.\n\nThe time is to either change itself, or to take a big decision for the team,\nRituraj Gaikwad Shivam Dubey was a player who created a furore in IPL 2024 but this time Gaikwad does not know what has happened \n\nChennai will have to brainstorm on everyone being constantly happening, otherwise it should not happen that it is too late ,,,,,,\n#CSKVDC\n#MSDhoni",
      "original_lang": "hi",
      "translated": true,
      "id": "1908526612221395011"
    },
    {
      "original_text": "आईपीएल और WPL के 2023 के प्ले ऑफ के दौरान BCCI ने एक डॉट गेंद के बदले 500 पेड़ लगाने की मुहिम की घोषणा की थी। 2023और 2024 ipl और WPL के आंकड़ों के अनुसार लगभग 8000 डॉट बॉल्स फेंकी गईं, मतलब लगभग 40लाख पेड़ लगाए जाने चाहिए थे किसी को पता है?ये पेड़ कब लगे?कहाँ लगे? #bcci #TATAIPL",
      "translated_text": "During the 2023 play -off of IPL and WPL, BCCI announced a campaign to plant 500 trees in exchange for a dot ball. According to data from 2023 and 2024 IPL and WPL, about 8000 dot balls were thrown, meaning about 40 lakh trees should have been planted, no one knows? When did these trees be planted? Where? #BCCI #TATAPL",
      "original_lang": "hi",
      "translated": true,
      "id": "1907829269612433532"
    }
  ]
}