{
  "timestamp": "20250422_192732",
  "query": "USA Tariff",
  "count": 4,
  "translations": [
    {
      "original_text": "World : Donald Trump के विरोध में पूरे America में प्रदर्शन ? Tariff | USA |\n\nमहज कुछ ही महीने हुए हैं Donald Trump को दोबारा सत्ता में आए, लेकिन जनता सड़कों पर उतर आई है । 50 राज्यों में 1200 से ज्यादा लोगों ने Trump की नीतियों के खिलाफ प्रदर्शन किया । विरोध कर रही भीड़ ने Trump को ही निशाना नहीं बनाया, बल्कि उनके करीबी सहयोगी और कारोबारी Elon Musk के खिलाफ भी नारेबाजी की । देखिये ये खास रिपोर्ट  \n\n#usa #donaldtrump #america #ustariffs #elonmusk #internationalpolitics",
      "translated_text": "Performing throughout America against World: Donald Trump? Tariff | Usa |\n\nIt has been just a few months to come to power again Donald Trump, but the public has come out on the streets. More than 1200 people in 50 states demonstrated against Trump's policies. The protesting mob not only targeted Trump, but also shouted slogans against his close aide and businessman Elon Musk. See this special report  \n\n#USA",
      "original_lang": "hi",
      "translated": true,
      "id": "1914598335853306286"
    },
    {
      "original_text": "क्या टैरिफ़ में गिरावट ने तमाम उभरती अर्थव्यवस्थाओं में विकास को रफ़्तार दी है? अगर ऐसा है तो अब समय आ गया है कि हम विकास के अब तक के सफ़र और रणनीतियों का नए सिरे से मूल्यांकन करें. #USA #Tariff #Economy #India https://t.co/TRYQKQUvVk",
      "translated_text": "Has the decline in tariffs speed up development in all emerging economies? If this is the case, then the time has come that we should revive the journey and strategies of development so far. #USA #TARIFF",
      "original_lang": "hi",
      "translated": true,
      "id": "1914129459684450422"
    },
    {
      "original_text": "USA China Tariff War: चीन पर नरम पड़े अमेरिका के तेवर? राष्ट्रपति Donald Trump ने कह दी बड़ी बात\n\n#USA #China #TariffWar #DonaldTrump \n\nhttps://t.co/FTrGPi13gS",
      "translated_text": "Usa China Tariff War: America's attitude on China? President Donald Trump said a big thing\n\n#USA #China #tariffwar \n\nhttps://t.co/FTRGPI13GS",
      "original_lang": "hi",
      "translated": true,
      "id": "1913116072485548392"
    },
    {
      "original_text": "@camangalarvind Tata motors ka 535  का भाव दुबारा नहीं आएगा \nएक रिपोर्ट के मुताबिक भारत, EU k बीच में व्यापार समझोता में भारत में आने वाली कारों के दाम कम हो जायेंगे , इससे tata motors कि जैगुआर कार सस्ती हो जाएगी, टाटा मोटर्स कि सेल बढ़ जाएगी जो USA  tariff कि वजह से कम हो सकती है",
      "translated_text": "@camangalarvind tata motors ka 535 price will not come again \nAccording to a report, India, EUK in the middle of the trade understanding will reduce the prices of cars coming in India, this will make the jaguar car cheaper, Tata Motors will increase the sale of Tata Motors which can reduce due to the USA TARIFF",
      "original_lang": "hi",
      "translated": true,
      "id": "1913087128101359630"
    }
  ]
}