{
  "timestamp": "20250407_144246",
  "query": "IPL 2025",
  "count": 8,
  "translations": [
    {
      "original_text": "@imrakeshGoswami @JaikyYadav16 @JaikyYadav16 ये \"गंध\" MS Dhoni के IPL 2025 में धीमे प्रदर्शन से है, खासकर CSK vs DC मैच में, जहाँ 26 गेंदों पर 30 रन बनाए और टीम हार गई। फैंस बंटे हैं - कुछ रिटायरमेंट चाहते हैं, तो कुछ उनके पुराने योगदान के लिए सपोर्ट करते हैं। X पर ये बहस गरम है! https://t.co/eAzQ4h3sdK https://t.co/7SElhRn6Jp",
      "translated_text": "@imrakeshgoswami @jaikyyada16 @jaikyyadav16 This \"smell\" is from MS Dhoni's slow performance in IPL 2025, especially in CSK vs DC match, where the team scored 30 runs off 26 balls and the team lost. Fans are divided - some want retirement, some support for their old contribution. This debate on x is hot! https://t.co/eazq4h3sdk https://t.co/7Selhrn6jp",
      "original_lang": "hi",
      "translated": true,
      "id": "1909137009295188176"
    },
    {
      "original_text": "यह तस्वीर मुंबई इंडियंस के प्रैक्टिस सेशन से आई है। रोहित शर्मा के घुटनों में किसी तरह की कोई तकलीफ नजर नहीं आ रही है। आखिरी मैच में लखनऊ के खिलाफ ड्रॉप होने के बाद रोहित शर्मा रॉयल चैलेंजर्स बेंगलुरु के खिलाफ वापसी करेंगे। मुंबई इंडियंस ने IPl 2025 से पहले रोहित शर्मा को 16.30 करोड़ रुपये में रिटेन किया था। क्या आपको लगता है कि आउट ऑफ फॉर्म चल रहे रोहित शर्मा अपनी उपयोगिता साबित कर पाएंगे?\n#SRHvGT",
      "translated_text": "This picture came from the practice session of Mumbai Indians. There is no problem of any kind in Rohit Sharma's knees. Rohit Sharma will return against Royal Challengers Bangalore after being dropped against Lucknow in the last match. Mumbai Indians retained Rohit Sharma for Rs 16.30 crore before IPL 2025. Do you think Rohit Sharma, who is running out of form, will be able to prove his utility?\n#SRHVGT",
      "original_lang": "hi",
      "translated": true,
      "id": "1909075118971576389"
    },
    {
      "original_text": "हां या ना: सिराज को पावरप्ले में अतिरिक्त ओवर देना मास्टर स्ट्रोक था\n\nहैदराबाद में खेले गए IPL 2025 के 19वें मुक़ाबले SRH vs GT से जुड़े अहम सवालों पर @RayuduAmbati का फ़ैसला\n\n@imsyedhussain\n\n#IPL2025 #SRHvGT https://t.co/21BpInnZ6X",
      "translated_text": "Yes or no: Siraj was a master stroke giving extra over in the powerplay\n\n@Rayuduambati's decision on important questions related to SRH Vs GT of IPL 2025 played in Hyderabad\n\n@imsyedhussain\n\n#PL2025 #SRHVGT https://t.co/21bpinnz6x",
      "original_lang": "hi",
      "translated": true,
      "id": "1909075026625646693"
    },
    {
      "original_text": "जयपुर में #IPL 2025 का जुनून! राजस्थान रॉयल्स के दीवाने रात 2 बजे से SMS स्टेडियम के बाहर कतार में. डूंगरपुर, बाड़मेर, दौसा से आए इन युवाओं का जोश देखिए. क्या इनकी मेहनत रंग लाएगी? आपका क्या कहना है?  \n#IPL2025 #Jaipur #RajasthanRoyals\n#Jaipur #ipltickets https://t.co/5fWyqw6yot",
      "translated_text": "#IPL 2025 passion in Jaipur! Rajasthan Royals crazy from 2 pm in queue outside SMS Stadium. See the enthusiasm of these youths from Dungarpur, Barmer, Dausa. Will their hard work bring color? What do you have to say?  \n#IPL2025 #Jaipur #Rajasthanroyals\n#Jaipur #iplTICkets https://t.co/5fwyqw6yot",
      "original_lang": "hi",
      "translated": true,
      "id": "1909074849059782836"
    },
    {
      "original_text": "IPL 2025 में आज MI बनाम RCB की कांटे की टक्कर\n\nIPL 2025 का 20वां मुकाबला आज वानखेड़े में मुंबई इंडियंस और रॉयल चैलेंजर्स बैंगलोर के बीच खेला जाएगा। MI ने अब तक एक ही मैच जीता है और आठवें स्थान पर है, वहीं RCB दो मैच जीतकर प्वाइंट्स टेबल में दूसरे स्थान पर है।\n\n#IPL2025 #MIvsRCB #T20Thriller #WankhedeStadium #CricketFever",
      "translated_text": "Today Mi vs RCB collision in IPL 2025\n\nThe 20th match of IPL 2025 will be played between Mumbai Indians and Royal Challengers Bangalore in Wankhede today. Mi has won the same match so far and is in eighth place, while RCB is in second place in the points table by winning two matches.\n\n#PL2025 #MivSRCB #T20thriller #Wankhedestadium #Cricketfever",
      "original_lang": "hi",
      "translated": true,
      "id": "1909074280060445163"
    },
    {
      "original_text": "सनराइजर्स हैदराबाद को IPL 2025 में लगातार चौथी हार झेलनी पड़ी है। होम टीम को गुजरात ने 7 विकेट से हराया। गुजरात ने लगातार तीसरा मैच जीता है।\n#GTvsSRH #Cricket #Sports #IPL2025 \nपढ़ें मैच रिपोर्ट- https://t.co/61AfqgbHOk https://t.co/csLJ3gIZ4m",
      "translated_text": "Sunrisers Hyderabad have suffered a fourth consecutive defeat in IPL 2025. Gujarat defeated the home team by 7 wickets. Gujarat has won the third consecutive match.\n#GTVSSRH #Crickt #Sports #IPL2025 \nRead match report- https://t.co/61afqgbhok https://t.co/CSLJ3GIZ4M",
      "original_lang": "hi",
      "translated": true,
      "id": "1908937040516759910"
    },
    {
      "original_text": "SRH vs GT Live Score, IPL 2025: शुभमन गिल की क्लास और सिराज की रफ्तार ने पैट कमिंस के छुड़ाए पसीने, गुजरात ने हैदराबाद को 7 विकेट से रौंदा\n#GTvsSRH #GTvSRH https://t.co/oHecuxdY8y",
      "translated_text": "SRH vs GT Live Score, IPL 2025: Shubman Gill's class and Siraj's speed rescued Pat Cummins, Gujarat crushed Hyderabad by 7 wickets\n#GTVSSRH #GTVSRH https://t.co/ohecuxdy8y",
      "original_lang": "hi",
      "translated": true,
      "id": "1908935595164074372"
    },
    {
      "original_text": "सनराइजर्स हैदराबाद को IPL 2025 में लगातार चौथी हार झेलनी पड़ी है। होम टीम को गुजरात ने 7 विकेट से हराया। गुजरात ने लगातार तीसरा मैच जीता है। \"   #SRHvGT",
      "translated_text": "Sunrisers Hyderabad have suffered a fourth consecutive defeat in IPL 2025. Gujarat defeated the home team by 7 wickets. Gujarat has won the third consecutive match. \"#SRHVGT",
      "original_lang": "hi",
      "translated": true,
      "id": "1908935488679112973"
    }
  ]
}